$(document).ready(function() {




    $(document).on('click','#addTree',function() {
        var cardNo = $(this)
            .attr('data-cardno');
        var childCardNo = $(this).attr(
            'data-childcardno');
        var gender = $(this)
            .attr('data-gender');
        var branch = $(this)
            .attr('data-branch');
        var title = $(this).attr("data-title");
        var treeNo = $(this)
            .attr("data-treeNo");
        var familyType = $('#checkFamilyType')
            .val();
        var family = '';

        $.each($('input:radio[name=family]'),function() {
            if ($(this).is(':checked')) {
                family = $(this).val();
            }
        });

        // 먼저 가계도를 그리기.

        if (family) {

            var relation = '';
            var compare = Math
                .abs(10000 - parseInt(branch));

            if (family == '아버지'
                || family == '어머니') {
                relation = compare + 1;
            } else if (family == '배우자') {
                relation = compare + 0;
            } else if (family == '형'
                || family == '누나'
                || family == '남동생'
                || family == '여동생') {
                relation = compare + 2;
            } else if (family == '아들'
                || family == '딸') {
                relation = compare + 1;
            }

            var familyData = [];

            if (familyType == 'm1') {
                if (gender == 'M') {
                    familyData = FTI;
                } else {
                    familyData = FTIF;
                }

            } else if (familyType == 'm2') {
                if (gender == 'M') {
                    familyData = FTIM2;
                } else {
                    familyData = FTIFM2;
                }

            } else if (familyType == 'w1') {
                familyData = FTIW1;
            } else if (familyType == 'w2') {
                familyData = FTIW2;
            } else if (familyType == 'h1') {
                familyData = FTIH1;
            } else if (familyType == 'h2') {
                familyData = FTIH2;
            }

            var newTitle = familyData.filter(function(familyData) {
                return familyData.title == title;
            });

            var realTitle = "";

            if (!newTitle) {
                realTitle = '호칭없음';
            } else {
                realTitle = newTitle[0].connection[family];
            }

            if(!realTitle){
                realTitle = '호칭없음';
            }

            var newRelation = relation;
            var kinshipType = 1;
            console.log("newtitle", newTitle);
            console.log("타이틀", realTitle);
            //return false;



        }

    });

});


// 남자 : 친가
var FTI = [ {
    gender : 'M',
    title : '부',
    connection : {
        '배우자' : '모',
        '아버지' : '조부',
        '어머니' : '조모',
        '누나' : '고모',
        '형' : '백부',
        '남동생' : '숙부',
        '여동생' : '고모',
        '아들' : '남동생',
        '딸' : '여동생'
    }
}, {
    gender : 'M',
    title : '모',
    connection : {
        '배우자' : '부',
        '아버지' : '조부',
        '어머니' : '조모',
        '누나' : '고모',
        '형' : '백부',
        '남동생' : '숙부',
        '여동생' : '고모',
        '아들' : '남동생',
        '딸' : '여동생'
    }
}, {
    gender : 'M',
    title : '아버지',
    connection : {
        '배우자' : '모',
        '아버지' : '조부',
        '어머니' : '조모',
        '누나' : '고모',
        '형' : '백부',
        '남동생' : '숙부',
        '여동생' : '고모',
        '아들' : '남동생',
        '딸' : '여동생'
    }
}, {
    gender : 'M',
    title : '어머니',
    connection : {
        '배우자' : '부',
        '아버지' : '조부',
        '어머니' : '조모',
        '누나' : '고모',
        '형' : '백부',
        '남동생' : '숙부',
        '여동생' : '고모',
        '아들' : '남동생',
        '딸' : '여동생'
    }
}, {
    gender : 'M',
    title : '백부',
    connection : {
        '배우자' : '백모',
        '아버지' : '조부',
        '어머니' : '조모',
        '누나' : '고모',
        '형' : '백부',
        '남동생' : '숙부',
        '여동생' : '고모',
        '아들' : '종형제',
        '딸' : '종남매'
    }
}, {
    gender : 'M',
    title : '숙부',
    connection : {
        '배우자' : '숙모',
        '아버지' : '조부',
        '어머니' : '조모',
        '누나' : '고모',
        '형' : '숙부',
        '남동생' : '숙부',
        '여동생' : '고모',
        '아들' : '종형제',
        '딸' : '종남매'
    }
}, {
    gender : 'M',
    title : '고모',
    connection : {
        '배우자' : '고모부',
        '아버지' : '조부',
        '어머니' : '조모',
        '언니' : '고모',
        '오빠' : '숙부',
        '남동생' : '숙부',
        '여동생' : '고모',
        '아들' : '내종형제',
        '딸' : '내종남매'
    }
}, {
    gender : 'M',
    title : '조부',
    connection : {
        '배우자' : '조모',
        '아버지' : '증조부',
        '어머니' : '증조모',
        '누나' : '대고모',
        '형' : '종조부',
        '남동생' : '종조부',
        '여동생' : '대고모',
        '아들' : '숙부',
        '딸' : '고모'
    }
}, {
    gender : 'M',
    title : '종조부',
    connection : {
        '배우자' : '종조모',
        '아버지' : '고조부',
        '어머니' : '고조모',
        '누나' : '대고모',
        '형' : '종조부',
        '남동생' : '종조부',
        '여동생' : '대고모',
        '아들' : '종숙부',
        '딸' : '종고모'
    }
}, {
    gender : 'M',
    title : '대고모',
    connection : {
        '배우자' : '대고모부',
        '아버지' : '고조부',
        '어머니' : '고조모',
        '언니' : '대고모',
        '오빠' : '종조부',
        '남동생' : '종조부',
        '여동생' : '대고모',
        '아들' : '내종숙부',
        '딸' : '내종고모'
    }
}, {
    gender : 'M',
    title : '증조부',
    connection : {
        '배우자' : '증조모',
        '아버지' : '고조부',
        '어머니' : '고조모',
        '아들' : '종조부',
        '딸' : '대고모'
    }
}, {
    gender : 'M',
    title : '고조부',
    connection : {
        '배우자' : '고조모',
        '아버지' : '현조부',
        '어머니' : '현조모'
    }
}, {
    gender : 'M',
    title : '현조부',
    connection : {
        '배우자' : '현조모',
        '아버지' : '6대조부',
        '어머니' : '6대조모'
    }
}, {
    gender : 'M',
    title : '6대조부',
    connection : {
        '배우자' : '6대조모',
        '아버지' : '7대조부',
        '어머니' : '7대조모'
    }
}, {
    gender : 'M',
    title : '7대조부',
    connection : {
        '배우자' : '7대조모',
        '아버지' : '8대조부',
        '어머니' : '8대조모'
    }
}, {
    gender : 'M',
    title : '8대조부',
    connection : {
        '배우자' : '8대조모',
        '아버지' : '9대조부',
        '어머니' : '9대조모'
    }
}, {
    gender : 'M',
    title : '9대조부',
    connection : {
        '배우자' : '9대조모',
        '아버지' : '10대조부',
        '어머니' : '10대조모'
    }
}, {
    gender : 'M',
    title : '종형제',
    connection : {
        '배우자' : '종수',
        '아버지' : '백부',
        '어머니' : '백모',
        '누나' : '종남매',
        '형' : '종형제',
        '남동생' : '종형제',
        '여동생' : '종남매',
        '아들' : '종질',
        '딸' : '종질녀'
    }
}, {
    gender : 'M',
    title : '종남매',
    connection : {
        '배우자' : '종매부',
        '아버지' : '백부',
        '어머니' : '백모',
        '언니' : '종남매',
        '오빠' : '종형제',
        '남동생' : '종형제',
        '여동생' : '종남매',
        '아들' : '생종질',
        '딸' : '생종질녀'
    }
}, {
    gender : 'M',
    title : '종질',
    connection : {
        '배우자' : '종질부',
        '아버지' : '종형제',
        '어머니' : '종수',
        '누나' : '종질녀',
        '형' : '종질',
        '남동생' : '종질',
        '여동생' : '종질녀',
        '아들' : '재종손자',
        '딸' : '재종손부'
    }
}, {
    gender : 'M',
    title : '종질녀',
    connection : {
        '배우자' : '종질서',
        '아버지' : '종형제',
        '어머니' : '종수',
        '언니' : '종질녀',
        '오빠' : '종질',
        '남동생' : '종질',
        '여동생' : '종질녀',
        '아들' : '정보없음',
        '딸' : '정보없음'
    }
}, {
    gender : 'M',
    title : '종생질',
    connection : {
        '배우자' : '종생질부',
        '아버지' : '종매부',
        '어머니' : '종남매',
        '누나' : '종질녀',
        '형' : '종질',
        '남동생' : '종질',
        '여동생' : '종질녀',
        '아들' : '재종손자',
        '딸' : '재종손부'
    }
}, {
    gender : 'M',
    title : '종생질녀',
    connection : {
        '배우자' : '종생질서',
        '아버지' : '종매부',
        '어머니' : '종남매',
        '언니' : '종질녀',
        '오빠' : '종질',
        '남동생' : '종질',
        '여동생' : '종질녀',
        '아들' : '정보없음',
        '딸' : '정보없음'
    }
}, {
    gender : 'M',
    title : '재종손자',
    connection : {
        '배우자' : '재종손부',
        '아버지' : '종질',
        '어머니' : '종질부',
        '누나' : '재종손자',
        '형' : '재종손자',
        '남동생' : '재종손자',
        '여동생' : '재종손녀',
        '아들' : '정보없음',
        '딸' : '정보없음'
    }
}, {
    gender : 'M',
    title : '재종손녀',
    connection : {
        '배우자' : '재종손서',
        '아버지' : '종질',
        '어머니' : '종질부',
        '언니' : '재종손녀',
        '오빠' : '재종손자',
        '남동생' : '재종손자',
        '여동생' : '재종손녀',
        '아들' : '정보없음',
        '딸' : '정보없음'
    }
}, {
    gender : 'M',
    title : '내종형제',
    connection : {
        '배우자' : '내종수',
        '아버지' : '고모부',
        '어머니' : '고모',
        '누나' : '내종남매',
        '형' : '내종형제',
        '남동생' : '내종형제',
        '여동생' : '내종남매',
        '아들' : '내종질',
        '딸' : '내종질녀'
    }
}, {
    gender : 'M',
    title : '내종남매',
    connection : {
        '배우자' : '내종매부',
        '아버지' : '고모부',
        '어머니' : '고모',
        '언니' : '내종남매',
        '오빠' : '내종형제',
        '남동생' : '내종형제',
        '여동생' : '내종남매',
        '아들' : '내종생질',
        '딸' : '내종생질녀'
    }
}, {
    gender : 'M',
    title : '내종질',
    connection : {
        '배우자' : '내종질부',
        '아버지' : '내종형제',
        '어머니' : '내종수',
        '누나' : '내종질녀',
        '형' : '내종질',
        '남동생' : '내종질',
        '여동생' : '내종질녀',
        '아들' : '정보없음',
        '딸' : '정보없음'
    }
}, {
    gender : 'M',
    title : '내종질녀',
    connection : {
        '배우자' : '내종질서',
        '아버지' : '내종형제',
        '어머니' : '내종수',
        '언니' : '내종질녀',
        '오빠' : '내종질',
        '남동생' : '내종질',
        '여동생' : '내종질녀',
        '아들' : '정보없음',
        '딸' : '정보없음'
    }
}, {
    gender : 'M',
    title : '내종생질',
    connection : {
        '배우자' : '내종생질부',
        '아버지' : '내종매부',
        '어머니' : '내종남매',
        '누나' : '내종생질녀',
        '형' : '내종생질',
        '남동생' : '내종생질',
        '여동생' : '내종생질녀',
        '아들' : '정보없음',
        '딸' : '정보없음'
    }
}, {
    gender : 'M',
    title : '내종생질녀',
    connection : {
        '배우자' : '내종생질서',
        '아버지' : '내종매부',
        '어머니' : '내종남매',
        '언니' : '내종생질녀',
        '오빠' : '내종생질',
        '남동생' : '내종생질',
        '여동생' : '내종생질녀',
        '아들' : '정보없음',
        '딸' : '정보없음'
    }
}, {
    gender : 'M',
    title : '나',
    connection : {
        '배우자' : '아내',
        '아버지' : '부',
        '어머니' : '모',
        '누나' : '누나',
        '형' : '형',
        '남동생' : '남동생',
        '여동생' : '여동생',
        '아들' : '아들',
        '딸' : '딸'
    }
}, {
    gender : 'M',
    title : '아들',
    connection : {
        '배우자' : '며느리',
        '아버지' : '나',
        '어머니' : '아내',
        '누나' : '딸',
        '형' : '아들',
        '남동생' : '아들',
        '여동생' : '딸',
        '아들' : '손자',
        '딸' : '손녀'
    }
}, {
    gender : 'M',
    title : '손자',
    connection : {
        '배우자' : '손부',
        '아버지' : '아들',
        '어머니' : '며느리',
        '누나' : '손녀',
        '형' : '손자',
        '남동생' : '손자',
        '여동생' : '손녀',
        '아들' : '증손자',
        '딸' : '증손녀'
    }
}, {
    gender : 'F',
    title : '손녀',
    connection : {
        '배우자' : '손서',
        '아버지' : '아들',
        '어머니' : '며느리',
        '언니' : '손녀',
        '오빠' : '손자',
        '남동생' : '손자',
        '여동생' : '손녀',
        '아들' : '외증손자',
        '딸' : '외증손녀'
    }
}, {
    gender : 'M',
    title : '증손자',
    connection : {
        '배우자' : '증손부',
        '아버지' : '손자',
        '어머니' : '손부',
        '누나' : '증손녀',
        '형' : '증손자',
        '남동생' : '증손자',
        '여동생' : '증손녀',
        '아들' : '고손자',
        '딸' : '고손녀'
    }
}, {
    gender : 'F',
    title : '증손녀',
    connection : {
        '배우자' : '증손서',
        '아버지' : '손자',
        '어머니' : '손부',
        '언니' : '증손녀',
        '오빠' : '증손자',
        '남동생' : '증손자',
        '여동생' : '증손녀',
        '아들' : '외고손자',
        '딸' : '외고손녀'
    }
}, {
    gender : 'M',
    title : '고손자',
    connection : {
        '배우자' : '고손부',
        '아버지' : '증손자',
        '어머니' : '증손부',
        '누나' : '고손녀',
        '형' : '고손자',
        '남동생' : '고손자',
        '여동생' : '고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '고손녀',
    connection : {
        '배우자' : '고손서',
        '아버지' : '증손자',
        '어머니' : '증손부',
        '언니' : '고손녀',
        '오빠' : '고손자',
        '남동생' : '고손자',
        '여동생' : '고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '딸',
    connection : {
        '배우자' : '사위',
        '아버지' : '나',
        '어머니' : '아내',
        '언니' : '딸',
        '오빠' : '아들',
        '남동생' : '아들',
        '여동생' : '딸',
        '아들' : '외손자',
        '딸' : '외손녀'
    }
}, {
    gender : 'M',
    title : '외손자',
    connection : {
        '배우자' : '외손자부',
        '아버지' : '사위',
        '어머니' : '딸',
        '누나' : '외손녀',
        '형' : '외손자',
        '남동생' : '외손자',
        '여동생' : '외손녀',
        '아들' : '외증손자',
        '딸' : '외증손녀'
    }
}, {
    gender : 'M',
    title : '외손녀',
    connection : {
        '배우자' : '외손서',
        '아버지' : '사위',
        '어머니' : '딸',
        '언니' : '외손녀',
        '오빠' : '외손자',
        '남동생' : '외손자',
        '여동생' : '외손녀',
        '아들' : '외증손자',
        '딸' : '외증손녀'
    }
}, {
    gender : 'M',
    title : '외고손자',
    connection : {
        '배우자' : '외고손부',
        '아버지' : '증손서',
        '어머니' : '증손녀',
        '누나' : '외고손녀',
        '형' : '외고손자',
        '남동생' : '외고손자',
        '여동생' : '외고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '외고손녀',
    connection : {
        '배우자' : '외고손서',
        '아버지' : '증손서',
        '어머니' : '증손녀',
        '언니' : '외고손녀',
        '오빠' : '외고손자',
        '남동생' : '외고손자',
        '여동생' : '외고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '외증손자',
    connection : {
        '배우자' : '외증손부',
        '아버지' : '손서',
        '어머니' : '손녀',
        '누나' : '외증손녀',
        '형' : '외증손자',
        '남동생' : '외증손자',
        '여동생' : '외증손녀',
        '아들' : '외고손자',
        '딸' : '외고손녀'
    }
}, {
    gender : 'F',
    title : '외증손녀',
    connection : {
        '배우자' : '외증손서',
        '아버지' : '손서',
        '어머니' : '손녀',
        '언니' : '외증손녀',
        '오빠' : '외증손자',
        '남동생' : '외증손자',
        '여동생' : '외증손녀',
        '아들' : '외고손자',
        '딸' : '외고손녀'
    }
},
    {
        gender : 'M',
        title : '형',
        connection : {
            '배우자' : '형수',
            '아버지' : '아버지',
            '어머니' : '어머니',
            '누나' : '누나',
            '형' : '형',
            '남동생' : '형',
            '여동생' : '누나',
            '아들' : '질',
            '딸' : '질녀'
        }
    }, {
        gender : 'M',
        title : '질',
        connection : {
            '배우자' : '질부',
            '아버지' : '형',
            '어머니' : '형수',
            '누나' : '질녀',
            '형' : '질',
            '남동생' : '질',
            '여동생' : '질녀',
            '아들' : '종손자',
            '딸' : '종손녀'
        }
    }, {
        gender : 'M',
        title : '종손자',
        connection : {
            '배우자' : '종손부',
            '아버지' : '질',
            '어머니' : '질부',
            '누나' : '종손녀',
            '형' : '종손자',
            '남동생' : '종손자',
            '여동생' : '종손녀',
            '아들' : '종증손자',
            '딸' : '종증손녀'
        }
    }, {
        gender : 'M',
        title : '종증손자',
        connection : {
            '배우자' : '종증손부',
            '아버지' : '종손자',
            '어머니' : '종손부',
            '누나' : '종증손녀',
            '형' : '종증손자',
            '남동생' : '종증손자',
            '여동생' : '종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '종증손녀',
        connection : {
            '배우자' : '종증손서',
            '아버지' : '종손자',
            '어머니' : '종손부',
            '언니' : '종증손녀',
            '오빠' : '종증손자',
            '남동생' : '종증손자',
            '여동생' : '종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '종손녀',
        connection : {
            '배우자' : '종손서',
            '아버지' : '질',
            '어머니' : '질부',
            '언니' : '종손녀',
            '오빠' : '종손자',
            '남동생' : '종손자',
            '여동생' : '종손녀',
            '아들' : '종외증손자',
            '딸' : '종외증손녀'
        }
    }, {
        gender : 'M',
        title : '종외증손자',
        connection : {
            '배우자' : '종외증손부',
            '아버지' : '종손서',
            '어머니' : '종손녀',
            '누나' : '종외증손녀',
            '형' : '종외증손자',
            '남동생' : '종외증손자',
            '여동생' : '종외증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '종외증손녀',
        connection : {
            '배우자' : '종외증손서',
            '아버지' : '종손서',
            '어머니' : '종손녀',
            '언니' : '종외증손녀',
            '오빠' : '종외증손자',
            '남동생' : '종외증손자',
            '여동생' : '종외증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '질녀',
        connection : {
            '배우자' : '질서',
            '아버지' : '형',
            '어머니' : '형수',
            '언니' : '질녀',
            '오빠' : '질',
            '남동생' : '질',
            '여동생' : '질녀',
            '아들' : '외종손자',
            '딸' : '외종손녀'
        }
    }, {
        gender : 'M',
        title : '외종손자',
        connection : {
            '배우자' : '외종손부',
            '아버지' : '질서',
            '어머니' : '질녀',
            '누나' : '외종손녀',
            '형' : '외종손자',
            '남동생' : '외종손자',
            '여동생' : '외종손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '외종손녀',
        connection : {
            '배우자' : '외종손서',
            '아버지' : '질서',
            '어머니' : '질녀',
            '언니' : '외종손녀',
            '오빠' : '외종손자',
            '남동생' : '외종손자',
            '여동생' : '외종손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'M',
        title : '남동생',
        connection : {
            '배우자' : '제수',
            '아버지' : '아버지',
            '어머니' : '어머니',
            '누나' : '여동생',
            '형' : '남동생',
            '남동생' : '남동생',
            '여동생' : '여동생',
            '아들' : '질',
            '딸' : '질녀'
        }
    }, {
        gender : 'F',
        title : '누나',
        connection : {
            '배우자' : '자형',
            '아버지' : '아버지',
            '어머니' : '어머니',
            '언니' : '누나',
            '오빠' : '형',
            '남동생' : '형',
            '여동생' : '누나',
            '아들' : '생질',
            '딸' : '생질녀'
        }
    }, {
        gender : 'M',
        title : '생질',
        connection : {
            '배우자' : '생질부',
            '아버지' : '자형',
            '어머니' : '누나',
            '누나' : '생질녀',
            '형' : '생질',
            '남동생' : '생질',
            '여동생' : '생질녀',
            '아들' : '생종손자',
            '딸' : '생종손녀'
        }
    }, {
        gender : 'M',
        title : '생종손자',
        connection : {
            '배우자' : '생종손부',
            '아버지' : '생질',
            '어머니' : '생질부',
            '누나' : '생종손녀',
            '형' : '생종손자',
            '남동생' : '생종손자',
            '여동생' : '생종손녀',
            '아들' : '생종증손자',
            '딸' : '생종증손녀'
        }
    }, {
        gender : 'M',
        title : '생종증손자',
        connection : {
            '배우자' : '생종증손부',
            '아버지' : '생종손자',
            '어머니' : '생종손부',
            '누나' : '생종증손녀',
            '형' : '생종증손자',
            '남동생' : '생종증손자',
            '여동생' : '생종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '생종증손녀',
        connection : {
            '배우자' : '생종증손서',
            '아버지' : '생종손자',
            '어머니' : '생종손부',
            '언니' : '생종증손녀',
            '오빠' : '생종증손자',
            '남동생' : '생종증손자',
            '여동생' : '생종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '생종손녀',
        connection : {
            '배우자' : '생종손서',
            '아버지' : '생질',
            '어머니' : '생질부',
            '언니' : '생종손녀',
            '오빠' : '생종손자',
            '남동생' : '생종손자',
            '여동생' : '생종손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '생질녀',
        connection : {
            '배우자' : '생질서',
            '아버지' : '자형',
            '어머니' : '누나',
            '언니' : '생질녀',
            '오빠' : '생질',
            '남동생' : '생질',
            '여동생' : '생질녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '여동생',
        connection : {
            '배우자' : '매제',
            '아버지' : '아버지',
            '어머니' : '어머니',
            '언니' : '여동생',
            '오빠' : '남동생',
            '남동생' : '남동생',
            '여동생' : '여동생',
            '아들' : '생질',
            '딸' : '생질녀'
        }
    } ];

// 여자 친가
var FTIF = [ {
    gender : 'M',
    title : '부',
    connection : {
        '배우자' : '모',
        '아버지' : '조부',
        '어머니' : '조모',
        '누나' : '고모',
        '형' : '백부',
        '남동생' : '숙부',
        '여동생' : '고모',
        '아들' : '남동생',
        '딸' : '여동생'
    }
}, {
    gender : 'M',
    title : '모',
    connection : {
        '배우자' : '부',
        '아버지' : '조부',
        '어머니' : '조모',
        '누나' : '고모',
        '형' : '백부',
        '남동생' : '숙부',
        '여동생' : '고모',
        '아들' : '남동생',
        '딸' : '여동생'
    }
}, {
    gender : 'M',
    title : '아버지',
    connection : {
        '배우자' : '모',
        '아버지' : '조부',
        '어머니' : '조모',
        '누나' : '고모',
        '형' : '백부',
        '남동생' : '숙부',
        '여동생' : '고모',
        '아들' : '남동생',
        '딸' : '여동생'
    }
}, {
    gender : 'M',
    title : '어머니',
    connection : {
        '배우자' : '부',
        '아버지' : '조부',
        '어머니' : '조모',
        '누나' : '고모',
        '형' : '백부',
        '남동생' : '숙부',
        '여동생' : '고모',
        '아들' : '남동생',
        '딸' : '여동생'
    }
}, {
    gender : 'M',
    title : '백부',
    connection : {
        '배우자' : '백모',
        '아버지' : '조부',
        '어머니' : '조모',
        '누나' : '고모',
        '형' : '백부',
        '남동생' : '숙부',
        '여동생' : '고모',
        '아들' : '종형제',
        '딸' : '종남매'
    }
}, {
    gender : 'M',
    title : '숙부',
    connection : {
        '배우자' : '숙모',
        '아버지' : '조부',
        '어머니' : '조모',
        '누나' : '고모',
        '형' : '숙부',
        '남동생' : '숙부',
        '여동생' : '고모',
        '아들' : '종형제',
        '딸' : '종남매'
    }
}, {
    gender : 'M',
    title : '고모',
    connection : {
        '배우자' : '고모부',
        '아버지' : '조부',
        '어머니' : '조모',
        '언니' : '고모',
        '오빠' : '숙부',
        '남동생' : '숙부',
        '여동생' : '고모',
        '아들' : '내종형제',
        '딸' : '내종남매'
    }
}, {
    gender : 'M',
    title : '조부',
    connection : {
        '배우자' : '조모',
        '아버지' : '증조부',
        '어머니' : '증조모',
        '누나' : '대고모',
        '형' : '종조부',
        '남동생' : '종조부',
        '여동생' : '대고모',
        '아들' : '숙부',
        '딸' : '고모'
    }
}, {
    gender : 'M',
    title : '종조부',
    connection : {
        '배우자' : '종조모',
        '아버지' : '고조부',
        '어머니' : '고조모',
        '누나' : '대고모',
        '형' : '종조부',
        '남동생' : '종조부',
        '여동생' : '대고모',
        '아들' : '종숙부',
        '딸' : '종고모'
    }
}, {
    gender : 'M',
    title : '대고모',
    connection : {
        '배우자' : '대고모부',
        '아버지' : '고조부',
        '어머니' : '고조모',
        '언니' : '대고모',
        '오빠' : '종조부',
        '남동생' : '종조부',
        '여동생' : '대고모',
        '아들' : '내종숙부',
        '딸' : '내종고모'
    }
}, {
    gender : 'M',
    title : '증조부',
    connection : {
        '배우자' : '증조모',
        '아버지' : '고조부',
        '어머니' : '고조모',
        '아들' : '종조부',
        '딸' : '대고모'
    }
}, {
    gender : 'M',
    title : '고조부',
    connection : {
        '배우자' : '고조모',
        '아버지' : '현조부',
        '어머니' : '현조모'
    }
}, {
    gender : 'M',
    title : '현조부',
    connection : {
        '배우자' : '현조모',
        '아버지' : '6대조부',
        '어머니' : '6대조모'
    }
}, {
    gender : 'M',
    title : '6대조부',
    connection : {
        '배우자' : '6대조모',
        '아버지' : '7대조부',
        '어머니' : '7대조모'
    }
}, {
    gender : 'M',
    title : '7대조부',
    connection : {
        '배우자' : '7대조모',
        '아버지' : '8대조부',
        '어머니' : '8대조모'
    }
}, {
    gender : 'M',
    title : '8대조부',
    connection : {
        '배우자' : '8대조모',
        '아버지' : '9대조부',
        '어머니' : '9대조모'
    }
}, {
    gender : 'M',
    title : '9대조부',
    connection : {
        '배우자' : '9대조모',
        '아버지' : '10대조부',
        '어머니' : '10대조모'
    }
}, {
    gender : 'M',
    title : '종형제',
    connection : {
        '배우자' : '종수',
        '아버지' : '백부',
        '어머니' : '백모',
        '누나' : '종남매',
        '형' : '종형제',
        '남동생' : '종형제',
        '여동생' : '종남매',
        '아들' : '종질',
        '딸' : '종질녀'
    }
}, {
    gender : 'M',
    title : '종남매',
    connection : {
        '배우자' : '종매부',
        '아버지' : '백부',
        '어머니' : '백모',
        '언니' : '종남매',
        '오빠' : '종형제',
        '남동생' : '종형제',
        '여동생' : '종남매',
        '아들' : '생종질',
        '딸' : '생종질녀'
    }
}, {
    gender : 'M',
    title : '종질',
    connection : {
        '배우자' : '종질부',
        '아버지' : '종형제',
        '어머니' : '종수',
        '누나' : '종질녀',
        '형' : '종질',
        '남동생' : '종질',
        '여동생' : '종질녀',
        '아들' : '재종손자',
        '딸' : '재종손부'
    }
}, {
    gender : 'M',
    title : '종질녀',
    connection : {
        '배우자' : '종질서',
        '아버지' : '종형제',
        '어머니' : '종수',
        '언니' : '종질녀',
        '오빠' : '종질',
        '남동생' : '종질',
        '여동생' : '종질녀',
        '아들' : '정보없음',
        '딸' : '정보없음'
    }
}, {
    gender : 'M',
    title : '종생질',
    connection : {
        '배우자' : '종생질부',
        '아버지' : '종매부',
        '어머니' : '종남매',
        '누나' : '종질녀',
        '형' : '종질',
        '남동생' : '종질',
        '여동생' : '종질녀',
        '아들' : '재종손자',
        '딸' : '재종손부'
    }
}, {
    gender : 'M',
    title : '종생질녀',
    connection : {
        '배우자' : '종생질서',
        '아버지' : '종매부',
        '어머니' : '종남매',
        '언니' : '종질녀',
        '오빠' : '종질',
        '남동생' : '종질',
        '여동생' : '종질녀',
        '아들' : '정보없음',
        '딸' : '정보없음'
    }
}, {
    gender : 'M',
    title : '재종손자',
    connection : {
        '배우자' : '재종손부',
        '아버지' : '종질',
        '어머니' : '종질부',
        '누나' : '재종손자',
        '형' : '재종손자',
        '남동생' : '재종손자',
        '여동생' : '재종손녀',
        '아들' : '정보없음',
        '딸' : '정보없음'
    }
}, {
    gender : 'M',
    title : '재종손녀',
    connection : {
        '배우자' : '재종손서',
        '아버지' : '종질',
        '어머니' : '종질부',
        '언니' : '재종손녀',
        '오빠' : '재종손자',
        '남동생' : '재종손자',
        '여동생' : '재종손녀',
        '아들' : '정보없음',
        '딸' : '정보없음'
    }
}, {
    gender : 'M',
    title : '내종형제',
    connection : {
        '배우자' : '내종수',
        '아버지' : '고모부',
        '어머니' : '고모',
        '누나' : '내종남매',
        '형' : '내종형제',
        '남동생' : '내종형제',
        '여동생' : '내종남매',
        '아들' : '내종질',
        '딸' : '내종질녀'
    }
}, {
    gender : 'M',
    title : '내종남매',
    connection : {
        '배우자' : '내종매부',
        '아버지' : '고모부',
        '어머니' : '고모',
        '언니' : '내종남매',
        '오빠' : '내종형제',
        '남동생' : '내종형제',
        '여동생' : '내종남매',
        '아들' : '내종생질',
        '딸' : '내종생질녀'
    }
}, {
    gender : 'M',
    title : '내종질',
    connection : {
        '배우자' : '내종질부',
        '아버지' : '내종형제',
        '어머니' : '내종수',
        '누나' : '내종질녀',
        '형' : '내종질',
        '남동생' : '내종질',
        '여동생' : '내종질녀',
        '아들' : '정보없음',
        '딸' : '정보없음'
    }
}, {
    gender : 'M',
    title : '내종질녀',
    connection : {
        '배우자' : '내종질서',
        '아버지' : '내종형제',
        '어머니' : '내종수',
        '언니' : '내종질녀',
        '오빠' : '내종질',
        '남동생' : '내종질',
        '여동생' : '내종질녀',
        '아들' : '정보없음',
        '딸' : '정보없음'
    }
}, {
    gender : 'M',
    title : '내종생질',
    connection : {
        '배우자' : '내종생질부',
        '아버지' : '내종매부',
        '어머니' : '내종남매',
        '누나' : '내종생질녀',
        '형' : '내종생질',
        '남동생' : '내종생질',
        '여동생' : '내종생질녀',
        '아들' : '정보없음',
        '딸' : '정보없음'
    }
}, {
    gender : 'M',
    title : '내종생질녀',
    connection : {
        '배우자' : '내종생질서',
        '아버지' : '내종매부',
        '어머니' : '내종남매',
        '언니' : '내종생질녀',
        '오빠' : '내종생질',
        '남동생' : '내종생질',
        '여동생' : '내종생질녀',
        '아들' : '정보없음',
        '딸' : '정보없음'
    }
}, {
    gender : 'M',
    title : '나',
    connection : {
        '배우자' : '남편',
        '아버지' : '부',
        '어머니' : '모',
        '언니' : '언니',
        '오빠' : '오빠',
        '남동생' : '남동생',
        '여동생' : '여동생',
        '아들' : '아들',
        '딸' : '딸'
    }
}, {
    gender : 'M',
    title : '아들',
    connection : {
        '배우자' : '며느리',
        '아버지' : '나',
        '어머니' : '아내',
        '누나' : '딸',
        '형' : '아들',
        '남동생' : '아들',
        '여동생' : '딸',
        '아들' : '손자',
        '딸' : '손녀'
    }
}, {
    gender : 'M',
    title : '손자',
    connection : {
        '배우자' : '손부',
        '아버지' : '아들',
        '어머니' : '며느리',
        '누나' : '손녀',
        '형' : '손자',
        '남동생' : '손자',
        '여동생' : '손녀',
        '아들' : '증손자',
        '딸' : '증손녀'
    }
}, {
    gender : 'F',
    title : '손녀',
    connection : {
        '배우자' : '손서',
        '아버지' : '아들',
        '어머니' : '며느리',
        '언니' : '손녀',
        '오빠' : '손자',
        '남동생' : '손자',
        '여동생' : '손녀',
        '아들' : '외증손자',
        '딸' : '외증손녀'
    }
}, {
    gender : 'M',
    title : '증손자',
    connection : {
        '배우자' : '증손부',
        '아버지' : '손자',
        '어머니' : '손부',
        '누나' : '증손녀',
        '형' : '증손자',
        '남동생' : '증손자',
        '여동생' : '증손녀',
        '아들' : '고손자',
        '딸' : '고손녀'
    }
}, {
    gender : 'F',
    title : '증손녀',
    connection : {
        '배우자' : '증손서',
        '아버지' : '손자',
        '어머니' : '손부',
        '언니' : '증손녀',
        '오빠' : '증손자',
        '남동생' : '증손자',
        '여동생' : '증손녀',
        '아들' : '외고손자',
        '딸' : '외고손녀'
    }
}, {
    gender : 'M',
    title : '고손자',
    connection : {
        '배우자' : '고손부',
        '아버지' : '증손자',
        '어머니' : '증손부',
        '누나' : '고손녀',
        '형' : '고손자',
        '남동생' : '고손자',
        '여동생' : '고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '고손녀',
    connection : {
        '배우자' : '고손서',
        '아버지' : '증손자',
        '어머니' : '증손부',
        '언니' : '고손녀',
        '오빠' : '고손자',
        '남동생' : '고손자',
        '여동생' : '고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '딸',
    connection : {
        '배우자' : '사위',
        '아버지' : '나',
        '어머니' : '아내',
        '언니' : '딸',
        '오빠' : '아들',
        '남동생' : '아들',
        '여동생' : '딸',
        '아들' : '외손자',
        '딸' : '외손녀'
    }
}, {
    gender : 'M',
    title : '외손자',
    connection : {
        '배우자' : '외손자부',
        '아버지' : '사위',
        '어머니' : '딸',
        '누나' : '외손녀',
        '형' : '외손자',
        '남동생' : '외손자',
        '여동생' : '외손녀',
        '아들' : '외증손자',
        '딸' : '외증손녀'
    }
}, {
    gender : 'M',
    title : '외손녀',
    connection : {
        '배우자' : '외손서',
        '아버지' : '사위',
        '어머니' : '딸',
        '언니' : '외손녀',
        '오빠' : '외손자',
        '남동생' : '외손자',
        '여동생' : '외손녀',
        '아들' : '외증손자',
        '딸' : '외증손녀'
    }
}, {
    gender : 'M',
    title : '외고손자',
    connection : {
        '배우자' : '외고손부',
        '아버지' : '증손서',
        '어머니' : '증손녀',
        '누나' : '외고손녀',
        '형' : '외고손자',
        '남동생' : '외고손자',
        '여동생' : '외고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '외고손녀',
    connection : {
        '배우자' : '외고손서',
        '아버지' : '증손서',
        '어머니' : '증손녀',
        '언니' : '외고손녀',
        '오빠' : '외고손자',
        '남동생' : '외고손자',
        '여동생' : '외고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '외증손자',
    connection : {
        '배우자' : '외증손부',
        '아버지' : '손서',
        '어머니' : '손녀',
        '누나' : '외증손녀',
        '형' : '외증손자',
        '남동생' : '외증손자',
        '여동생' : '외증손녀',
        '아들' : '외고손자',
        '딸' : '외고손녀'
    }
}, {
    gender : 'F',
    title : '외증손녀',
    connection : {
        '배우자' : '외증손서',
        '아버지' : '손서',
        '어머니' : '손녀',
        '언니' : '외증손녀',
        '오빠' : '외증손자',
        '남동생' : '외증손자',
        '여동생' : '외증손녀',
        '아들' : '외고손자',
        '딸' : '외고손녀'
    }
},
    {
        gender : 'M',
        title : '오빠',
        connection : {
            '배우자' : '형부',
            '아버지' : '아버지',
            '어머니' : '어머니',
            '누나' : '언니',
            '형' : '오빠',
            '남동생' : '오빠',
            '여동생' : '언니',
            '아들' : '질',
            '딸' : '질녀'
        }
    }, {
        gender : 'M',
        title : '질',
        connection : {
            '배우자' : '질부',
            '아버지' : '형',
            '어머니' : '형수',
            '누나' : '질녀',
            '형' : '질',
            '남동생' : '질',
            '여동생' : '질녀',
            '아들' : '종손자',
            '딸' : '종손녀'
        }
    }, {
        gender : 'M',
        title : '종손자',
        connection : {
            '배우자' : '종손부',
            '아버지' : '질',
            '어머니' : '질부',
            '누나' : '종손녀',
            '형' : '종손자',
            '남동생' : '종손자',
            '여동생' : '종손녀',
            '아들' : '종증손자',
            '딸' : '종증손녀'
        }
    }, {
        gender : 'M',
        title : '종증손자',
        connection : {
            '배우자' : '종증손부',
            '아버지' : '종손자',
            '어머니' : '종손부',
            '누나' : '종증손녀',
            '형' : '종증손자',
            '남동생' : '종증손자',
            '여동생' : '종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '종증손녀',
        connection : {
            '배우자' : '종증손서',
            '아버지' : '종손자',
            '어머니' : '종손부',
            '언니' : '종증손녀',
            '오빠' : '종증손자',
            '남동생' : '종증손자',
            '여동생' : '종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '종손녀',
        connection : {
            '배우자' : '종손서',
            '아버지' : '질',
            '어머니' : '질부',
            '언니' : '종손녀',
            '오빠' : '종손자',
            '남동생' : '종손자',
            '여동생' : '종손녀',
            '아들' : '종외증손자',
            '딸' : '종외증손녀'
        }
    }, {
        gender : 'M',
        title : '종외증손자',
        connection : {
            '배우자' : '종외증손부',
            '아버지' : '종손서',
            '어머니' : '종손녀',
            '누나' : '종외증손녀',
            '형' : '종외증손자',
            '남동생' : '종외증손자',
            '여동생' : '종외증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '종외증손녀',
        connection : {
            '배우자' : '종외증손서',
            '아버지' : '종손서',
            '어머니' : '종손녀',
            '언니' : '종외증손녀',
            '오빠' : '종외증손자',
            '남동생' : '종외증손자',
            '여동생' : '종외증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '질녀',
        connection : {
            '배우자' : '질서',
            '아버지' : '형',
            '어머니' : '형수',
            '언니' : '질녀',
            '오빠' : '질',
            '남동생' : '질',
            '여동생' : '질녀',
            '아들' : '외종손자',
            '딸' : '외종손녀'
        }
    }, {
        gender : 'M',
        title : '외종손자',
        connection : {
            '배우자' : '외종손부',
            '아버지' : '질서',
            '어머니' : '질녀',
            '누나' : '외종손녀',
            '형' : '외종손자',
            '남동생' : '외종손자',
            '여동생' : '외종손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '외종손녀',
        connection : {
            '배우자' : '외종손서',
            '아버지' : '질서',
            '어머니' : '질녀',
            '언니' : '외종손녀',
            '오빠' : '외종손자',
            '남동생' : '외종손자',
            '여동생' : '외종손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'M',
        title : '남동생',
        connection : {
            '배우자' : '제수',
            '아버지' : '아버지',
            '어머니' : '어머니',
            '누나' : '여동생',
            '형' : '남동생',
            '남동생' : '남동생',
            '여동생' : '여동생',
            '아들' : '질',
            '딸' : '질녀'
        }
    }, {
        gender : 'F',
        title : '언니',
        connection : {
            '배우자' : '자형',
            '아버지' : '아버지',
            '어머니' : '어머니',
            '언니' : '언니',
            '오빠' : '오빠',
            '남동생' : '오빠',
            '여동생' : '언니',
            '아들' : '생질',
            '딸' : '생질녀'
        }
    }, {
        gender : 'M',
        title : '생질',
        connection : {
            '배우자' : '생질부',
            '아버지' : '자형',
            '어머니' : '누나',
            '누나' : '생질녀',
            '형' : '생질',
            '남동생' : '생질',
            '여동생' : '생질녀',
            '아들' : '생종손자',
            '딸' : '생종손녀'
        }
    }, {
        gender : 'M',
        title : '생종손자',
        connection : {
            '배우자' : '생종손부',
            '아버지' : '생질',
            '어머니' : '생질부',
            '누나' : '생종손녀',
            '형' : '생종손자',
            '남동생' : '생종손자',
            '여동생' : '생종손녀',
            '아들' : '생종증손자',
            '딸' : '생종증손녀'
        }
    }, {
        gender : 'M',
        title : '생종증손자',
        connection : {
            '배우자' : '생종증손부',
            '아버지' : '생종손자',
            '어머니' : '생종손부',
            '누나' : '생종증손녀',
            '형' : '생종증손자',
            '남동생' : '생종증손자',
            '여동생' : '생종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '생종증손녀',
        connection : {
            '배우자' : '생종증손서',
            '아버지' : '생종손자',
            '어머니' : '생종손부',
            '언니' : '생종증손녀',
            '오빠' : '생종증손자',
            '남동생' : '생종증손자',
            '여동생' : '생종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '생종손녀',
        connection : {
            '배우자' : '생종손서',
            '아버지' : '생질',
            '어머니' : '생질부',
            '언니' : '생종손녀',
            '오빠' : '생종손자',
            '남동생' : '생종손자',
            '여동생' : '생종손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '생질녀',
        connection : {
            '배우자' : '생질서',
            '아버지' : '자형',
            '어머니' : '누나',
            '언니' : '생질녀',
            '오빠' : '생질',
            '남동생' : '생질',
            '여동생' : '생질녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '여동생',
        connection : {
            '배우자' : '매제',
            '아버지' : '아버지',
            '어머니' : '어머니',
            '언니' : '여동생',
            '오빠' : '남동생',
            '남동생' : '남동생',
            '여동생' : '여동생',
            '아들' : '생질',
            '딸' : '생질녀'
        }
    } ];

// 남자 외가
var FTIM2 = [ {
    gender : 'M',
    title : '부',
    connection : {
        '배우자' : '모',
        '아버지' : '외조부',
        '어머니' : '외조모',
        '언니' : '이모',
        '오빠' : '외숙부',
        '남동생' : '외숙부',
        '여동생' : '이모',
        '아들' : '남동생',
        '딸' : '여동생'
    }
}, {
    gender : 'F',
    title : '모',
    connection : {
        '배우자' : '부',
        '아버지' : '외조부',
        '어머니' : '외조모',
        '언니' : '이모',
        '오빠' : '외숙부',
        '남동생' : '외숙부',
        '여동생' : '이모',
        '아들' : '남동생',
        '딸' : '여동생'
    }
}, {
    gender : 'M',
    title : '아버지',
    connection : {
        '배우자' : '모',
        '아버지' : '외조부',
        '어머니' : '외조모',
        '언니' : '이모',
        '오빠' : '외숙부',
        '남동생' : '외숙부',
        '여동생' : '이모',
        '아들' : '남동생',
        '딸' : '여동생'
    }
}, {
    gender : 'F',
    title : '어머니',
    connection : {
        '배우자' : '부',
        '아버지' : '외조부',
        '어머니' : '외조모',
        '언니' : '이모',
        '오빠' : '외숙부',
        '남동생' : '외숙부',
        '여동생' : '이모',
        '아들' : '남동생',
        '딸' : '여동생'
    }
}, {
    gender : 'M',
    title : '외조부',
    connection : {
        '배우자' : '외조모',
        '아버지' : '외증조부',
        '어머니' : '외증조모',
        '누나' : '외대고모',
        '형' : '외종조부',
        '남동생' : '외종조부',
        '여동생' : '외대고모',
        '아들' : '외숙부',
        '딸' : '이모'
    }
}, {
    gender : 'M',
    title : '외숙부',
    connection : {
        '배우자' : '외숙모',
        '아버지' : '외조부',
        '어머니' : '외조모',
        '누나' : '이모',
        '형' : '외숙부',
        '남동생' : '외숙부',
        '여동생' : '이모',
        '아들' : '외종형제',
        '딸' : '외종남매'
    }
}, {
    gender : 'F',
    title : '이모',
    connection : {
        '배우자' : '이모부',
        '아버지' : '외조부',
        '어머니' : '외조모',
        '언니' : '이모',
        '오빠' : '외숙부',
        '남동생' : '외숙부',
        '여동생' : '이모',
        '아들' : '이종형제',
        '딸' : '이종남매'
    }
}, {
    gender : 'M',
    title : '이종형제',
    connection : {
        '배우자' : '이종수',
        '아버지' : '이모부',
        '어머니' : '이모',
        '언니' : '이종남매',
        '오빠' : '이종형제',
        '남동생' : '이종형제',
        '여동생' : '이종남매',
        '아들' : '이종질',
        '딸' : '이종질녀'
    }
}, {
    gender : 'F',
    title : '이종남매',
    connection : {
        '배우자' : '이종매부',
        '아버지' : '이모부',
        '어머니' : '이모',
        '언니' : '이종남매',
        '오빠' : '이종형제',
        '남동생' : '이종형제',
        '여동생' : '이종남매',
        '아들' : '이종생질',
        '딸' : '이종생질녀'
    }
}, {
    gender : 'M',
    title : '이종질',
    connection : {
        '배우자' : '이종질부',
        '아버지' : '이종형제',
        '어머니' : '이종수',
        '언니' : '이종질녀',
        '오빠' : '이종질',
        '남동생' : '이종질',
        '여동생' : '이종질녀',
        '아들' : '이재종손자',
        '딸' : '이재종손녀'
    }
}, {
    gender : 'F',
    title : '이종질녀',
    connection : {
        '배우자' : '이종질서',
        '아버지' : '이종형제',
        '어머니' : '이종수',
        '언니' : '이종질녀',
        '오빠' : '이종질',
        '남동생' : '이종질',
        '여동생' : '이종질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '이재종손자',
    connection : {
        '배우자' : '이재종손부',
        '아버지' : '이종질',
        '어머니' : '이종질부',
        '언니' : '이재종손녀',
        '오빠' : '이재종손자',
        '남동생' : '이재종손자',
        '여동생' : '이재종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '이재종손녀',
    connection : {
        '배우자' : '이재종손서',
        '아버지' : '이종질',
        '어머니' : '이종질부',
        '언니' : '이재종손녀',
        '오빠' : '이재종손자',
        '남동생' : '이재종손자',
        '여동생' : '이재종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '이종생질녀',
    connection : {
        '배우자' : '이종생질서',
        '아버지' : '이종매부',
        '어머니' : '이종남매',
        '언니' : '이종생질녀',
        '오빠' : '이종생질',
        '남동생' : '이종생질',
        '여동생' : '이종생질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '이종생질',
    connection : {
        '배우자' : '이종생질부',
        '아버지' : '이종매부',
        '어머니' : '이종남매',
        '언니' : '이종생질녀',
        '오빠' : '이종생질',
        '남동생' : '이종생질',
        '여동생' : '이종생질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '외종형제',
    connection : {
        '배우자' : '외종수',
        '아버지' : '외숙부',
        '어머니' : '외숙모',
        '오빠' : '외종형제',
        '남동생' : '외종형제',
        '언니' : '외종남매',
        '여동생' : '외종남매',
        '아들' : '외종질',
        '딸' : '외종질녀'
    }
}, {
    gender : 'F',
    title : '외종남매',
    connection : {
        '배우자' : '외종매부',
        '아버지' : '외숙부',
        '어머니' : '외숙모',
        '오빠' : '외종형제',
        '남동생' : '외종형제',
        '언니' : '외종남매',
        '여동생' : '외종남매',
        '아들' : '외종생질',
        '딸' : '외종생질녀'
    }
}, {
    gender : 'M',
    title : '외종질',
    connection : {
        '배우자' : '외종질부',
        '아버지' : '외종형제',
        '어머니' : '외종수',
        '오빠' : '외종질',
        '남동생' : '외종질',
        '언니' : '외종질녀',
        '여동생' : '외종질녀',
        '아들' : '외재종손자',
        '딸' : '외재종손녀'
    }
}, {
    gender : 'F',
    title : '외종질녀',
    connection : {
        '배우자' : '외종질서',
        '아버지' : '외종형제',
        '어머니' : '외종수',
        '오빠' : '외종질',
        '남동생' : '외종질',
        '언니' : '외종질녀',
        '여동생' : '외종질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '외재종손자',
    connection : {
        '배우자' : '외종종손부',
        '아버지' : '외종질',
        '어머니' : '외종질부',
        '오빠' : '외재종손자',
        '남동생' : '외재종손자',
        '언니' : '외재종손녀',
        '여동생' : '외재종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '외재종손녀',
    connection : {
        '배우자' : '외재종손서',
        '아버지' : '외종질',
        '어머니' : '외종질부',
        '오빠' : '외재종손자',
        '남동생' : '외재종손자',
        '언니' : '외재종손녀',
        '여동생' : '외재종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '외종생질',
    connection : {
        '배우자' : '외종생질부',
        '아버지' : '외종매부',
        '어머니' : '외종남매',
        '오빠' : '외종생질',
        '남동생' : '외종생질',
        '언니' : '외종생질녀',
        '여동생' : '외종생질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '외종생질녀',
    connection : {
        '배우자' : '외종생질서',
        '아버지' : '외종매부',
        '어머니' : '외종남매',
        '오빠' : '외종생질',
        '남동생' : '외종생질',
        '언니' : '외종생질녀',
        '여동생' : '외종생질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '외대고모',
    connection : {
        '배우자' : '외대고모부',
        '아버지' : '외고조부',
        '어머니' : '외고조모',
        '언니' : '외대고모',
        '오빠' : '외종조부',
        '남동생' : '외종조부',
        '여동생' : '외대고모',
        '아들' : '외내종숙부',
        '딸' : '외내종이모'
    }
}, {
    gender : 'M',
    title : '외내종숙부',
    connection : {
        '배우자' : '외내종숙모',
        '아버지' : '외대고모부',
        '어머니' : '외대고모',
        '오빠' : '외내종숙부',
        '남동생' : '외내종숙부',
        '언니' : '외내종이모',
        '여동생' : '외내종이모',
        '아들' : '외내재종형제',
        '딸' : '외내재종남매'
    }
}, {
    gender : 'F',
    title : '외내종이모',
    connection : {
        '배우자' : '외내종이모부',
        '아버지' : '외대고모부',
        '어머니' : '외대고모',
        '오빠' : '외내종숙부',
        '남동생' : '외내종숙부',
        '언니' : '외내종이모',
        '여동생' : '외내종이모',
        '아들' : '외이재종형제',
        '딸' : '외이재종남매'
    }
}, {
    gender : 'M',
    title : '외내재종형제',
    connection : {
        '배우자' : '외내재종수',
        '아버지' : '외내종숙부',
        '어머니' : '외내종숙모',
        '오빠' : '외내재종형제',
        '남동생' : '외내재종형제',
        '언니' : '외내재종남매',
        '여동생' : '외내재종남매',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '외내재종남매',
    connection : {
        '배우자' : '외내재종매부',
        '아버지' : '외내종숙부',
        '어머니' : '외내종숙모',
        '오빠' : '외내재종형제',
        '남동생' : '외내재종형제',
        '언니' : '외내재종남매',
        '여동생' : '외내재종남매',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '외이재종형제',
    connection : {
        '배우자' : '외이재종수',
        '아버지' : '외내종이모부',
        '어머니' : '외내종이모',
        '오빠' : '외이재종형제',
        '남동생' : '외이재종형제',
        '언니' : '외이재종남매',
        '여동생' : '외이재종남매',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '외이재종남매',
    connection : {
        '배우자' : '외이재종매부',
        '아버지' : '외내종이모부',
        '어머니' : '외내종이모',
        '오빠' : '외이재종형제',
        '남동생' : '외이재종형제',
        '언니' : '외이재종남매',
        '여동생' : '외이재종남매',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '외종조부',
    connection : {
        '배우자' : '외종조모',
        '아버지' : '외증조부',
        '어머니' : '외증조모',
        '누나' : '외대고모',
        '형' : '외종조부',
        '남동생' : '외종조부',
        '여동생' : '외대고모',
        '아들' : '외종숙부',
        '딸' : '외종이모'
    }
}, {
    gender : 'M',
    title : '외종숙부',
    connection : {
        '배우자' : '외종숙모',
        '아버지' : '외종조부',
        '어머니' : '외종조모',
        '오빠' : '외종숙부',
        '남동생' : '외종숙부',
        '언니' : '외종이모',
        '여동생' : '외종이모',
        '아들' : '외재종형제',
        '딸' : '외재종남매'
    }
}, {
    gender : 'M',
    title : '외재종형제',
    connection : {
        '배우자' : '외재종수',
        '아버지' : '외종숙부',
        '어머니' : '외종숙모',
        '오빠' : '외재종형제',
        '남동생' : '외재종형제',
        '언니' : '외재종남매',
        '여동생' : '외재종남매',
        '아들' : '외재종질',
        '딸' : '외재종질녀'
    }
}, {
    gender : 'F',
    title : '외재종남매',
    connection : {
        '배우자' : '외재종매부',
        '아버지' : '외종숙부',
        '어머니' : '외종숙모',
        '오빠' : '외재종형제',
        '남동생' : '외재종형제',
        '언니' : '외재종남매',
        '여동생' : '외재종남매',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '외재종질',
    connection : {
        '배우자' : '외재종질부',
        '아버지' : '외재종형제',
        '어머니' : '외재종수',
        '오빠' : '외재종질',
        '남동생' : '외재종질',
        '언니' : '외재종질녀',
        '여동생' : '외재종질녀',
        '아들' : '외삼종손자',
        '딸' : '외삼종손녀'
    }
}, {
    gender : 'F',
    title : '외재종질녀',
    connection : {
        '배우자' : '외재종질서',
        '아버지' : '외재종형제',
        '어머니' : '외재종수',
        '오빠' : '외재종질',
        '남동생' : '외재종질',
        '언니' : '외재종질녀',
        '여동생' : '외재종질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '외삼종손자',
    connection : {
        '배우자' : '외삼종손부',
        '아버지' : '외재종질',
        '어머니' : '외재종질부',
        '오빠' : '외삼종손자',
        '남동생' : '외삼종손자',
        '언니' : '외삼종손녀',
        '여동생' : '외삼종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '외삼종손녀',
    connection : {
        '배우자' : '외삼종손서',
        '아버지' : '외재종질',
        '어머니' : '외재종질부',
        '오빠' : '외삼종손자',
        '남동생' : '외삼종손자',
        '언니' : '외삼종손녀',
        '여동생' : '외삼종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '외종이모',
    connection : {
        '배우자' : '외종이모부',
        '아버지' : '외종조부',
        '어머니' : '외종조모',
        '오빠' : '외종숙부',
        '남동생' : '외종숙부',
        '언니' : '외종이모',
        '여동생' : '외종이모',
        '아들' : '이재종형제',
        '딸' : '이재종남매'
    }
}, {
    gender : 'M',
    title : '이재종형제',
    connection : {
        '배우자' : '이재종수',
        '아버지' : '외종이모부',
        '어머니' : '외종이모',
        '오빠' : '이재종형제',
        '남동생' : '이재종형제',
        '언니' : '이재종남매',
        '여동생' : '이재종남매',
        '아들' : '종이재종질',
        '딸' : '종이재종질녀'
    }
}, {
    gender : 'F',
    title : '이재종남매',
    connection : {
        '배우자' : '이재종매부',
        '아버지' : '외종이모부',
        '어머니' : '외종이모',
        '오빠' : '이재종형제',
        '남동생' : '이재종형제',
        '언니' : '이재종남매',
        '여동생' : '이재종남매',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '종이재종질',
    connection : {
        '배우자' : '종이재종질부',
        '아버지' : '이재종형제',
        '어머니' : '이재종수',
        '오빠' : '종이재종질',
        '남동생' : '종이재종질',
        '언니' : '종이재종질녀',
        '여동생' : '종이재종질녀',
        '아들' : '종이삼종손자',
        '딸' : '종이삼종손녀'
    }
}, {
    gender : 'F',
    title : '종이재종질녀',
    connection : {
        '배우자' : '종이재종질서',
        '아버지' : '이재종형제',
        '어머니' : '이재종수',
        '오빠' : '종이재종질',
        '남동생' : '종이재종질',
        '언니' : '종이재종질녀',
        '여동생' : '종이재종질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '종이삼종손자',
    connection : {
        '배우자' : '종이삼종손부',
        '아버지' : '종이재종질',
        '어머니' : '종이재종질부',
        '오빠' : '종이삼종손자',
        '남동생' : '종이삼종손자',
        '언니' : '종이삼종손녀',
        '여동생' : '종이삼종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '종이삼종손녀',
    connection : {
        '배우자' : '종이삼종손서',
        '아버지' : '종이재종질',
        '어머니' : '종이재종질부',
        '오빠' : '종이삼종손자',
        '남동생' : '종이삼종손자',
        '언니' : '종이삼종손녀',
        '여동생' : '종이삼종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '외증조부',
    connection : {
        '배우자' : '외증조모',
        '아버지' : '외고조부',
        '어머니' : '외고조모',
        '아들' : '외종조부',
        '딸' : '외대고모'
    }
}, {
    gender : 'M',
    title : '외고조부',
    connection : {
        '배우자' : '외고조모',
        '아버지' : '외현조부',
        '어머니' : '외현조모'
    }
}, {
    gender : 'M',
    title : '외현조부',
    connection : {
        '배우자' : '외현조모',
        '아버지' : '외6대조부',
        '어머니' : '외6대조모'
    }
}, {
    gender : 'M',
    title : '외6대조부',
    connection : {
        '배우자' : '외6대조모',
        '아버지' : '외7대조부',
        '어머니' : '외7대조모'
    }
}, {
    gender : 'M',
    title : '외7대조부',
    connection : {
        '배우자' : '외7대조모',
        '아버지' : '외8대조부',
        '어머니' : '외8대조모'
    }
}, {
    gender : 'M',
    title : '외8대조부',
    connection : {
        '배우자' : '외8대조모',
        '아버지' : '외9대조부',
        '어머니' : '외9대조모'
    }
}, {
    gender : 'M',
    title : '외9대조부',
    connection : {
        '배우자' : '외9대조모',
        '아버지' : '외10대조부',
        '어머니' : '외10대조모'
    }
}, {
    gender : 'M',
    title : '나',
    connection : {
        '배우자' : '아내',
        '아버지' : '부',
        '어머니' : '모',
        '누나' : '누나',
        '형' : '형',
        '남동생' : '남동생',
        '여동생' : '여동생',
        '아들' : '아들',
        '딸' : '딸'
    }
}, {
    gender : 'M',
    title : '아들',
    connection : {
        '배우자' : '며느리',
        '아버지' : '나',
        '어머니' : '아내',
        '누나' : '딸',
        '형' : '아들',
        '남동생' : '아들',
        '여동생' : '딸',
        '아들' : '손자',
        '딸' : '손녀'
    }
}, {
    gender : 'M',
    title : '손자',
    connection : {
        '배우자' : '손부',
        '아버지' : '아들',
        '어머니' : '며느리',
        '누나' : '손녀',
        '형' : '손자',
        '남동생' : '손자',
        '여동생' : '손녀',
        '아들' : '증손자',
        '딸' : '증손녀'
    }
}, {
    gender : 'F',
    title : '손녀',
    connection : {
        '배우자' : '손서',
        '아버지' : '아들',
        '어머니' : '며느리',
        '언니' : '손녀',
        '오빠' : '손자',
        '남동생' : '손자',
        '여동생' : '손녀',
        '아들' : '외증손자',
        '딸' : '외증손녀'
    }
}, {
    gender : 'M',
    title : '증손자',
    connection : {
        '배우자' : '증손부',
        '아버지' : '손자',
        '어머니' : '손부',
        '누나' : '증손녀',
        '형' : '증손자',
        '남동생' : '증손자',
        '여동생' : '증손녀',
        '아들' : '고손자',
        '딸' : '고손녀'
    }
}, {
    gender : 'F',
    title : '증손녀',
    connection : {
        '배우자' : '증손서',
        '아버지' : '손자',
        '어머니' : '손부',
        '언니' : '증손녀',
        '오빠' : '증손자',
        '남동생' : '증손자',
        '여동생' : '증손녀',
        '아들' : '외고손자',
        '딸' : '외고손녀'
    }
}, {
    gender : 'M',
    title : '고손자',
    connection : {
        '배우자' : '고손부',
        '아버지' : '증손자',
        '어머니' : '증손부',
        '누나' : '고손녀',
        '형' : '고손자',
        '남동생' : '고손자',
        '여동생' : '고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '고손녀',
    connection : {
        '배우자' : '고손서',
        '아버지' : '증손자',
        '어머니' : '증손부',
        '언니' : '고손녀',
        '오빠' : '고손자',
        '남동생' : '고손자',
        '여동생' : '고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '딸',
    connection : {
        '배우자' : '사위',
        '아버지' : '나',
        '어머니' : '아내',
        '언니' : '딸',
        '오빠' : '아들',
        '남동생' : '아들',
        '여동생' : '딸',
        '아들' : '외손자',
        '딸' : '외손녀'
    }
}, {
    gender : 'M',
    title : '외손자',
    connection : {
        '배우자' : '외손자부',
        '아버지' : '사위',
        '어머니' : '딸',
        '누나' : '외손녀',
        '형' : '외손자',
        '남동생' : '외손자',
        '여동생' : '외손녀',
        '아들' : '외증손자',
        '딸' : '외증손녀'
    }
}, {
    gender : 'M',
    title : '외손녀',
    connection : {
        '배우자' : '외손서',
        '아버지' : '사위',
        '어머니' : '딸',
        '언니' : '외손녀',
        '오빠' : '외손자',
        '남동생' : '외손자',
        '여동생' : '외손녀',
        '아들' : '외증손자',
        '딸' : '외증손녀'
    }
}, {
    gender : 'M',
    title : '외고손자',
    connection : {
        '배우자' : '외고손부',
        '아버지' : '증손서',
        '어머니' : '증손녀',
        '누나' : '외고손녀',
        '형' : '외고손자',
        '남동생' : '외고손자',
        '여동생' : '외고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '외고손녀',
    connection : {
        '배우자' : '외고손서',
        '아버지' : '증손서',
        '어머니' : '증손녀',
        '언니' : '외고손녀',
        '오빠' : '외고손자',
        '남동생' : '외고손자',
        '여동생' : '외고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '외증손자',
    connection : {
        '배우자' : '외증손부',
        '아버지' : '손서',
        '어머니' : '손녀',
        '누나' : '외증손녀',
        '형' : '외증손자',
        '남동생' : '외증손자',
        '여동생' : '외증손녀',
        '아들' : '외고손자',
        '딸' : '외고손녀'
    }
}, {
    gender : 'F',
    title : '외증손녀',
    connection : {
        '배우자' : '외증손서',
        '아버지' : '손서',
        '어머니' : '손녀',
        '언니' : '외증손녀',
        '오빠' : '외증손자',
        '남동생' : '외증손자',
        '여동생' : '외증손녀',
        '아들' : '외고손자',
        '딸' : '외고손녀'
    }
},
// { gender: 'M', title:'외고손자', connection:
// {'배우자':'외고손부','아버지':'외증손서','어머니':'외증손녀','누나':'외고손녀','형':'외고손자','남동생':'외고손자','여동생':'외고손녀','아들':'호칭없음','딸':'호칭없음'}},
// { gender: 'F', title:'외고손녀', connection:
// {'배우자':'외고손서','아버지':'외증손서','어머니':'외증손녀','언니':'외고손녀','오빠':'외고손자','남동생':'외고손자','여동생':'외고손녀','아들':'호칭없음','딸':'호칭없음'}},
    {
        gender : 'M',
        title : '형',
        connection : {
            '배우자' : '형수',
            '아버지' : '아버지',
            '어머니' : '어머니',
            '누나' : '누나',
            '형' : '형',
            '남동생' : '형',
            '여동생' : '누나',
            '아들' : '질',
            '딸' : '질녀'
        }
    }, {
        gender : 'M',
        title : '질',
        connection : {
            '배우자' : '질부',
            '아버지' : '형',
            '어머니' : '형수',
            '누나' : '질녀',
            '형' : '질',
            '남동생' : '질',
            '여동생' : '질녀',
            '아들' : '종손자',
            '딸' : '종손녀'
        }
    }, {
        gender : 'M',
        title : '종손자',
        connection : {
            '배우자' : '종손부',
            '아버지' : '질',
            '어머니' : '질부',
            '누나' : '종손녀',
            '형' : '종손자',
            '남동생' : '종손자',
            '여동생' : '종손녀',
            '아들' : '종증손자',
            '딸' : '종증손녀'
        }
    }, {
        gender : 'M',
        title : '종증손자',
        connection : {
            '배우자' : '종증손부',
            '아버지' : '종손자',
            '어머니' : '종손부',
            '누나' : '종증손녀',
            '형' : '종증손자',
            '남동생' : '종증손자',
            '여동생' : '종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '종증손녀',
        connection : {
            '배우자' : '종증손서',
            '아버지' : '종손자',
            '어머니' : '종손부',
            '언니' : '종증손녀',
            '오빠' : '종증손자',
            '남동생' : '종증손자',
            '여동생' : '종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '종손녀',
        connection : {
            '배우자' : '종손서',
            '아버지' : '질',
            '어머니' : '질부',
            '언니' : '종손녀',
            '오빠' : '종손자',
            '남동생' : '종손자',
            '여동생' : '종손녀',
            '아들' : '종외증손자',
            '딸' : '종외증손녀'
        }
    }, {
        gender : 'M',
        title : '종외증손자',
        connection : {
            '배우자' : '종외증손부',
            '아버지' : '종손서',
            '어머니' : '종손녀',
            '누나' : '종외증손녀',
            '형' : '종외증손자',
            '남동생' : '종외증손자',
            '여동생' : '종외증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '종외증손녀',
        connection : {
            '배우자' : '종외증손서',
            '아버지' : '종손서',
            '어머니' : '종손녀',
            '언니' : '종외증손녀',
            '오빠' : '종외증손자',
            '남동생' : '종외증손자',
            '여동생' : '종외증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '질녀',
        connection : {
            '배우자' : '질서',
            '아버지' : '형',
            '어머니' : '형수',
            '언니' : '질녀',
            '오빠' : '질',
            '남동생' : '질',
            '여동생' : '질녀',
            '아들' : '외종손자',
            '딸' : '외종손녀'
        }
    }, {
        gender : 'M',
        title : '외종손자',
        connection : {
            '배우자' : '외종손부',
            '아버지' : '질서',
            '어머니' : '질녀',
            '누나' : '외종손녀',
            '형' : '외종손자',
            '남동생' : '외종손자',
            '여동생' : '외종손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '외종손녀',
        connection : {
            '배우자' : '외종손서',
            '아버지' : '질서',
            '어머니' : '질녀',
            '언니' : '외종손녀',
            '오빠' : '외종손자',
            '남동생' : '외종손자',
            '여동생' : '외종손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'M',
        title : '남동생',
        connection : {
            '배우자' : '제수',
            '아버지' : '아버지',
            '어머니' : '어머니',
            '누나' : '여동생',
            '형' : '남동생',
            '남동생' : '남동생',
            '여동생' : '여동생',
            '아들' : '질',
            '딸' : '질녀'
        }
    }, {
        gender : 'F',
        title : '누나',
        connection : {
            '배우자' : '자형',
            '아버지' : '아버지',
            '어머니' : '어머니',
            '언니' : '누나',
            '오빠' : '형',
            '남동생' : '형',
            '여동생' : '누나',
            '아들' : '생질',
            '딸' : '생질녀'
        }
    }, {
        gender : 'M',
        title : '생질',
        connection : {
            '배우자' : '생질부',
            '아버지' : '자형',
            '어머니' : '누나',
            '누나' : '생질녀',
            '형' : '생질',
            '남동생' : '생질',
            '여동생' : '생질녀',
            '아들' : '생종손자',
            '딸' : '생종손녀'
        }
    }, {
        gender : 'M',
        title : '생종손자',
        connection : {
            '배우자' : '생종손부',
            '아버지' : '생질',
            '어머니' : '생질부',
            '누나' : '생종손녀',
            '형' : '생종손자',
            '남동생' : '생종손자',
            '여동생' : '생종손녀',
            '아들' : '생종증손자',
            '딸' : '생종증손녀'
        }
    }, {
        gender : 'M',
        title : '생종증손자',
        connection : {
            '배우자' : '생종증손부',
            '아버지' : '생종손자',
            '어머니' : '생종손부',
            '누나' : '생종증손녀',
            '형' : '생종증손자',
            '남동생' : '생종증손자',
            '여동생' : '생종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '생종증손녀',
        connection : {
            '배우자' : '생종증손서',
            '아버지' : '생종손자',
            '어머니' : '생종손부',
            '언니' : '생종증손녀',
            '오빠' : '생종증손자',
            '남동생' : '생종증손자',
            '여동생' : '생종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '생종손녀',
        connection : {
            '배우자' : '생종손서',
            '아버지' : '생질',
            '어머니' : '생질부',
            '언니' : '생종손녀',
            '오빠' : '생종손자',
            '남동생' : '생종손자',
            '여동생' : '생종손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '생질녀',
        connection : {
            '배우자' : '생질서',
            '아버지' : '자형',
            '어머니' : '누나',
            '언니' : '생질녀',
            '오빠' : '생질',
            '남동생' : '생질',
            '여동생' : '생질녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '여동생',
        connection : {
            '배우자' : '매제',
            '아버지' : '아버지',
            '어머니' : '어머니',
            '언니' : '여동생',
            '오빠' : '남동생',
            '남동생' : '남동생',
            '여동생' : '여동생',
            '아들' : '생질',
            '딸' : '생질녀'
        }
    } ];

// 여자 외가
var FTIFM2 = [ {
    gender : 'M',
    title : '부',
    connection : {
        '배우자' : '모',
        '아버지' : '외조부',
        '어머니' : '외조모',
        '언니' : '이모',
        '오빠' : '외숙부',
        '남동생' : '외숙부',
        '여동생' : '이모',
        '아들' : '남동생',
        '딸' : '여동생'
    }
}, {
    gender : 'F',
    title : '모',
    connection : {
        '배우자' : '부',
        '아버지' : '외조부',
        '어머니' : '외조모',
        '언니' : '이모',
        '오빠' : '외숙부',
        '남동생' : '외숙부',
        '여동생' : '이모',
        '아들' : '남동생',
        '딸' : '여동생'
    }
}, {
    gender : 'M',
    title : '아버지',
    connection : {
        '배우자' : '모',
        '아버지' : '외조부',
        '어머니' : '외조모',
        '언니' : '이모',
        '오빠' : '외숙부',
        '남동생' : '외숙부',
        '여동생' : '이모',
        '아들' : '남동생',
        '딸' : '여동생'
    }
}, {
    gender : 'F',
    title : '어머니',
    connection : {
        '배우자' : '부',
        '아버지' : '외조부',
        '어머니' : '외조모',
        '언니' : '이모',
        '오빠' : '외숙부',
        '남동생' : '외숙부',
        '여동생' : '이모',
        '아들' : '남동생',
        '딸' : '여동생'
    }
}, {
    gender : 'M',
    title : '외조부',
    connection : {
        '배우자' : '외조모',
        '아버지' : '외증조부',
        '어머니' : '외증조모',
        '누나' : '외대고모',
        '형' : '외종조부',
        '남동생' : '외종조부',
        '여동생' : '외대고모',
        '아들' : '외숙부',
        '딸' : '이모'
    }
}, {
    gender : 'M',
    title : '외숙부',
    connection : {
        '배우자' : '외숙모',
        '아버지' : '외조부',
        '어머니' : '외조모',
        '누나' : '이모',
        '형' : '외숙부',
        '남동생' : '외숙부',
        '여동생' : '이모',
        '아들' : '외종형제',
        '딸' : '외종남매'
    }
}, {
    gender : 'F',
    title : '이모',
    connection : {
        '배우자' : '이모부',
        '아버지' : '외조부',
        '어머니' : '외조모',
        '언니' : '이모',
        '오빠' : '외숙부',
        '남동생' : '외숙부',
        '여동생' : '이모',
        '아들' : '이종형제',
        '딸' : '이종남매'
    }
}, {
    gender : 'M',
    title : '이종형제',
    connection : {
        '배우자' : '이종수',
        '아버지' : '이모부',
        '어머니' : '이모',
        '언니' : '이종남매',
        '오빠' : '이종형제',
        '남동생' : '이종형제',
        '여동생' : '이종남매',
        '아들' : '이종질',
        '딸' : '이종질녀'
    }
}, {
    gender : 'F',
    title : '이종남매',
    connection : {
        '배우자' : '이종매부',
        '아버지' : '이모부',
        '어머니' : '이모',
        '언니' : '이종남매',
        '오빠' : '이종형제',
        '남동생' : '이종형제',
        '여동생' : '이종남매',
        '아들' : '이종생질',
        '딸' : '이종생질녀'
    }
}, {
    gender : 'M',
    title : '이종질',
    connection : {
        '배우자' : '이종질부',
        '아버지' : '이종형제',
        '어머니' : '이종수',
        '언니' : '이종질녀',
        '오빠' : '이종질',
        '남동생' : '이종질',
        '여동생' : '이종질녀',
        '아들' : '이재종손자',
        '딸' : '이재종손녀'
    }
}, {
    gender : 'F',
    title : '이종질녀',
    connection : {
        '배우자' : '이종질서',
        '아버지' : '이종형제',
        '어머니' : '이종수',
        '언니' : '이종질녀',
        '오빠' : '이종질',
        '남동생' : '이종질',
        '여동생' : '이종질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '이재종손자',
    connection : {
        '배우자' : '이재종손부',
        '아버지' : '이종질',
        '어머니' : '이종질부',
        '언니' : '이재종손녀',
        '오빠' : '이재종손자',
        '남동생' : '이재종손자',
        '여동생' : '이재종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '이재종손녀',
    connection : {
        '배우자' : '이재종손서',
        '아버지' : '이종질',
        '어머니' : '이종질부',
        '언니' : '이재종손녀',
        '오빠' : '이재종손자',
        '남동생' : '이재종손자',
        '여동생' : '이재종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '이종생질녀',
    connection : {
        '배우자' : '이종생질서',
        '아버지' : '이종매부',
        '어머니' : '이종남매',
        '언니' : '이종생질녀',
        '오빠' : '이종생질',
        '남동생' : '이종생질',
        '여동생' : '이종생질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '이종생질',
    connection : {
        '배우자' : '이종생질부',
        '아버지' : '이종매부',
        '어머니' : '이종남매',
        '언니' : '이종생질녀',
        '오빠' : '이종생질',
        '남동생' : '이종생질',
        '여동생' : '이종생질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '외종형제',
    connection : {
        '배우자' : '외종수',
        '아버지' : '외숙부',
        '어머니' : '외숙모',
        '오빠' : '외종형제',
        '남동생' : '외종형제',
        '언니' : '외종남매',
        '여동생' : '외종남매',
        '아들' : '외종질',
        '딸' : '외종질녀'
    }
}, {
    gender : 'F',
    title : '외종남매',
    connection : {
        '배우자' : '외종매부',
        '아버지' : '외숙부',
        '어머니' : '외숙모',
        '오빠' : '외종형제',
        '남동생' : '외종형제',
        '언니' : '외종남매',
        '여동생' : '외종남매',
        '아들' : '외종생질',
        '딸' : '외종생질녀'
    }
}, {
    gender : 'M',
    title : '외종질',
    connection : {
        '배우자' : '외종질부',
        '아버지' : '외종형제',
        '어머니' : '외종수',
        '오빠' : '외종질',
        '남동생' : '외종질',
        '언니' : '외종질녀',
        '여동생' : '외종질녀',
        '아들' : '외재종손자',
        '딸' : '외재종손녀'
    }
}, {
    gender : 'F',
    title : '외종질녀',
    connection : {
        '배우자' : '외종질서',
        '아버지' : '외종형제',
        '어머니' : '외종수',
        '오빠' : '외종질',
        '남동생' : '외종질',
        '언니' : '외종질녀',
        '여동생' : '외종질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '외재종손자',
    connection : {
        '배우자' : '외종종손부',
        '아버지' : '외종질',
        '어머니' : '외종질부',
        '오빠' : '외재종손자',
        '남동생' : '외재종손자',
        '언니' : '외재종손녀',
        '여동생' : '외재종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '외재종손녀',
    connection : {
        '배우자' : '외재종손서',
        '아버지' : '외종질',
        '어머니' : '외종질부',
        '오빠' : '외재종손자',
        '남동생' : '외재종손자',
        '언니' : '외재종손녀',
        '여동생' : '외재종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '외종생질',
    connection : {
        '배우자' : '외종생질부',
        '아버지' : '외종매부',
        '어머니' : '외종남매',
        '오빠' : '외종생질',
        '남동생' : '외종생질',
        '언니' : '외종생질녀',
        '여동생' : '외종생질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '외종생질녀',
    connection : {
        '배우자' : '외종생질서',
        '아버지' : '외종매부',
        '어머니' : '외종남매',
        '오빠' : '외종생질',
        '남동생' : '외종생질',
        '언니' : '외종생질녀',
        '여동생' : '외종생질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '외대고모',
    connection : {
        '배우자' : '외대고모부',
        '아버지' : '외고조부',
        '어머니' : '외고조모',
        '언니' : '외대고모',
        '오빠' : '외종조부',
        '남동생' : '외종조부',
        '여동생' : '외대고모',
        '아들' : '외내종숙부',
        '딸' : '외내종이모'
    }
}, {
    gender : 'M',
    title : '외내종숙부',
    connection : {
        '배우자' : '외내종숙모',
        '아버지' : '외대고모부',
        '어머니' : '외대고모',
        '오빠' : '외내종숙부',
        '남동생' : '외내종숙부',
        '언니' : '외내종이모',
        '여동생' : '외내종이모',
        '아들' : '외내재종형제',
        '딸' : '외내재종남매'
    }
}, {
    gender : 'F',
    title : '외내종이모',
    connection : {
        '배우자' : '외내종이모부',
        '아버지' : '외대고모부',
        '어머니' : '외대고모',
        '오빠' : '외내종숙부',
        '남동생' : '외내종숙부',
        '언니' : '외내종이모',
        '여동생' : '외내종이모',
        '아들' : '외이재종형제',
        '딸' : '외이재종남매'
    }
}, {
    gender : 'M',
    title : '외내재종형제',
    connection : {
        '배우자' : '외내재종수',
        '아버지' : '외내종숙부',
        '어머니' : '외내종숙모',
        '오빠' : '외내재종형제',
        '남동생' : '외내재종형제',
        '언니' : '외내재종남매',
        '여동생' : '외내재종남매',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '외내재종남매',
    connection : {
        '배우자' : '외내재종매부',
        '아버지' : '외내종숙부',
        '어머니' : '외내종숙모',
        '오빠' : '외내재종형제',
        '남동생' : '외내재종형제',
        '언니' : '외내재종남매',
        '여동생' : '외내재종남매',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '외이재종형제',
    connection : {
        '배우자' : '외이재종수',
        '아버지' : '외내종이모부',
        '어머니' : '외내종이모',
        '오빠' : '외이재종형제',
        '남동생' : '외이재종형제',
        '언니' : '외이재종남매',
        '여동생' : '외이재종남매',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '외이재종남매',
    connection : {
        '배우자' : '외이재종매부',
        '아버지' : '외내종이모부',
        '어머니' : '외내종이모',
        '오빠' : '외이재종형제',
        '남동생' : '외이재종형제',
        '언니' : '외이재종남매',
        '여동생' : '외이재종남매',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '외종조부',
    connection : {
        '배우자' : '외종조모',
        '아버지' : '외증조부',
        '어머니' : '외증조모',
        '누나' : '외대고모',
        '형' : '외종조부',
        '남동생' : '외종조부',
        '여동생' : '외대고모',
        '아들' : '외종숙부',
        '딸' : '외종이모'
    }
}, {
    gender : 'M',
    title : '외종숙부',
    connection : {
        '배우자' : '외종숙모',
        '아버지' : '외종조부',
        '어머니' : '외종조모',
        '오빠' : '외종숙부',
        '남동생' : '외종숙부',
        '언니' : '외종이모',
        '여동생' : '외종이모',
        '아들' : '외재종형제',
        '딸' : '외재종남매'
    }
}, {
    gender : 'M',
    title : '외재종형제',
    connection : {
        '배우자' : '외재종수',
        '아버지' : '외종숙부',
        '어머니' : '외종숙모',
        '오빠' : '외재종형제',
        '남동생' : '외재종형제',
        '언니' : '외재종남매',
        '여동생' : '외재종남매',
        '아들' : '외재종질',
        '딸' : '외재종질녀'
    }
}, {
    gender : 'F',
    title : '외재종남매',
    connection : {
        '배우자' : '외재종매부',
        '아버지' : '외종숙부',
        '어머니' : '외종숙모',
        '오빠' : '외재종형제',
        '남동생' : '외재종형제',
        '언니' : '외재종남매',
        '여동생' : '외재종남매',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '외재종질',
    connection : {
        '배우자' : '외재종질부',
        '아버지' : '외재종형제',
        '어머니' : '외재종수',
        '오빠' : '외재종질',
        '남동생' : '외재종질',
        '언니' : '외재종질녀',
        '여동생' : '외재종질녀',
        '아들' : '외삼종손자',
        '딸' : '외삼종손녀'
    }
}, {
    gender : 'F',
    title : '외재종질녀',
    connection : {
        '배우자' : '외재종질서',
        '아버지' : '외재종형제',
        '어머니' : '외재종수',
        '오빠' : '외재종질',
        '남동생' : '외재종질',
        '언니' : '외재종질녀',
        '여동생' : '외재종질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '외삼종손자',
    connection : {
        '배우자' : '외삼종손부',
        '아버지' : '외재종질',
        '어머니' : '외재종질부',
        '오빠' : '외삼종손자',
        '남동생' : '외삼종손자',
        '언니' : '외삼종손녀',
        '여동생' : '외삼종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '외삼종손녀',
    connection : {
        '배우자' : '외삼종손서',
        '아버지' : '외재종질',
        '어머니' : '외재종질부',
        '오빠' : '외삼종손자',
        '남동생' : '외삼종손자',
        '언니' : '외삼종손녀',
        '여동생' : '외삼종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '외종이모',
    connection : {
        '배우자' : '외종이모부',
        '아버지' : '외종조부',
        '어머니' : '외종조모',
        '오빠' : '외종숙부',
        '남동생' : '외종숙부',
        '언니' : '외종이모',
        '여동생' : '외종이모',
        '아들' : '이재종형제',
        '딸' : '이재종남매'
    }
}, {
    gender : 'M',
    title : '이재종형제',
    connection : {
        '배우자' : '이재종수',
        '아버지' : '외종이모부',
        '어머니' : '외종이모',
        '오빠' : '이재종형제',
        '남동생' : '이재종형제',
        '언니' : '이재종남매',
        '여동생' : '이재종남매',
        '아들' : '종이재종질',
        '딸' : '종이재종질녀'
    }
}, {
    gender : 'F',
    title : '이재종남매',
    connection : {
        '배우자' : '이재종매부',
        '아버지' : '외종이모부',
        '어머니' : '외종이모',
        '오빠' : '이재종형제',
        '남동생' : '이재종형제',
        '언니' : '이재종남매',
        '여동생' : '이재종남매',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '종이재종질',
    connection : {
        '배우자' : '종이재종질부',
        '아버지' : '이재종형제',
        '어머니' : '이재종수',
        '오빠' : '종이재종질',
        '남동생' : '종이재종질',
        '언니' : '종이재종질녀',
        '여동생' : '종이재종질녀',
        '아들' : '종이삼종손자',
        '딸' : '종이삼종손녀'
    }
}, {
    gender : 'F',
    title : '종이재종질녀',
    connection : {
        '배우자' : '종이재종질서',
        '아버지' : '이재종형제',
        '어머니' : '이재종수',
        '오빠' : '종이재종질',
        '남동생' : '종이재종질',
        '언니' : '종이재종질녀',
        '여동생' : '종이재종질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '종이삼종손자',
    connection : {
        '배우자' : '종이삼종손부',
        '아버지' : '종이재종질',
        '어머니' : '종이재종질부',
        '오빠' : '종이삼종손자',
        '남동생' : '종이삼종손자',
        '언니' : '종이삼종손녀',
        '여동생' : '종이삼종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '종이삼종손녀',
    connection : {
        '배우자' : '종이삼종손서',
        '아버지' : '종이재종질',
        '어머니' : '종이재종질부',
        '오빠' : '종이삼종손자',
        '남동생' : '종이삼종손자',
        '언니' : '종이삼종손녀',
        '여동생' : '종이삼종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '외증조부',
    connection : {
        '배우자' : '외증조모',
        '아버지' : '외고조부',
        '어머니' : '외고조모',
        '아들' : '외종조부',
        '딸' : '외대고모'
    }
}, {
    gender : 'M',
    title : '외고조부',
    connection : {
        '배우자' : '외고조모',
        '아버지' : '외현조부',
        '어머니' : '외현조모'
    }
}, {
    gender : 'M',
    title : '외현조부',
    connection : {
        '배우자' : '외현조모',
        '아버지' : '외6대조부',
        '어머니' : '외6대조모'
    }
}, {
    gender : 'M',
    title : '외6대조부',
    connection : {
        '배우자' : '외6대조모',
        '아버지' : '외7대조부',
        '어머니' : '외7대조모'
    }
}, {
    gender : 'M',
    title : '외7대조부',
    connection : {
        '배우자' : '외7대조모',
        '아버지' : '외8대조부',
        '어머니' : '외8대조모'
    }
}, {
    gender : 'M',
    title : '외8대조부',
    connection : {
        '배우자' : '외8대조모',
        '아버지' : '외9대조부',
        '어머니' : '외9대조모'
    }
}, {
    gender : 'M',
    title : '외9대조부',
    connection : {
        '배우자' : '외9대조모',
        '아버지' : '외10대조부',
        '어머니' : '외10대조모'
    }
}, {
    gender : 'F',
    title : '나',
    connection : {
        '배우자' : '아내',
        '아버지' : '부',
        '어머니' : '모',
        '언니' : '언니',
        '오빠' : '오빠',
        '남동생' : '남동생',
        '여동생' : '여동생',
        '아들' : '아들',
        '딸' : '딸'
    }
}, {
    gender : 'M',
    title : '아들',
    connection : {
        '배우자' : '며느리',
        '아버지' : '나',
        '어머니' : '아내',
        '누나' : '딸',
        '형' : '아들',
        '남동생' : '아들',
        '여동생' : '딸',
        '아들' : '손자',
        '딸' : '손녀'
    }
}, {
    gender : 'M',
    title : '손자',
    connection : {
        '배우자' : '손부',
        '아버지' : '아들',
        '어머니' : '며느리',
        '누나' : '손녀',
        '형' : '손자',
        '남동생' : '손자',
        '여동생' : '손녀',
        '아들' : '증손자',
        '딸' : '증손녀'
    }
}, {
    gender : 'F',
    title : '손녀',
    connection : {
        '배우자' : '손서',
        '아버지' : '아들',
        '어머니' : '며느리',
        '언니' : '손녀',
        '오빠' : '손자',
        '남동생' : '손자',
        '여동생' : '손녀',
        '아들' : '외증손자',
        '딸' : '외증손녀'
    }
}, {
    gender : 'M',
    title : '증손자',
    connection : {
        '배우자' : '증손부',
        '아버지' : '손자',
        '어머니' : '손부',
        '누나' : '증손녀',
        '형' : '증손자',
        '남동생' : '증손자',
        '여동생' : '증손녀',
        '아들' : '고손자',
        '딸' : '고손녀'
    }
}, {
    gender : 'F',
    title : '증손녀',
    connection : {
        '배우자' : '증손서',
        '아버지' : '손자',
        '어머니' : '손부',
        '언니' : '증손녀',
        '오빠' : '증손자',
        '남동생' : '증손자',
        '여동생' : '증손녀',
        '아들' : '외고손자',
        '딸' : '외고손녀'
    }
}, {
    gender : 'M',
    title : '고손자',
    connection : {
        '배우자' : '고손부',
        '아버지' : '증손자',
        '어머니' : '증손부',
        '누나' : '고손녀',
        '형' : '고손자',
        '남동생' : '고손자',
        '여동생' : '고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '고손녀',
    connection : {
        '배우자' : '고손서',
        '아버지' : '증손자',
        '어머니' : '증손부',
        '언니' : '고손녀',
        '오빠' : '고손자',
        '남동생' : '고손자',
        '여동생' : '고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '딸',
    connection : {
        '배우자' : '사위',
        '아버지' : '나',
        '어머니' : '아내',
        '언니' : '딸',
        '오빠' : '아들',
        '남동생' : '아들',
        '여동생' : '딸',
        '아들' : '외손자',
        '딸' : '외손녀'
    }
}, {
    gender : 'M',
    title : '외손자',
    connection : {
        '배우자' : '외손자부',
        '아버지' : '사위',
        '어머니' : '딸',
        '누나' : '외손녀',
        '형' : '외손자',
        '남동생' : '외손자',
        '여동생' : '외손녀',
        '아들' : '외증손자',
        '딸' : '외증손녀'
    }
}, {
    gender : 'M',
    title : '외손녀',
    connection : {
        '배우자' : '외손서',
        '아버지' : '사위',
        '어머니' : '딸',
        '언니' : '외손녀',
        '오빠' : '외손자',
        '남동생' : '외손자',
        '여동생' : '외손녀',
        '아들' : '외증손자',
        '딸' : '외증손녀'
    }
}, {
    gender : 'M',
    title : '외고손자',
    connection : {
        '배우자' : '외고손부',
        '아버지' : '증손서',
        '어머니' : '증손녀',
        '누나' : '외고손녀',
        '형' : '외고손자',
        '남동생' : '외고손자',
        '여동생' : '외고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '외고손녀',
    connection : {
        '배우자' : '외고손서',
        '아버지' : '증손서',
        '어머니' : '증손녀',
        '언니' : '외고손녀',
        '오빠' : '외고손자',
        '남동생' : '외고손자',
        '여동생' : '외고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '외증손자',
    connection : {
        '배우자' : '외증손부',
        '아버지' : '손서',
        '어머니' : '손녀',
        '누나' : '외증손녀',
        '형' : '외증손자',
        '남동생' : '외증손자',
        '여동생' : '외증손녀',
        '아들' : '외고손자',
        '딸' : '외고손녀'
    }
}, {
    gender : 'F',
    title : '외증손녀',
    connection : {
        '배우자' : '외증손서',
        '아버지' : '손서',
        '어머니' : '손녀',
        '언니' : '외증손녀',
        '오빠' : '외증손자',
        '남동생' : '외증손자',
        '여동생' : '외증손녀',
        '아들' : '외고손자',
        '딸' : '외고손녀'
    }
},
// { gender: 'M', title:'외고손자', connection:
// {'배우자':'외고손부','아버지':'외증손서','어머니':'외증손녀','누나':'외고손녀','형':'외고손자','남동생':'외고손자','여동생':'외고손녀','아들':'호칭없음','딸':'호칭없음'}},
// { gender: 'F', title:'외고손녀', connection:
// {'배우자':'외고손서','아버지':'외증손서','어머니':'외증손녀','언니':'외고손녀','오빠':'외고손자','남동생':'외고손자','여동생':'외고손녀','아들':'호칭없음','딸':'호칭없음'}},
    {
        gender : 'M',
        title : '오빠',
        connection : {
            '배우자' : '형수',
            '아버지' : '아버지',
            '어머니' : '어머니',
            '누나' : '언니',
            '형' : '오빠',
            '남동생' : '오빠',
            '여동생' : '언니',
            '아들' : '질',
            '딸' : '질녀'
        }
    }, {
        gender : 'M',
        title : '질',
        connection : {
            '배우자' : '질부',
            '아버지' : '형',
            '어머니' : '형수',
            '누나' : '질녀',
            '형' : '질',
            '남동생' : '질',
            '여동생' : '질녀',
            '아들' : '종손자',
            '딸' : '종손녀'
        }
    }, {
        gender : 'M',
        title : '종손자',
        connection : {
            '배우자' : '종손부',
            '아버지' : '질',
            '어머니' : '질부',
            '누나' : '종손녀',
            '형' : '종손자',
            '남동생' : '종손자',
            '여동생' : '종손녀',
            '아들' : '종증손자',
            '딸' : '종증손녀'
        }
    }, {
        gender : 'M',
        title : '종증손자',
        connection : {
            '배우자' : '종증손부',
            '아버지' : '종손자',
            '어머니' : '종손부',
            '누나' : '종증손녀',
            '형' : '종증손자',
            '남동생' : '종증손자',
            '여동생' : '종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '종증손녀',
        connection : {
            '배우자' : '종증손서',
            '아버지' : '종손자',
            '어머니' : '종손부',
            '언니' : '종증손녀',
            '오빠' : '종증손자',
            '남동생' : '종증손자',
            '여동생' : '종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '종손녀',
        connection : {
            '배우자' : '종손서',
            '아버지' : '질',
            '어머니' : '질부',
            '언니' : '종손녀',
            '오빠' : '종손자',
            '남동생' : '종손자',
            '여동생' : '종손녀',
            '아들' : '종외증손자',
            '딸' : '종외증손녀'
        }
    }, {
        gender : 'M',
        title : '종외증손자',
        connection : {
            '배우자' : '종외증손부',
            '아버지' : '종손서',
            '어머니' : '종손녀',
            '누나' : '종외증손녀',
            '형' : '종외증손자',
            '남동생' : '종외증손자',
            '여동생' : '종외증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '종외증손녀',
        connection : {
            '배우자' : '종외증손서',
            '아버지' : '종손서',
            '어머니' : '종손녀',
            '언니' : '종외증손녀',
            '오빠' : '종외증손자',
            '남동생' : '종외증손자',
            '여동생' : '종외증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '질녀',
        connection : {
            '배우자' : '질서',
            '아버지' : '형',
            '어머니' : '형수',
            '언니' : '질녀',
            '오빠' : '질',
            '남동생' : '질',
            '여동생' : '질녀',
            '아들' : '외종손자',
            '딸' : '외종손녀'
        }
    }, {
        gender : 'M',
        title : '외종손자',
        connection : {
            '배우자' : '외종손부',
            '아버지' : '질서',
            '어머니' : '질녀',
            '누나' : '외종손녀',
            '형' : '외종손자',
            '남동생' : '외종손자',
            '여동생' : '외종손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '외종손녀',
        connection : {
            '배우자' : '외종손서',
            '아버지' : '질서',
            '어머니' : '질녀',
            '언니' : '외종손녀',
            '오빠' : '외종손자',
            '남동생' : '외종손자',
            '여동생' : '외종손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'M',
        title : '남동생',
        connection : {
            '배우자' : '제수',
            '아버지' : '아버지',
            '어머니' : '어머니',
            '누나' : '여동생',
            '형' : '남동생',
            '남동생' : '남동생',
            '여동생' : '여동생',
            '아들' : '질',
            '딸' : '질녀'
        }
    }, {
        gender : 'F',
        title : '누나',
        connection : {
            '배우자' : '자형',
            '아버지' : '아버지',
            '어머니' : '어머니',
            '언니' : '언니',
            '오빠' : '오빠',
            '남동생' : '오빠',
            '여동생' : '언니',
            '아들' : '생질',
            '딸' : '생질녀'
        }
    }, {
        gender : 'M',
        title : '생질',
        connection : {
            '배우자' : '생질부',
            '아버지' : '자형',
            '어머니' : '누나',
            '누나' : '생질녀',
            '형' : '생질',
            '남동생' : '생질',
            '여동생' : '생질녀',
            '아들' : '생종손자',
            '딸' : '생종손녀'
        }
    }, {
        gender : 'M',
        title : '생종손자',
        connection : {
            '배우자' : '생종손부',
            '아버지' : '생질',
            '어머니' : '생질부',
            '누나' : '생종손녀',
            '형' : '생종손자',
            '남동생' : '생종손자',
            '여동생' : '생종손녀',
            '아들' : '생종증손자',
            '딸' : '생종증손녀'
        }
    }, {
        gender : 'M',
        title : '생종증손자',
        connection : {
            '배우자' : '생종증손부',
            '아버지' : '생종손자',
            '어머니' : '생종손부',
            '누나' : '생종증손녀',
            '형' : '생종증손자',
            '남동생' : '생종증손자',
            '여동생' : '생종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '생종증손녀',
        connection : {
            '배우자' : '생종증손서',
            '아버지' : '생종손자',
            '어머니' : '생종손부',
            '언니' : '생종증손녀',
            '오빠' : '생종증손자',
            '남동생' : '생종증손자',
            '여동생' : '생종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '생종손녀',
        connection : {
            '배우자' : '생종손서',
            '아버지' : '생질',
            '어머니' : '생질부',
            '언니' : '생종손녀',
            '오빠' : '생종손자',
            '남동생' : '생종손자',
            '여동생' : '생종손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '생질녀',
        connection : {
            '배우자' : '생질서',
            '아버지' : '자형',
            '어머니' : '누나',
            '언니' : '생질녀',
            '오빠' : '생질',
            '남동생' : '생질',
            '여동생' : '생질녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '여동생',
        connection : {
            '배우자' : '매제',
            '아버지' : '아버지',
            '어머니' : '어머니',
            '언니' : '여동생',
            '오빠' : '남동생',
            '남동생' : '남동생',
            '여동생' : '여동생',
            '아들' : '생질',
            '딸' : '생질녀'
        }
    } ];

// 남자 처가
var FTIW1 = [ {
    gender : 'M',
    title : '부',
    connection : {
        '배우자' : '장모',
        '아버지' : '처조부',
        '어머니' : '처조모',
        '형' : '처백부',
        '남동생' : '처숙부',
        '누나' : '처고모',
        '여동생' : '처고모',
        '아들' : '처남',
        '딸' : '처제'
    }
}, {
    gender : 'F',
    title : '모',
    connection : {
        '배우자' : '장인',
        '아버지' : '처조부',
        '어머니' : '처조모',
        '오빠' : '처백부',
        '남동생' : '처숙부',
        '언니' : '처고모',
        '여동생' : '처고모',
        '아들' : '처남',
        '딸' : '처제'
    }
}, {
    gender : 'M',
    title : '아버지',
    connection : {
        '배우자' : '장모',
        '아버지' : '처조부',
        '어머니' : '처조모',
        '형' : '처백부',
        '남동생' : '처숙부',
        '누나' : '처고모',
        '여동생' : '처고모',
        '아들' : '처남',
        '딸' : '처제'
    }
}, {
    gender : 'F',
    title : '어머니',
    connection : {
        '배우자' : '장인',
        '아버지' : '처조부',
        '어머니' : '처조모',
        '오빠' : '처백부',
        '남동생' : '처숙부',
        '언니' : '처고모',
        '여동생' : '처고모',
        '아들' : '처남',
        '딸' : '처제'
    }
}, {
    gender : 'M',
    title : '처백부',
    connection : {
        '배우자' : '처백모',
        '아버지' : '처조부',
        '어머니' : '처조모',
        '형' : '처백부',
        '남동생' : '처백부',
        '누나' : '처고모',
        '여동생' : '처고모',
        '아들' : '종처남',
        '딸' : '종처형·처제'
    }
}, {
    gender : 'M',
    title : '처숙부',
    connection : {
        '배우자' : '처숙모',
        '아버지' : '처조부',
        '어머니' : '처조모',
        '누나' : '처고모',
        '형' : '처백부',
        '남동생' : '처숙부',
        '여동생' : '처고모',
        '아들' : '종처남',
        '딸' : '종처형·처제'
    }
}, {
    gender : 'M',
    title : '종처남',
    connection : {
        '배우자' : '종처남댁',
        '아버지' : '처숙부',
        '어머니' : '처숙모',
        '형' : '종형제',
        '남동생' : '종형제',
        '누나' : '종처형·처제',
        '여동생' : '종처형·처제',
        '아들' : '처종질',
        '딸' : '처종질녀'
    }
}, {
    gender : 'M',
    title : '처종질',
    connection : {
        '배우자' : '처종질부',
        '아버지' : '종처남',
        '어머니' : '종처남댁',
        '형' : '처종질',
        '남동생' : '처종질',
        '누나' : '처종질녀',
        '여동생' : '처종질녀',
        '아들' : '처재종손자',
        '딸' : '처재종손녀'
    }
}, {
    gender : 'F',
    title : '처종질녀',
    connection : {
        '배우자' : '처종질서',
        '아버지' : '종처남',
        '어머니' : '종처남댁',
        '오빠' : '처종질',
        '남동생' : '처종질',
        '언니' : '처종질녀',
        '여동생' : '처종질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '처재종손자',
    connection : {
        '배우자' : '처재종손부',
        '아버지' : '처종질',
        '어머니' : '처종질부',
        '형' : '처재종손자',
        '남동생' : '처재종손자',
        '누나' : '처재종손녀',
        '여동생' : '처재종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처재종손녀',
    connection : {
        '배우자' : '처재종손서',
        '아버지' : '처종질',
        '어머니' : '처종질부',
        '오빠' : '처재종손자',
        '남동생' : '처재종손자',
        '언니' : '처재종손녀',
        '여동생' : '처재종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '종처형·처제',
    connection : {
        '배우자' : '종동서',
        '아버지' : '처숙부',
        '어머니' : '처숙모',
        '오빠' : '종형제',
        '남동생' : '종형제',
        '언니' : '종처형·처제',
        '여동생' : '종처형·처제',
        '아들' : '처종이질',
        '딸' : '처종이질녀'
    }
}, {
    gender : 'M',
    title : '처종이질',
    connection : {
        '배우자' : '처종이질부',
        '아버지' : '종동서',
        '어머니' : '종처형·처제',
        '형' : '처종이질',
        '남동생' : '처종이질',
        '누나' : '처종이질녀',
        '여동생' : '처종이질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처종이질녀',
    connection : {
        '배우자' : '처종이질서',
        '아버지' : '종동서',
        '어머니' : '종처형·처제',
        '오빠' : '처종이질',
        '남동생' : '처종이질',
        '언니' : '처종이질녀',
        '여동생' : '처종이질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처고모',
    connection : {
        '배우자' : '처고모부',
        '아버지' : '처조부',
        '어머니' : '처조모',
        '오빠' : '처숙부',
        '남동생' : '처숙부',
        '언니' : '처고모',
        '여동생' : '처고모',
        '아들' : '내종처남',
        '딸' : '내종처형·처제'
    }
}, {
    gender : 'M',
    title : '내종처남',
    connection : {
        '배우자' : '내종처남댁',
        '아버지' : '처고모부',
        '어머니' : '처고모',
        '형' : '내종처남',
        '남동생' : '내종처남',
        '누나' : '내종처형·처제',
        '여동생' : '내종처형·처제',
        '아들' : '처내종질',
        '딸' : '처내종질녀'
    }
}, {
    gender : 'M',
    title : '처내종질',
    connection : {
        '배우자' : '처내종질부',
        '아버지' : '내종처남',
        '어머니' : '내종처남댁',
        '형' : '처내종질',
        '남동생' : '처내종질',
        '누나' : '처내종질녀',
        '여동생' : '처내종질녀',
        '아들' : '처내재종손자',
        '딸' : '처내재종손녀'
    }
}, {
    gender : 'M',
    title : '처내재종손자',
    connection : {
        '배우자' : '처내재종손부',
        '아버지' : '처내종질',
        '어머니' : '처내종질부',
        '형' : '처내재종손자',
        '남동생' : '처내재종손자',
        '누나' : '처내재종손녀',
        '여동생' : '처내재종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처내재종손녀',
    connection : {
        '배우자' : '처내재종손서',
        '아버지' : '처내종질',
        '어머니' : '처내종질부',
        '오빠' : '처내재종손자',
        '남동생' : '처내재종손자',
        '언니' : '처내재종손녀',
        '여동생' : '처내재종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처내종질녀',
    connection : {
        '배우자' : '처내종질서',
        '아버지' : '내종처남',
        '어머니' : '내종처남댁',
        '오빠' : '처내종질',
        '남동생' : '처내종질',
        '언니' : '처내종질녀',
        '여동생' : '처내종질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '내종처형·처제',
    connection : {
        '배우자' : '내종동서',
        '아버지' : '처고모부',
        '어머니' : '처고모',
        '오빠' : '내종처남',
        '남동생' : '내종처남',
        '언니' : '내종처형·처제',
        '여동생' : '내종처형·처제',
        '아들' : '처내종이질',
        '딸' : '처내종이질녀'
    }
}, {
    gender : 'M',
    title : '처내종이질',
    connection : {
        '배우자' : '처내종이질부',
        '아버지' : '내종동서',
        '어머니' : '내종처형·처제',
        '형' : '처내종이질',
        '남동생' : '처내종이질',
        '누나' : '처내종이질녀',
        '여동생' : '처내종이질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처내종이질녀',
    connection : {
        '배우자' : '처내종이질서',
        '아버지' : '내종동서',
        '어머니' : '내종처형·처제',
        '오빠' : '처내종이질',
        '남동생' : '처내종이질',
        '언니' : '처내종이질녀',
        '여동생' : '처내종이질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '처조부',
    connection : {
        '배우자' : '처조모',
        '아버지' : '처증조부',
        '어머니' : '처증조모',
        '형' : '처종조부',
        '남동생' : '처종조부',
        '누나' : '처대고모',
        '여동생' : '처대고모',
        '아들' : '처숙부',
        '딸' : '처고모'
    }
}, {
    gender : 'M',
    title : '처종조부',
    connection : {
        '배우자' : '처종조모',
        '아버지' : '처증조부',
        '어머니' : '처증조모',
        '형' : '처종조부',
        '남동생' : '처종조부',
        '누나' : '처대고모',
        '여동생' : '처대고모',
        '아들' : '처종숙부',
        '딸' : '처종고모'
    }
}, {
    gender : 'M',
    title : '처종숙부',
    connection : {
        '배우자' : '처종숙모',
        '아버지' : '처종조부',
        '어머니' : '처종조모',
        '형' : '처종숙부',
        '남동생' : '처종숙부',
        '누나' : '처종고모',
        '여동생' : '처종고모',
        '아들' : '재종처남',
        '딸' : '재종처형'
    }
}, {
    gender : 'M',
    title : '재종처남',
    connection : {
        '배우자' : '재종처남댁',
        '아버지' : '처종숙부',
        '어머니' : '처종숙모',
        '형' : '재종처남',
        '남동생' : '재종처남',
        '누나' : '재종처형',
        '여동생' : '재종처형',
        '아들' : '처재종질',
        '딸' : '처재종질녀'
    }
}, {
    gender : 'M',
    title : '처재종질',
    connection : {
        '배우자' : '처재종질부',
        '아버지' : '재종처남',
        '어머니' : '재종처남댁',
        '형' : '처재종질',
        '남동생' : '처재종질',
        '누나' : '처재종질녀',
        '여동생' : '처재종질녀',
        '아들' : '처삼종손자',
        '딸' : '처삼종손녀'
    }
}, {
    gender : 'M',
    title : '처삼종손자',
    connection : {
        '배우자' : '처삼종손부',
        '아버지' : '처재종질',
        '어머니' : '처재종질부',
        '형' : '처삼종손자',
        '남동생' : '처삼종손자',
        '누나' : '처삼종손녀',
        '여동생' : '처삼종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처삼종손녀',
    connection : {
        '배우자' : '처삼종손서',
        '아버지' : '처재종질',
        '어머니' : '처재종질부',
        '오빠' : '처삼종손자',
        '남동생' : '처삼종손자',
        '언니' : '처삼종손녀',
        '여동생' : '처삼종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처재종질녀',
    connection : {
        '배우자' : '처재종질서',
        '아버지' : '재종처남',
        '어머니' : '재종처남댁',
        '오빠' : '처재종질',
        '남동생' : '처재종질',
        '언니' : '처재종질녀',
        '여동생' : '처재종질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '재종처형',
    connection : {
        '배우자' : '재종형님',
        '아버지' : '처종숙부',
        '어머니' : '처종숙모',
        '오빠' : '재종처남',
        '남동생' : '재종처남',
        '언니' : '재종처형',
        '여동생' : '재종처형',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처종고모',
    connection : {
        '배우자' : '처종고모부',
        '아버지' : '처종조부',
        '어머니' : '처종조모',
        '오빠' : '처종숙부',
        '남동생' : '처종숙부',
        '언니' : '처종고모',
        '여동생' : '처종고모',
        '아들' : '종고재종처남',
        '딸' : '종고재종처형'
    }
}, {
    gender : 'M',
    title : '종고재종처남',
    connection : {
        '배우자' : '종고재종처남댁',
        '아버지' : '처종고모부',
        '어머니' : '처종고모',
        '형' : '종고재종처남',
        '남동생' : '종고재종처남',
        '누나' : '종고재종처형',
        '여동생' : '종고재종처형',
        '아들' : '처내재종질',
        '딸' : '처내재종질녀'
    }
}, {
    gender : 'M',
    title : '처내재종질',
    connection : {
        '배우자' : '처내재종질부',
        '아버지' : '종고재종처남',
        '어머니' : '종고재종처남댁',
        '형' : '처내재종질',
        '남동생' : '처내재종질',
        '누나' : '처내재종질녀',
        '여동생' : '처내재종질녀',
        '아들' : '처내삼종손자',
        '딸' : '처내삼종손녀'
    }
}, {
    gender : 'M',
    title : '처내삼종손자',
    connection : {
        '배우자' : '처내삼종손부',
        '아버지' : '처내재종질',
        '어머니' : '처내재종질부',
        '형' : '처내삼종손자',
        '남동생' : '처내삼종손자',
        '누나' : '처내삼종손녀',
        '여동생' : '처내삼종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처내삼종손녀',
    connection : {
        '배우자' : '처내삼종손서',
        '아버지' : '처내재종질',
        '어머니' : '처내재종질부',
        '오빠' : '처내삼종손자',
        '남동생' : '처내삼종손자',
        '언니' : '처내삼종손녀',
        '여동생' : '처내삼종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처내재종질녀',
    connection : {
        '배우자' : '처내재종질서',
        '아버지' : '종고재종처남',
        '어머니' : '종고재종처남댁',
        '오빠' : '처내재종질',
        '남동생' : '처내재종질',
        '언니' : '처내재종질녀',
        '여동생' : '처내재종질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '종고재종처형',
    connection : {
        '배우자' : '종고재종형님',
        '아버지' : '처종고모부',
        '어머니' : '처종고모',
        '오빠' : '종고재종처남',
        '남동생' : '종고재종처남',
        '언니' : '종고재종처형',
        '여동생' : '종고재종처형',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처대고모',
    connection : {
        '배우자' : '처대고모부',
        '아버지' : '처증조부',
        '어머니' : '처증조모',
        '오빠' : '처종조부',
        '남동생' : '처종조부',
        '언니' : '처대고모',
        '여동생' : '처대고모',
        '아들' : '처내종숙부',
        '딸' : '처내종고모'
    }
}, {
    gender : 'M',
    title : '처내종숙부',
    connection : {
        '배우자' : '처내종숙모',
        '아버지' : '처대고모부',
        '어머니' : '처대고모',
        '형' : '처내종숙부',
        '남동생' : '처내종숙부',
        '누나' : '처내종고모',
        '여동생' : '처내종고모',
        '아들' : '내재종처남',
        '딸' : '내재종처형'
    }
}, {
    gender : 'M',
    title : '내재종처남',
    connection : {
        '배우자' : '내재종처남댁',
        '아버지' : '처내종숙부',
        '어머니' : '처내종숙모',
        '형' : '내재종처남',
        '남동생' : '내재종처남',
        '누나' : '내재종처형',
        '여동생' : '내재종처형',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '내재종처형',
    connection : {
        '배우자' : '내재종형님',
        '아버지' : '처내종숙부',
        '어머니' : '처내종숙모',
        '오빠' : '내재종처남',
        '남동생' : '내재종처남',
        '언니' : '내재종처형',
        '여동생' : '내재종처형',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처내종고모',
    connection : {
        '배우자' : '처내종고모부',
        '아버지' : '처대고모부',
        '어머니' : '처대고모',
        '오빠' : '처내종숙부',
        '남동생' : '처내종숙부',
        '언니' : '처내종고모',
        '여동생' : '처내종고모',
        '아들' : '처내종고모아들',
        '딸' : '처내종고모딸'
    }
}, {
    gender : 'M',
    title : '처내종고모아들',
    connection : {
        '배우자' : '처내종고모자부',
        '아버지' : '처내종고모부',
        '어머니' : '처내종고모',
        '형' : '처내종고모아들',
        '남동생' : '처내종고모아들',
        '누나' : '처내종고모딸',
        '여동생' : '처내종고모딸',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처내종고모딸',
    connection : {
        '배우자' : '처내종고모사위',
        '아버지' : '처내종고모부',
        '어머니' : '처내종고모',
        '오빠' : '처내종고모아들',
        '남동생' : '처내종고모아들',
        '언니' : '처내종고모딸',
        '여동생' : '처내종고모딸',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '처증조부',
    connection : {
        '배우자' : '처증조모',
        '아버지' : '처고조부',
        '어머니' : '처고조모',
        '아들' : '처종조부',
        '딸' : '처대고모'
    }
}, {
    gender : 'M',
    title : '처고조부',
    connection : {
        '배우자' : '처고조모',
        '아버지' : '처현조부',
        '어머니' : '처현조모'
    }
}, {
    gender : 'M',
    title : '처현조부',
    connection : {
        '배우자' : '처현조모',
        '아버지' : '처6대조부',
        '어머니' : '처6대조모'
    }
}, {
    gender : 'M',
    title : '처6대조부',
    connection : {
        '배우자' : '처6대조모',
        '아버지' : '처7대조부',
        '어머니' : '처7대조모'
    }
}, {
    gender : 'M',
    title : '처7대조부',
    connection : {
        '배우자' : '처7대조모',
        '아버지' : '처8대조부',
        '어머니' : '처8대조모'
    }
}, {
    gender : 'M',
    title : '처8대조부',
    connection : {
        '배우자' : '처8대조모',
        '아버지' : '처9대조부',
        '어머니' : '처9대조모'
    }
}, {
    gender : 'M',
    title : '처9대조부',
    connection : {
        '배우자' : '처9대조모',
        '아버지' : '처10대조부',
        '어머니' : '처10대조모'
    }
}, {
    gender : 'M',
    title : '나',
    connection : {
        '배우자' : '아내',
        '아버지' : '장인',
        '어머니' : '장모',
        '언니' : '언니',
        '형' : '형',
        '남동생' : '남동생',
        '여동생' : '여동생',
        '아들' : '아들',
        '딸' : '딸'
    }
}, {
    gender : 'F',
    title : '아내',
    connection : {
        '배우자' : '남편',
        '아버지' : '장인',
        '어머니' : '장모',
        '언니' : '처형',
        '오빠' : '처남',
        '남동생' : '처남',
        '여동생' : '처제',
        '아들' : '아들',
        '딸' : '딸'
    }
}, {
    gender : 'M',
    title : '아들',
    connection : {
        '배우자' : '며느리',
        '아버지' : '나',
        '어머니' : '아내',
        '누나' : '딸',
        '형' : '아들',
        '남동생' : '아들',
        '여동생' : '딸',
        '아들' : '손자',
        '딸' : '손녀'
    }
}, {
    gender : 'M',
    title : '손자',
    connection : {
        '배우자' : '손부',
        '아버지' : '아들',
        '어머니' : '며느리',
        '누나' : '손녀',
        '형' : '손자',
        '남동생' : '손자',
        '여동생' : '손녀',
        '아들' : '증손자',
        '딸' : '증손녀'
    }
}, {
    gender : 'F',
    title : '손녀',
    connection : {
        '배우자' : '손서',
        '아버지' : '아들',
        '어머니' : '며느리',
        '언니' : '손녀',
        '오빠' : '손자',
        '남동생' : '손자',
        '여동생' : '손녀',
        '아들' : '외증손자',
        '딸' : '외증손녀'
    }
}, {
    gender : 'M',
    title : '증손자',
    connection : {
        '배우자' : '증손부',
        '아버지' : '손자',
        '어머니' : '손부',
        '누나' : '증손녀',
        '형' : '증손자',
        '남동생' : '증손자',
        '여동생' : '증손녀',
        '아들' : '고손자',
        '딸' : '고손녀'
    }
}, {
    gender : 'F',
    title : '증손녀',
    connection : {
        '배우자' : '증손서',
        '아버지' : '손자',
        '어머니' : '손부',
        '언니' : '증손녀',
        '오빠' : '증손자',
        '남동생' : '증손자',
        '여동생' : '증손녀',
        '아들' : '외고손자',
        '딸' : '외고손녀'
    }
}, {
    gender : 'M',
    title : '고손자',
    connection : {
        '배우자' : '고손부',
        '아버지' : '증손자',
        '어머니' : '증손부',
        '누나' : '고손녀',
        '형' : '고손자',
        '남동생' : '고손자',
        '여동생' : '고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '고손녀',
    connection : {
        '배우자' : '고손서',
        '아버지' : '증손자',
        '어머니' : '증손부',
        '언니' : '고손녀',
        '오빠' : '고손자',
        '남동생' : '고손자',
        '여동생' : '고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '딸',
    connection : {
        '배우자' : '사위',
        '아버지' : '나',
        '어머니' : '아내',
        '언니' : '딸',
        '오빠' : '아들',
        '남동생' : '아들',
        '여동생' : '딸',
        '아들' : '외손자',
        '딸' : '외손녀'
    }
}, {
    gender : 'M',
    title : '외손자',
    connection : {
        '배우자' : '외손자부',
        '아버지' : '사위',
        '어머니' : '딸',
        '누나' : '외손녀',
        '형' : '외손자',
        '남동생' : '외손자',
        '여동생' : '외손녀',
        '아들' : '외증손자',
        '딸' : '외증손녀'
    }
}, {
    gender : 'F',
    title : '외손녀',
    connection : {
        '배우자' : '외손서',
        '아버지' : '사위',
        '어머니' : '딸',
        '언니' : '외손녀',
        '오빠' : '외손자',
        '남동생' : '외손자',
        '여동생' : '외손녀',
        '아들' : '외증손자',
        '딸' : '외증손녀'
    }
}, {
    gender : 'M',
    title : '외고손자',
    connection : {
        '배우자' : '외고손부',
        '아버지' : '증손서',
        '어머니' : '증손녀',
        '누나' : '외고손녀',
        '형' : '외고손자',
        '남동생' : '외고손자',
        '여동생' : '외고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '외고손녀',
    connection : {
        '배우자' : '외고손서',
        '아버지' : '증손서',
        '어머니' : '증손녀',
        '언니' : '외고손녀',
        '오빠' : '외고손자',
        '남동생' : '외고손자',
        '여동생' : '외고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '외증손자',
    connection : {
        '배우자' : '외증손부',
        '아버지' : '손서',
        '어머니' : '손녀',
        '누나' : '외증손녀',
        '형' : '외증손자',
        '남동생' : '외증손자',
        '여동생' : '외증손녀',
        '아들' : '외고손자',
        '딸' : '외고손녀'
    }
}, {
    gender : 'F',
    title : '외증손녀',
    connection : {
        '배우자' : '외증손서',
        '아버지' : '손서',
        '어머니' : '손녀',
        '언니' : '외증손녀',
        '오빠' : '외증손자',
        '남동생' : '외증손자',
        '여동생' : '외증손녀',
        '아들' : '외고손자',
        '딸' : '외고손녀'
    }
},
// { gender: 'M', title:'외고손자', connection:
// {'배우자':'외고손부','아버지':'외증손서','어머니':'외증손녀','누나':'외고손녀','형':'외고손자','남동생':'외고손자','여동생':'외고손녀','아들':'호칭없음','딸':'호칭없음'}},
// { gender: 'F', title:'외고손녀', connection:
// {'배우자':'외고손서','아버지':'외증손서','어머니':'외증손녀','언니':'외고손녀','오빠':'외고손자','남동생':'외고손자','여동생':'외고손녀','아들':'호칭없음','딸':'호칭없음'}},
    {
        gender : 'M',
        title : '처남',
        connection : {
            '배우자' : '처남댁',
            '아버지' : '장인',
            '어머니' : '장모',
            '형' : '처남',
            '남동생' : '처남',
            '누나' : '처형',
            '여동생' : '처제',
            '아들' : '처질',
            '딸' : '처질녀'
        }
    }, {
        gender : 'M',
        title : '처질',
        connection : {
            '배우자' : '처질부',
            '아버지' : '처남',
            '어머니' : '처남댁',
            '형' : '처질',
            '남동생' : '처질',
            '누나' : '처질녀',
            '여동생' : '처질녀',
            '아들' : '처종손자',
            '딸' : '처종손녀'
        }
    }, {
        gender : 'M',
        title : '처종손자',
        connection : {
            '배우자' : '처종손부',
            '아버지' : '처질',
            '어머니' : '처질부',
            '형' : '처종손자',
            '남동생' : '처종손자',
            '누나' : '처종손녀',
            '여동생' : '처종손녀',
            '아들' : '처종증손자',
            '딸' : '처종증손녀'
        }
    }, {
        gender : 'M',
        title : '처종증손자',
        connection : {
            '배우자' : '처종증손부',
            '아버지' : '처종손자',
            '어머니' : '처종손부',
            '형' : '처종증손자',
            '남동생' : '처종증손자',
            '누나' : '처종증손녀',
            '여동생' : '처종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '처종증손녀',
        connection : {
            '배우자' : '처종증손서',
            '아버지' : '처종손자',
            '어머니' : '처종손부',
            '오빠' : '처종증손자',
            '남동생' : '처종증손자',
            '언니' : '처종증손녀',
            '여동생' : '처종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '처종손녀',
        connection : {
            '배우자' : '처종손서',
            '아버지' : '처질',
            '어머니' : '처질부',
            '오빠' : '처종손자',
            '남동생' : '처종손자',
            '언니' : '처종손녀',
            '여동생' : '처종손녀',
            '아들' : '처종외증손자',
            '딸' : '처종외증손녀'
        }
    }, {
        gender : 'M',
        title : '처종외증손자',
        connection : {
            '배우자' : '처종외증손부',
            '아버지' : '처종손서',
            '어머니' : '처종손녀',
            '형' : '처종외증손자',
            '남동생' : '처종외증손자',
            '누나' : '처종외증손녀',
            '여동생' : '처종외증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '처종외증손녀',
        connection : {
            '배우자' : '처종외증손서',
            '아버지' : '처종손서',
            '어머니' : '처종손녀',
            '오빠' : '처종외증손자',
            '남동생' : '처종외증손자',
            '언니' : '처종외증손녀',
            '여동생' : '처종외증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '처질녀',
        connection : {
            '배우자' : '처질서',
            '아버지' : '처남',
            '어머니' : '처남댁',
            '오빠' : '처질',
            '남동생' : '처질',
            '언니' : '처질녀',
            '여동생' : '처질녀',
            '아들' : '처외종손자',
            '딸' : '처외종손녀'
        }
    }, {
        gender : 'M',
        title : '처외종손자',
        connection : {
            '배우자' : '처외종손부',
            '아버지' : '처질서',
            '어머니' : '처질녀',
            '형' : '처외종손자',
            '남동생' : '처외종손자',
            '누나' : '처외종손녀',
            '여동생' : '처외종손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '처외종손녀',
        connection : {
            '배우자' : '처외종손서',
            '아버지' : '처질서',
            '어머니' : '처질녀',
            '오빠' : '처외종손자',
            '남동생' : '처외종손자',
            '언니' : '처외종손녀',
            '여동생' : '처외종손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'M',
        title : '남동생',
        connection : {
            '배우자' : '제수',
            '아버지' : '아버지',
            '어머니' : '어머니',
            '누나' : '누나',
            '형' : '형',
            '남동생' : '남동생',
            '여동생' : '여동생',
            '아들' : '질',
            '딸' : '질녀'
        }
    }, {
        gender : 'F',
        title : '처형',
        connection : {
            '배우자' : '동서',
            '아버지' : '장인',
            '어머니' : '장모',
            '오빠' : '처남',
            '남동생' : '처남',
            '언니' : '처형',
            '여동생' : '처형',
            '아들' : '처이질',
            '딸' : '처이질녀'
        }
    }, {
        gender : 'F',
        title : '처제',
        connection : {
            '배우자' : '동서',
            '아버지' : '장인',
            '어머니' : '장모',
            '오빠' : '처남',
            '남동생' : '처남',
            '언니' : '처제',
            '여동생' : '처제',
            '아들' : '처이질',
            '딸' : '처이질녀'
        }
    }, {
        gender : 'M',
        title : '처이질',
        connection : {
            '배우자' : '처이질부',
            '아버지' : '동서',
            '어머니' : '처제',
            '형' : '처이질',
            '남동생' : '처이질',
            '누나' : '처이질녀',
            '여동생' : '처이질녀',
            '아들' : '처이종손자',
            '딸' : '처이종손녀'
        }
    }, {
        gender : 'M',
        title : '처이종손자',
        connection : {
            '배우자' : '처이종손부',
            '아버지' : '처이질',
            '어머니' : '처이질부',
            '형' : '처이종손자',
            '남동생' : '처이종손자',
            '누나' : '처이종손녀',
            '여동생' : '처이종손녀',
            '아들' : '처이종증손자',
            '딸' : '처이종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'M',
        title : '처이종증손자',
        connection : {
            '배우자' : '처이종증손부',
            '아버지' : '처이종손자',
            '어머니' : '처이종손부',
            '형' : '처이종증손자',
            '남동생' : '처이종증손자',
            '누나' : '처이종증손녀',
            '여동생' : '처이종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '처이종증손녀',
        connection : {
            '배우자' : '처이종증손서',
            '아버지' : '처이종손자',
            '어머니' : '처이종손부',
            '오빠' : '처이종증손자',
            '남동생' : '처이종증손자',
            '언니' : '처이종증손녀',
            '여동생' : '처이종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '처이종손녀',
        connection : {
            '배우자' : '처이종손서',
            '아버지' : '처이질',
            '어머니' : '처이질부',
            '오빠' : '처이종손자',
            '남동생' : '처이종손자',
            '언니' : '처이종손녀',
            '여동생' : '처이종손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '처이질녀',
        connection : {
            '배우자' : '처이질서',
            '아버지' : '동서',
            '어머니' : '처제',
            '오빠' : '처이질',
            '남동생' : '처이질',
            '언니' : '처이질녀',
            '여동생' : '처이질녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, ];

// 남자 처외가
var FTIW2 = [ {
    gender : 'M',
    title : '부',
    connection : {
        '배우자' : '장모',
        '아버지' : '처외조부',
        '어머니' : '처외조모',
        '형' : '처외백부',
        '남동생' : '처외숙부',
        '누나' : '처이모',
        '여동생' : '처이모',
        '아들' : '처남',
        '딸' : '처제'
    }
}, {
    gender : 'F',
    title : '모',
    connection : {
        '배우자' : '장인',
        '아버지' : '처외조부',
        '어머니' : '처외조모',
        '오빠' : '처외백부',
        '남동생' : '처외숙부',
        '언니' : '처이모',
        '여동생' : '처이모',
        '아들' : '처남',
        '딸' : '처제'
    }
}, {
    gender : 'M',
    title : '아버지',
    connection : {
        '배우자' : '장모',
        '아버지' : '처외조부',
        '어머니' : '처외조모',
        '형' : '처외백부',
        '남동생' : '처외숙부',
        '누나' : '처이모',
        '여동생' : '처이모',
        '아들' : '처남',
        '딸' : '처제'
    }
}, {
    gender : 'F',
    title : '어머니',
    connection : {
        '배우자' : '장인',
        '아버지' : '처외조부',
        '어머니' : '처외조모',
        '오빠' : '처외백부',
        '남동생' : '처외숙부',
        '언니' : '처이모',
        '여동생' : '처이모',
        '아들' : '처남',
        '딸' : '처제'
    }
}, {
    gender : 'M',
    title : '처외백부',
    connection : {
        '배우자' : '처외백모',
        '아버지' : '처외조부',
        '어머니' : '처외조모',
        '형' : '처외백부',
        '남동생' : '처외백부',
        '누나' : '처이모',
        '여동생' : '처이모',
        '아들' : '외종처남',
        '딸' : '외종처형·처제'
    }
}, {
    gender : 'M',
    title : '처외숙부',
    connection : {
        '배우자' : '처외숙모',
        '아버지' : '처외조부',
        '어머니' : '처외조모',
        '누나' : '처이모',
        '형' : '처외백부',
        '남동생' : '처외숙부',
        '여동생' : '처이모',
        '아들' : '외종처남',
        '딸' : '외종처형·처제'
    }
}, {
    gender : 'M',
    title : '외종처남',
    connection : {
        '배우자' : '외종처남댁',
        '아버지' : '처외숙부',
        '어머니' : '처외숙모',
        '형' : '외종처남',
        '남동생' : '외종처남',
        '누나' : '외종처형·처제',
        '여동생' : '외종처형·처제',
        '아들' : '처외종질',
        '딸' : '처외종질녀'
    }
}, {
    gender : 'M',
    title : '처외종질',
    connection : {
        '배우자' : '처외종질부',
        '아버지' : '외종처남',
        '어머니' : '외종처남댁',
        '형' : '처외종질',
        '남동생' : '처외종질',
        '누나' : '처외종질녀',
        '여동생' : '처외종질녀',
        '아들' : '처외재종손자',
        '딸' : '처외재종손녀'
    }
}, {
    gender : 'F',
    title : '처외종질녀',
    connection : {
        '배우자' : '처외종질서',
        '아버지' : '외종처남',
        '어머니' : '외종처남댁',
        '오빠' : '처외종질',
        '남동생' : '처외종질',
        '언니' : '처외종질녀',
        '여동생' : '처외종질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '처외재종손자',
    connection : {
        '배우자' : '처외재종손부',
        '아버지' : '처외종질',
        '어머니' : '처외종질부',
        '형' : '처외재종손자',
        '남동생' : '처외재종손자',
        '누나' : '처외재종손녀',
        '여동생' : '처외재종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처외재종손녀',
    connection : {
        '배우자' : '처외재종손서',
        '아버지' : '처외종질',
        '어머니' : '처외종질부',
        '오빠' : '처외재종손자',
        '남동생' : '처외재종손자',
        '언니' : '처외재종손녀',
        '여동생' : '처외재종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '외종처형·처제',
    connection : {
        '배우자' : '외종동서',
        '아버지' : '처외숙부',
        '어머니' : '처외숙모',
        '오빠' : '외종처남',
        '남동생' : '외종처남',
        '언니' : '외종처형·처제',
        '여동생' : '외종처형·처제',
        '아들' : '처외종생질',
        '딸' : '처외종생질녀'
    }
}, {
    gender : 'M',
    title : '처외종생질',
    connection : {
        '배우자' : '처외종생질부',
        '아버지' : '외종동서',
        '어머니' : '외종처형·처제',
        '형' : '처외종생질',
        '남동생' : '처외종생질',
        '누나' : '처외종생질녀',
        '여동생' : '처외종생질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처외종생질녀',
    connection : {
        '배우자' : '처외종생질서',
        '아버지' : '외종동서',
        '어머니' : '외종처형·처제',
        '오빠' : '처외종생질',
        '남동생' : '처외종생질',
        '언니' : '처외종생질녀',
        '여동생' : '처외종생질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처이모',
    connection : {
        '배우자' : '처이모부',
        '아버지' : '처외조부',
        '어머니' : '처외조모',
        '오빠' : '처외숙부',
        '남동생' : '처외숙부',
        '언니' : '처이모',
        '여동생' : '처이모',
        '아들' : '이종처남',
        '딸' : '이종처형·처제'
    }
}, {
    gender : 'M',
    title : '이종처남',
    connection : {
        '배우자' : '이종처남댁',
        '아버지' : '처이모부',
        '어머니' : '처이모',
        '형' : '이종처남',
        '남동생' : '이종처남',
        '누나' : '이종처형·처제',
        '여동생' : '이종처형·처제',
        '아들' : '처이종질',
        '딸' : '처이종질녀'
    }
}, {
    gender : 'M',
    title : '처이종질',
    connection : {
        '배우자' : '처이종질부',
        '아버지' : '이종처남',
        '어머니' : '이종처남댁',
        '형' : '처이종질',
        '남동생' : '처이종질',
        '누나' : '처이종질녀',
        '여동생' : '처이종질녀',
        '아들' : '처이재종손자',
        '딸' : '처이재종손녀'
    }
}, {
    gender : 'M',
    title : '처이재종손자',
    connection : {
        '배우자' : '처이재종손부',
        '아버지' : '처이종질',
        '어머니' : '처이종질부',
        '형' : '처이재종손자',
        '남동생' : '처이재종손자',
        '누나' : '처이재종손녀',
        '여동생' : '처이재종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처이재종손녀',
    connection : {
        '배우자' : '처이재종손서',
        '아버지' : '처이종질',
        '어머니' : '처이종질부',
        '오빠' : '처이재종손자',
        '남동생' : '처이재종손자',
        '언니' : '처이재종손녀',
        '여동생' : '처이재종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처이종질녀',
    connection : {
        '배우자' : '처이종질서',
        '아버지' : '이종처남',
        '어머니' : '이종처남댁',
        '오빠' : '처이종질',
        '남동생' : '처이종질',
        '언니' : '처이종질녀',
        '여동생' : '처이종질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '이종처형·처제',
    connection : {
        '배우자' : '이종동서',
        '아버지' : '처이모부',
        '어머니' : '처이모',
        '오빠' : '이종처남',
        '남동생' : '이종처남',
        '언니' : '이종처형·처제',
        '여동생' : '이종처형·처제',
        '아들' : '처이종이질',
        '딸' : '처이종이질녀'
    }
}, {
    gender : 'M',
    title : '처이종이질',
    connection : {
        '배우자' : '처이종이질부',
        '아버지' : '이종동서',
        '어머니' : '이종처형·처제',
        '형' : '처이종이질',
        '남동생' : '처이종이질',
        '누나' : '처이종이질녀',
        '여동생' : '처이종이질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처이종이질녀',
    connection : {
        '배우자' : '처이종이질서',
        '아버지' : '이종동서',
        '어머니' : '이종처형·처제',
        '오빠' : '처이종이질',
        '남동생' : '처이종이질',
        '언니' : '처이종이질녀',
        '여동생' : '처이종이질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '처외조부',
    connection : {
        '배우자' : '처외조모',
        '아버지' : '처외증조부',
        '어머니' : '처외증조모',
        '형' : '처외종조부',
        '남동생' : '처외종조부',
        '누나' : '처외대고모',
        '여동생' : '처외대고모',
        '아들' : '처외숙부',
        '딸' : '처이모'
    }
}, {
    gender : 'M',
    title : '처외종조부',
    connection : {
        '배우자' : '처외종조모',
        '아버지' : '처외증조부',
        '어머니' : '처외증조모',
        '형' : '처외종조부',
        '남동생' : '처외종조부',
        '누나' : '처외대고모',
        '여동생' : '처외대고모',
        '아들' : '처외종숙부',
        '딸' : '처외종이모'
    }
}, {
    gender : 'M',
    title : '처외종숙부',
    connection : {
        '배우자' : '처외종숙모',
        '아버지' : '처외종조부',
        '어머니' : '처외종조모',
        '형' : '처외종숙부',
        '남동생' : '처외종숙부',
        '누나' : '처외종이모',
        '여동생' : '처외종이모',
        '아들' : '외재종처남',
        '딸' : '외재종처형'
    }
}, {
    gender : 'M',
    title : '외재종처남',
    connection : {
        '배우자' : '외재종처남댁',
        '아버지' : '처외종숙부',
        '어머니' : '처외종숙모',
        '형' : '외재종처남',
        '남동생' : '외재종처남',
        '누나' : '외재종처형',
        '여동생' : '외재종처형',
        '아들' : '처외재종질',
        '딸' : '처외재종질녀'
    }
}, {
    gender : 'M',
    title : '처외재종질',
    connection : {
        '배우자' : '처외재종질부',
        '아버지' : '외재종처남',
        '어머니' : '외재종처남댁',
        '형' : '처외재종질',
        '남동생' : '처외재종질',
        '누나' : '처외재종질녀',
        '여동생' : '처외재종질녀',
        '아들' : '처외삼종손자',
        '딸' : '처외삼종손녀'
    }
}, {
    gender : 'M',
    title : '처외삼종손자',
    connection : {
        '배우자' : '처외삼종손부',
        '아버지' : '처외재종질',
        '어머니' : '처외재종질부',
        '형' : '처외삼종손자',
        '남동생' : '처외삼종손자',
        '누나' : '처외삼종손녀',
        '여동생' : '처외삼종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처외삼종손녀',
    connection : {
        '배우자' : '처외삼종손서',
        '아버지' : '처외재종질',
        '어머니' : '처외재종질부',
        '오빠' : '처외삼종손자',
        '남동생' : '처외삼종손자',
        '언니' : '처외삼종손녀',
        '여동생' : '처외삼종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처외재종질녀',
    connection : {
        '배우자' : '처외재종질서',
        '아버지' : '외재종처남',
        '어머니' : '외재종처남댁',
        '오빠' : '처외재종질',
        '남동생' : '처외재종질',
        '언니' : '처외재종질녀',
        '여동생' : '처외재종질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '외재종처형',
    connection : {
        '배우자' : '외재종형님',
        '아버지' : '처외종숙부',
        '어머니' : '처외종숙모',
        '오빠' : '외재종처남',
        '남동생' : '외재종처남',
        '언니' : '외재종처형',
        '여동생' : '외재종처형',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처외종이모',
    connection : {
        '배우자' : '처외종이모부',
        '아버지' : '처외종조부',
        '어머니' : '처외종조모',
        '오빠' : '처외종숙부',
        '남동생' : '처외종숙부',
        '언니' : '처외종이모',
        '여동생' : '처외종이모',
        '아들' : '종이재종처남',
        '딸' : '종이재종처형'
    }
}, {
    gender : 'M',
    title : '종이재종처남',
    connection : {
        '배우자' : '종이재종처남댁',
        '아버지' : '처외종이모부',
        '어머니' : '처외종이모',
        '형' : '종이재종처남',
        '남동생' : '종이재종처남',
        '누나' : '종이재종처형',
        '여동생' : '종이재종처형',
        '아들' : '처이재종질',
        '딸' : '처이재종질녀'
    }
}, {
    gender : 'M',
    title : '처이재종질',
    connection : {
        '배우자' : '처이재종질부',
        '아버지' : '종이재종처남',
        '어머니' : '종이재종처남댁',
        '형' : '처이재종질',
        '남동생' : '처이재종질',
        '누나' : '처이재종질녀',
        '여동생' : '처이재종질녀',
        '아들' : '처이삼종손자',
        '딸' : '처이삼종손녀'
    }
}, {
    gender : 'M',
    title : '처이삼종손자',
    connection : {
        '배우자' : '처이삼종손부',
        '아버지' : '처이재종질',
        '어머니' : '처이재종질부',
        '형' : '처이삼종손자',
        '남동생' : '처이삼종손자',
        '누나' : '처이삼종손녀',
        '여동생' : '처이삼종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처이삼종손녀',
    connection : {
        '배우자' : '처이삼종손서',
        '아버지' : '처이재종질',
        '어머니' : '처이재종질부',
        '오빠' : '처이삼종손자',
        '남동생' : '처이삼종손자',
        '언니' : '처이삼종손녀',
        '여동생' : '처이삼종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처이재종질녀',
    connection : {
        '배우자' : '처이재종질서',
        '아버지' : '종이재종처남',
        '어머니' : '종이재종처남댁',
        '오빠' : '처이재종질',
        '남동생' : '처이재종질',
        '언니' : '처이재종질녀',
        '여동생' : '처이재종질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '종이재종처형',
    connection : {
        '배우자' : '종이재종형님',
        '아버지' : '처외종이모부',
        '어머니' : '처외종이모',
        '오빠' : '종이재종처남',
        '남동생' : '종이재종처남',
        '언니' : '종이재종처형',
        '여동생' : '종이재종처형',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처외대고모',
    connection : {
        '배우자' : '처외대고모부',
        '아버지' : '처외증조부',
        '어머니' : '처외증조모',
        '오빠' : '처외종조부',
        '남동생' : '처외종조부',
        '언니' : '처외대고모',
        '여동생' : '처외대고모',
        '아들' : '처이종숙부',
        '딸' : '처외이종이모'
    }
}, {
    gender : 'M',
    title : '처이종숙부',
    connection : {
        '배우자' : '처이종숙모',
        '아버지' : '처외대고모부',
        '어머니' : '처외대고모',
        '형' : '처이종숙부',
        '남동생' : '처이종숙부',
        '누나' : '처외이종이모',
        '여동생' : '처외이종이모',
        '아들' : '이재종처남',
        '딸' : '이재종처형'
    }
}, {
    gender : 'M',
    title : '이재종처남',
    connection : {
        '배우자' : '이재종처남댁',
        '아버지' : '처이종숙부',
        '어머니' : '처이종숙모',
        '형' : '이재종처남',
        '남동생' : '이재종처남',
        '누나' : '이재종처형',
        '여동생' : '이재종처형',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '이재종처형',
    connection : {
        '배우자' : '이재종형님',
        '아버지' : '처이종숙부',
        '어머니' : '처이종숙모',
        '오빠' : '이재종처남',
        '남동생' : '이재종처남',
        '언니' : '이재종처형',
        '여동생' : '이재종처형',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처외이종이모',
    connection : {
        '배우자' : '처외이종이모부',
        '아버지' : '처외대고모부',
        '어머니' : '처외대고모',
        '오빠' : '처이종숙부',
        '남동생' : '처이종숙부',
        '언니' : '처외이종이모',
        '여동생' : '처외이종이모',
        '아들' : '처외이종이모아들',
        '딸' : '처외이종이모딸'
    }
}, {
    gender : 'M',
    title : '처외이종이모아들',
    connection : {
        '배우자' : '처외이종이모자부',
        '아버지' : '처외이종이모부',
        '어머니' : '처외이종이모',
        '형' : '처외이종이모아들',
        '남동생' : '처외이종이모아들',
        '누나' : '처외이종이모딸',
        '여동생' : '처외이종이모딸',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '처외이종이모딸',
    connection : {
        '배우자' : '처외이종이모사위',
        '아버지' : '처외이종이모부',
        '어머니' : '처외이종이모',
        '오빠' : '처외이종이모아들',
        '남동생' : '처외이종이모아들',
        '언니' : '처외이종이모딸',
        '여동생' : '처외이종이모딸',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '처외증조부',
    connection : {
        '배우자' : '처외증조모',
        '아버지' : '처외고조부',
        '어머니' : '처외고조모',
        '아들' : '처외종조부',
        '딸' : '처외대고모'
    }
}, {
    gender : 'M',
    title : '처외고조부',
    connection : {
        '배우자' : '처외고조모',
        '아버지' : '처외현조부',
        '어머니' : '처외현조모'
    }
}, {
    gender : 'M',
    title : '처외현조부',
    connection : {
        '배우자' : '처외현조모',
        '아버지' : '처외6대조부',
        '어머니' : '처외6대조모'
    }
}, {
    gender : 'M',
    title : '처외6대조부',
    connection : {
        '배우자' : '처외6대조모',
        '아버지' : '처외7대조부',
        '어머니' : '처외7대조모'
    }
}, {
    gender : 'M',
    title : '처외7대조부',
    connection : {
        '배우자' : '처외7대조모',
        '아버지' : '처외8대조부',
        '어머니' : '처외8대조모'
    }
}, {
    gender : 'M',
    title : '처외8대조부',
    connection : {
        '배우자' : '처외8대조모',
        '아버지' : '처외9대조부',
        '어머니' : '처외9대조모'
    }
}, {
    gender : 'M',
    title : '처외9대조부',
    connection : {
        '배우자' : '처외9대조모',
        '아버지' : '처외10대조부',
        '어머니' : '처외10대조모'
    }
}, {
    gender : 'M',
    title : '나',
    connection : {
        '배우자' : '아내',
        '아버지' : '장인',
        '어머니' : '장모',
        '언니' : '언니',
        '형' : '형',
        '남동생' : '남동생',
        '여동생' : '여동생',
        '아들' : '아들',
        '딸' : '딸'
    }
}, {
    gender : 'F',
    title : '아내',
    connection : {
        '배우자' : '남편',
        '아버지' : '장인',
        '어머니' : '장모',
        '언니' : '처형',
        '오빠' : '처남',
        '남동생' : '처남',
        '여동생' : '처제',
        '아들' : '아들',
        '딸' : '딸'
    }
}, {
    gender : 'M',
    title : '아들',
    connection : {
        '배우자' : '며느리',
        '아버지' : '나',
        '어머니' : '아내',
        '누나' : '딸',
        '형' : '아들',
        '남동생' : '아들',
        '여동생' : '딸',
        '아들' : '손자',
        '딸' : '손녀'
    }
}, {
    gender : 'M',
    title : '손자',
    connection : {
        '배우자' : '손부',
        '아버지' : '아들',
        '어머니' : '며느리',
        '누나' : '손녀',
        '형' : '손자',
        '남동생' : '손자',
        '여동생' : '손녀',
        '아들' : '증손자',
        '딸' : '증손녀'
    }
}, {
    gender : 'F',
    title : '손녀',
    connection : {
        '배우자' : '손서',
        '아버지' : '아들',
        '어머니' : '며느리',
        '언니' : '손녀',
        '오빠' : '손자',
        '남동생' : '손자',
        '여동생' : '손녀',
        '아들' : '외증손자',
        '딸' : '외증손녀'
    }
}, {
    gender : 'M',
    title : '증손자',
    connection : {
        '배우자' : '증손부',
        '아버지' : '손자',
        '어머니' : '손부',
        '누나' : '증손녀',
        '형' : '증손자',
        '남동생' : '증손자',
        '여동생' : '증손녀',
        '아들' : '고손자',
        '딸' : '고손녀'
    }
}, {
    gender : 'F',
    title : '증손녀',
    connection : {
        '배우자' : '증손서',
        '아버지' : '손자',
        '어머니' : '손부',
        '언니' : '증손녀',
        '오빠' : '증손자',
        '남동생' : '증손자',
        '여동생' : '증손녀',
        '아들' : '외고손자',
        '딸' : '외고손녀'
    }
}, {
    gender : 'M',
    title : '고손자',
    connection : {
        '배우자' : '고손부',
        '아버지' : '증손자',
        '어머니' : '증손부',
        '누나' : '고손녀',
        '형' : '고손자',
        '남동생' : '고손자',
        '여동생' : '고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '고손녀',
    connection : {
        '배우자' : '고손서',
        '아버지' : '증손자',
        '어머니' : '증손부',
        '언니' : '고손녀',
        '오빠' : '고손자',
        '남동생' : '고손자',
        '여동생' : '고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '딸',
    connection : {
        '배우자' : '사위',
        '아버지' : '나',
        '어머니' : '아내',
        '언니' : '딸',
        '오빠' : '아들',
        '남동생' : '아들',
        '여동생' : '딸',
        '아들' : '외손자',
        '딸' : '외손녀'
    }
}, {
    gender : 'M',
    title : '외손자',
    connection : {
        '배우자' : '외손자부',
        '아버지' : '사위',
        '어머니' : '딸',
        '누나' : '외손녀',
        '형' : '외손자',
        '남동생' : '외손자',
        '여동생' : '외손녀',
        '아들' : '외증손자',
        '딸' : '외증손녀'
    }
}, {
    gender : 'F',
    title : '외손녀',
    connection : {
        '배우자' : '외손서',
        '아버지' : '사위',
        '어머니' : '딸',
        '언니' : '외손녀',
        '오빠' : '외손자',
        '남동생' : '외손자',
        '여동생' : '외손녀',
        '아들' : '외증손자',
        '딸' : '외증손녀'
    }
}, {
    gender : 'M',
    title : '외고손자',
    connection : {
        '배우자' : '외고손부',
        '아버지' : '증손서',
        '어머니' : '증손녀',
        '누나' : '외고손녀',
        '형' : '외고손자',
        '남동생' : '외고손자',
        '여동생' : '외고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '외고손녀',
    connection : {
        '배우자' : '외고손서',
        '아버지' : '증손서',
        '어머니' : '증손녀',
        '언니' : '외고손녀',
        '오빠' : '외고손자',
        '남동생' : '외고손자',
        '여동생' : '외고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '외증손자',
    connection : {
        '배우자' : '외증손부',
        '아버지' : '손서',
        '어머니' : '손녀',
        '누나' : '외증손녀',
        '형' : '외증손자',
        '남동생' : '외증손자',
        '여동생' : '외증손녀',
        '아들' : '외고손자',
        '딸' : '외고손녀'
    }
}, {
    gender : 'F',
    title : '외증손녀',
    connection : {
        '배우자' : '외증손서',
        '아버지' : '손서',
        '어머니' : '손녀',
        '언니' : '외증손녀',
        '오빠' : '외증손자',
        '남동생' : '외증손자',
        '여동생' : '외증손녀',
        '아들' : '외고손자',
        '딸' : '외고손녀'
    }
},
// { gender: 'M', title:'외고손자', connection:
// {'배우자':'외고손부','아버지':'외증손서','어머니':'외증손녀','누나':'외고손녀','형':'외고손자','남동생':'외고손자','여동생':'외고손녀','아들':'호칭없음','딸':'호칭없음'}},
// { gender: 'F', title:'외고손녀', connection:
// {'배우자':'외고손서','아버지':'외증손서','어머니':'외증손녀','언니':'외고손녀','오빠':'외고손자','남동생':'외고손자','여동생':'외고손녀','아들':'호칭없음','딸':'호칭없음'}},
    {
        gender : 'M',
        title : '처남',
        connection : {
            '배우자' : '처남댁',
            '아버지' : '장인',
            '어머니' : '장모',
            '형' : '처남',
            '남동생' : '처남',
            '누나' : '처형',
            '여동생' : '처제',
            '아들' : '처질',
            '딸' : '처질녀'
        }
    }, {
        gender : 'M',
        title : '처질',
        connection : {
            '배우자' : '처질부',
            '아버지' : '처남',
            '어머니' : '처남댁',
            '형' : '처질',
            '남동생' : '처질',
            '누나' : '처질녀',
            '여동생' : '처질녀',
            '아들' : '처종손자',
            '딸' : '처종손녀'
        }
    }, {
        gender : 'M',
        title : '처종손자',
        connection : {
            '배우자' : '처종손부',
            '아버지' : '처질',
            '어머니' : '처질부',
            '형' : '처종손자',
            '남동생' : '처종손자',
            '누나' : '처종손녀',
            '여동생' : '처종손녀',
            '아들' : '처종증손자',
            '딸' : '처종증손녀'
        }
    }, {
        gender : 'M',
        title : '처종증손자',
        connection : {
            '배우자' : '처종증손부',
            '아버지' : '처종손자',
            '어머니' : '처종손부',
            '형' : '처종증손자',
            '남동생' : '처종증손자',
            '누나' : '처종증손녀',
            '여동생' : '처종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '처종증손녀',
        connection : {
            '배우자' : '처종증손서',
            '아버지' : '처종손자',
            '어머니' : '처종손부',
            '오빠' : '처종증손자',
            '남동생' : '처종증손자',
            '언니' : '처종증손녀',
            '여동생' : '처종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '처종손녀',
        connection : {
            '배우자' : '처종손서',
            '아버지' : '처질',
            '어머니' : '처질부',
            '오빠' : '처종손자',
            '남동생' : '처종손자',
            '언니' : '처종손녀',
            '여동생' : '처종손녀',
            '아들' : '처종외증손자',
            '딸' : '처종외증손녀'
        }
    }, {
        gender : 'M',
        title : '처종외증손자',
        connection : {
            '배우자' : '처종외증손부',
            '아버지' : '처종손서',
            '어머니' : '처종손녀',
            '형' : '처종외증손자',
            '남동생' : '처종외증손자',
            '누나' : '처종외증손녀',
            '여동생' : '처종외증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '처종외증손녀',
        connection : {
            '배우자' : '처종외증손서',
            '아버지' : '처종손서',
            '어머니' : '처종손녀',
            '오빠' : '처종외증손자',
            '남동생' : '처종외증손자',
            '언니' : '처종외증손녀',
            '여동생' : '처종외증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '처질녀',
        connection : {
            '배우자' : '처질서',
            '아버지' : '처남',
            '어머니' : '처남댁',
            '오빠' : '처질',
            '남동생' : '처질',
            '언니' : '처질녀',
            '여동생' : '처질녀',
            '아들' : '처외종손자',
            '딸' : '처외종손녀'
        }
    }, {
        gender : 'M',
        title : '처외종손자',
        connection : {
            '배우자' : '처외종손부',
            '아버지' : '처질서',
            '어머니' : '처질녀',
            '형' : '처외종손자',
            '남동생' : '처외종손자',
            '누나' : '처외종손녀',
            '여동생' : '처외종손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '처외종손녀',
        connection : {
            '배우자' : '처외종손서',
            '아버지' : '처질서',
            '어머니' : '처질녀',
            '오빠' : '처외종손자',
            '남동생' : '처외종손자',
            '언니' : '처외종손녀',
            '여동생' : '처외종손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'M',
        title : '남동생',
        connection : {
            '배우자' : '제수',
            '아버지' : '아버지',
            '어머니' : '어머니',
            '누나' : '누나',
            '형' : '형',
            '남동생' : '남동생',
            '여동생' : '여동생',
            '아들' : '질',
            '딸' : '질녀'
        }
    }, {
        gender : 'F',
        title : '처형',
        connection : {
            '배우자' : '동서',
            '아버지' : '장인',
            '어머니' : '장모',
            '오빠' : '처남',
            '남동생' : '처남',
            '언니' : '처형',
            '여동생' : '처형',
            '아들' : '처이질',
            '딸' : '처이질녀'
        }
    }, {
        gender : 'F',
        title : '처제',
        connection : {
            '배우자' : '동서',
            '아버지' : '장인',
            '어머니' : '장모',
            '오빠' : '처남',
            '남동생' : '처남',
            '언니' : '처제',
            '여동생' : '처제',
            '아들' : '처이질',
            '딸' : '처이질녀'
        }
    }, {
        gender : 'M',
        title : '처이질',
        connection : {
            '배우자' : '처이질부',
            '아버지' : '동서',
            '어머니' : '처제',
            '형' : '처이질',
            '남동생' : '처이질',
            '누나' : '처이질녀',
            '여동생' : '처이질녀',
            '아들' : '처이종손자',
            '딸' : '처이종손녀'
        }
    }, {
        gender : 'M',
        title : '처이종손자',
        connection : {
            '배우자' : '처이종손부',
            '아버지' : '처이질',
            '어머니' : '처이질부',
            '형' : '처이종손자',
            '남동생' : '처이종손자',
            '누나' : '처이종손녀',
            '여동생' : '처이종손녀',
            '아들' : '처이종증손자',
            '딸' : '처이종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'M',
        title : '처이종증손자',
        connection : {
            '배우자' : '처이종증손부',
            '아버지' : '처이종손자',
            '어머니' : '처이종손부',
            '형' : '처이종증손자',
            '남동생' : '처이종증손자',
            '누나' : '처이종증손녀',
            '여동생' : '처이종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '처이종증손녀',
        connection : {
            '배우자' : '처이종증손서',
            '아버지' : '처이종손자',
            '어머니' : '처이종손부',
            '오빠' : '처이종증손자',
            '남동생' : '처이종증손자',
            '언니' : '처이종증손녀',
            '여동생' : '처이종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '처이종손녀',
        connection : {
            '배우자' : '처이종손서',
            '아버지' : '처이질',
            '어머니' : '처이질부',
            '오빠' : '처이종손자',
            '남동생' : '처이종손자',
            '언니' : '처이종손녀',
            '여동생' : '처이종손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '처이질녀',
        connection : {
            '배우자' : '처이질서',
            '아버지' : '동서',
            '어머니' : '처제',
            '오빠' : '처이질',
            '남동생' : '처이질',
            '언니' : '처이질녀',
            '여동생' : '처이질녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, ];

// 여자 시가
var FTIH1 = [ {
    gender : 'M',
    title : '부',
    connection : {
        '배우자' : '시어머니',
        '아버지' : '시조부',
        '어머니' : '시조모',
        '형' : '시백부',
        '남동생' : '시숙부',
        '누나' : '시고모',
        '여동생' : '시고모',
        '아들' : '시동생',
        '딸' : '시누이'
    }
}, {
    gender : 'F',
    title : '모',
    connection : {
        '배우자' : '시아버님',
        '아버지' : '시조부',
        '어머니' : '시조모',
        '오빠' : '시백부',
        '남동생' : '시숙부',
        '언니' : '시고모',
        '여동생' : '시고모',
        '아들' : '시동생',
        '딸' : '시누이'
    }
}, {
    gender : 'M',
    title : '아버지',
    connection : {
        '배우자' : '시어머니',
        '아버지' : '시조부',
        '어머니' : '시조모',
        '형' : '시백부',
        '남동생' : '시숙부',
        '누나' : '시고모',
        '여동생' : '시고모',
        '아들' : '시동생',
        '딸' : '시누이'
    }
}, {
    gender : 'F',
    title : '어머니',
    connection : {
        '배우자' : '시아버님',
        '아버지' : '시조부',
        '어머니' : '시조모',
        '오빠' : '시백부',
        '남동생' : '시숙부',
        '언니' : '시고모',
        '여동생' : '시고모',
        '아들' : '시동생',
        '딸' : '시누이'
    }
}, {
    gender : 'M',
    title : '시백부',
    connection : {
        '배우자' : '시백모',
        '아버지' : '시조부',
        '어머니' : '시조모',
        '형' : '시백부',
        '남동생' : '시백부',
        '누나' : '시고모',
        '여동생' : '시고모',
        '아들' : '시종형제',
        '딸' : '시종누이'
    }
}, {
    gender : 'M',
    title : '시숙부',
    connection : {
        '배우자' : '시숙모',
        '아버지' : '시조부',
        '어머니' : '시조모',
        '누나' : '시고모',
        '형' : '시백부',
        '남동생' : '시숙부',
        '여동생' : '시고모',
        '아들' : '시종형제',
        '딸' : '시종누이'
    }
}, {
    gender : 'M',
    title : '시종형제',
    connection : {
        '배우자' : '시종동서',
        '아버지' : '시숙부',
        '어머니' : '시숙모',
        '형' : '시종형제',
        '남동생' : '시종형제',
        '누나' : '시종누이',
        '여동생' : '시종누이',
        '아들' : '시종질',
        '딸' : '시종질녀'
    }
}, {
    gender : 'M',
    title : '시종질',
    connection : {
        '배우자' : '시종질부',
        '아버지' : '시종형제',
        '어머니' : '시종동서',
        '형' : '시종질',
        '남동생' : '시종질',
        '누나' : '시종질녀',
        '여동생' : '시종질녀',
        '아들' : '시재종손자',
        '딸' : '시재종손녀'
    }
}, {
    gender : 'F',
    title : '시종질녀',
    connection : {
        '배우자' : '시종질서',
        '아버지' : '시종형제',
        '어머니' : '시종동서',
        '오빠' : '시종질',
        '남동생' : '시종질',
        '언니' : '시종질녀',
        '여동생' : '시종질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '시재종손자',
    connection : {
        '배우자' : '시재종손부',
        '아버지' : '시종질',
        '어머니' : '시종질부',
        '형' : '시재종손자',
        '남동생' : '시재종손자',
        '누나' : '시재종손녀',
        '여동생' : '시재종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시재종손녀',
    connection : {
        '배우자' : '시재종손서',
        '아버지' : '시종질',
        '어머니' : '시종질부',
        '오빠' : '시재종손자',
        '남동생' : '시재종손자',
        '언니' : '시재종손녀',
        '여동생' : '시재종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시종누이',
    connection : {
        '배우자' : '시종매부',
        '아버지' : '시숙부',
        '어머니' : '시숙모',
        '오빠' : '시종형제',
        '남동생' : '시종형제',
        '언니' : '시종누이',
        '여동생' : '시종누이',
        '아들' : '시종생질',
        '딸' : '시종생질녀'
    }
}, {
    gender : 'M',
    title : '시종생질',
    connection : {
        '배우자' : '시종생질부',
        '아버지' : '시종매부',
        '어머니' : '시종누이',
        '형' : '시종생질',
        '남동생' : '시종생질',
        '누나' : '시종생질녀',
        '여동생' : '시종생질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시종생질녀',
    connection : {
        '배우자' : '시종생질서',
        '아버지' : '시종매부',
        '어머니' : '시종누이',
        '오빠' : '시종생질',
        '남동생' : '시종생질',
        '언니' : '시종생질녀',
        '여동생' : '시종생질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시고모',
    connection : {
        '배우자' : '시고모부',
        '아버지' : '시조부',
        '어머니' : '시조모',
        '오빠' : '시숙부',
        '남동생' : '시숙부',
        '언니' : '시고모',
        '여동생' : '시고모',
        '아들' : '시내종형제',
        '딸' : '시내종누이'
    }
}, {
    gender : 'M',
    title : '시내종형제',
    connection : {
        '배우자' : '시내종동서',
        '아버지' : '시고모부',
        '어머니' : '시고모',
        '형' : '시내종형제',
        '남동생' : '시내종형제',
        '누나' : '시내종누이',
        '여동생' : '시내종누이',
        '아들' : '시내종질',
        '딸' : '시내종질녀'
    }
}, {
    gender : 'M',
    title : '시내종질',
    connection : {
        '배우자' : '시내종질부',
        '아버지' : '시내종형제',
        '어머니' : '시내종동서',
        '형' : '시내종질',
        '남동생' : '시내종질',
        '누나' : '시내종질녀',
        '여동생' : '시내종질녀',
        '아들' : '시내재종손자',
        '딸' : '시내재종손녀'
    }
}, {
    gender : 'M',
    title : '시내재종손자',
    connection : {
        '배우자' : '시내재종손부',
        '아버지' : '시내종질',
        '어머니' : '시내종질부',
        '형' : '시내재종손자',
        '남동생' : '시내재종손자',
        '누나' : '시내재종손녀',
        '여동생' : '시내재종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시내재종손녀',
    connection : {
        '배우자' : '시내재종손서',
        '아버지' : '시내종질',
        '어머니' : '시내종질부',
        '오빠' : '시내재종손자',
        '남동생' : '시내재종손자',
        '언니' : '시내재종손녀',
        '여동생' : '시내재종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시내종질녀',
    connection : {
        '배우자' : '시내종질서',
        '아버지' : '시내종형제',
        '어머니' : '시내종동서',
        '오빠' : '시내종질',
        '남동생' : '시내종질',
        '언니' : '시내종질녀',
        '여동생' : '시내종질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시내종누이',
    connection : {
        '배우자' : '시내종매부',
        '아버지' : '시고모부',
        '어머니' : '시고모',
        '오빠' : '시내종형제',
        '남동생' : '시내종형제',
        '언니' : '시내종누이',
        '여동생' : '시내종누이',
        '아들' : '시내종생질',
        '딸' : '시내종생질녀'
    }
}, {
    gender : 'M',
    title : '시내종생질',
    connection : {
        '배우자' : '시내종생질부',
        '아버지' : '시내종매부',
        '어머니' : '시내종누이',
        '형' : '시내종생질',
        '남동생' : '시내종생질',
        '누나' : '시내종생질녀',
        '여동생' : '시내종생질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시내종생질녀',
    connection : {
        '배우자' : '시내종생질서',
        '아버지' : '시내종매부',
        '어머니' : '시내종누이',
        '오빠' : '시내종생질',
        '남동생' : '시내종생질',
        '언니' : '시내종생질녀',
        '여동생' : '시내종생질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '시조부',
    connection : {
        '배우자' : '시조모',
        '아버지' : '시증조부',
        '어머니' : '시증조모',
        '형' : '시종조부',
        '남동생' : '시종조부',
        '누나' : '시대고모',
        '여동생' : '시대고모',
        '아들' : '시숙부',
        '딸' : '시고모'
    }
}, {
    gender : 'M',
    title : '시종조부',
    connection : {
        '배우자' : '시종조모',
        '아버지' : '시증조부',
        '어머니' : '시증조모',
        '형' : '시종조부',
        '남동생' : '시종조부',
        '누나' : '시대고모',
        '여동생' : '시대고모',
        '아들' : '시종숙부',
        '딸' : '시종고모'
    }
}, {
    gender : 'M',
    title : '시종숙부',
    connection : {
        '배우자' : '시종숙모',
        '아버지' : '시종조부',
        '어머니' : '시종조모',
        '형' : '시종숙부',
        '남동생' : '시종숙부',
        '누나' : '시종고모',
        '여동생' : '시종고모',
        '아들' : '시재종형제',
        '딸' : '재종시누이'
    }
}, {
    gender : 'M',
    title : '시재종형제',
    connection : {
        '배우자' : '시재종형님',
        '아버지' : '시종숙부',
        '어머니' : '시종숙모',
        '형' : '시재종형제',
        '남동생' : '시재종형제',
        '누나' : '재종시누이',
        '여동생' : '재종시누이',
        '아들' : '시재종질',
        '딸' : '시재종질녀'
    }
}, {
    gender : 'M',
    title : '시재종질',
    connection : {
        '배우자' : '시재종질부',
        '아버지' : '시재종형제',
        '어머니' : '시재종형님',
        '형' : '시재종질',
        '남동생' : '시재종질',
        '누나' : '시재종질녀',
        '여동생' : '시재종질녀',
        '아들' : '시삼종손자',
        '딸' : '시삼종손녀'
    }
}, {
    gender : 'M',
    title : '시삼종손자',
    connection : {
        '배우자' : '시삼종손부',
        '아버지' : '시재종질',
        '어머니' : '시재종질부',
        '형' : '시삼종손자',
        '남동생' : '시삼종손자',
        '누나' : '시삼종손녀',
        '여동생' : '시삼종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시삼종손녀',
    connection : {
        '배우자' : '시삼종손서',
        '아버지' : '시재종질',
        '어머니' : '시재종질부',
        '오빠' : '시삼종손자',
        '남동생' : '시삼종손자',
        '언니' : '시삼종손녀',
        '여동생' : '시삼종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시재종질녀',
    connection : {
        '배우자' : '시재종질서',
        '아버지' : '시재종형제',
        '어머니' : '시재종형님',
        '오빠' : '시재종질',
        '남동생' : '시재종질',
        '언니' : '시재종질녀',
        '여동생' : '시재종질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '재종시누이',
    connection : {
        '배우자' : '재종시자부',
        '아버지' : '시종숙부',
        '어머니' : '시종숙모',
        '오빠' : '시재종형제',
        '남동생' : '시재종형제',
        '언니' : '재종시누이',
        '여동생' : '재종시누이',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시종고모',
    connection : {
        '배우자' : '시종고모부',
        '아버지' : '시종조부',
        '어머니' : '시종조모',
        '오빠' : '시종숙부',
        '남동생' : '시종숙부',
        '언니' : '시종고모',
        '여동생' : '시종고모',
        '아들' : '시종고재종형제',
        '딸' : '종고재종시누이'
    }
}, {
    gender : 'M',
    title : '시종고재종형제',
    connection : {
        '배우자' : '시종고재종형님',
        '아버지' : '시종고모부',
        '어머니' : '시종고모',
        '형' : '시종고재종형제',
        '남동생' : '시종고재종형제',
        '누나' : '종고재종시누이',
        '여동생' : '종고재종시누이',
        '아들' : '시내재종질',
        '딸' : '시내재종질녀'
    }
}, {
    gender : 'M',
    title : '시내재종질',
    connection : {
        '배우자' : '시내재종질부',
        '아버지' : '시종고재종형제',
        '어머니' : '시종고재종형님',
        '형' : '시내재종질',
        '남동생' : '시내재종질',
        '누나' : '시내재종질녀',
        '여동생' : '시내재종질녀',
        '아들' : '시내삼종손자',
        '딸' : '시내삼종손녀'
    }
}, {
    gender : 'M',
    title : '시내삼종손자',
    connection : {
        '배우자' : '시내삼종손부',
        '아버지' : '시내재종질',
        '어머니' : '시내재종질부',
        '형' : '시내삼종손자',
        '남동생' : '시내삼종손자',
        '누나' : '시내삼종손녀',
        '여동생' : '시내삼종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시내삼종손녀',
    connection : {
        '배우자' : '시내삼종손서',
        '아버지' : '시내재종질',
        '어머니' : '시내재종질부',
        '오빠' : '시내삼종손자',
        '남동생' : '시내삼종손자',
        '언니' : '시내삼종손녀',
        '여동생' : '시내삼종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시내재종질녀',
    connection : {
        '배우자' : '시내재종질서',
        '아버지' : '시종고재종형제',
        '어머니' : '시종고재종형님',
        '오빠' : '시내재종질',
        '남동생' : '시내재종질',
        '언니' : '시내재종질녀',
        '여동생' : '시내재종질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '종고재종시누이',
    connection : {
        '배우자' : '종고재종시자부',
        '아버지' : '시종고모부',
        '어머니' : '시종고모',
        '오빠' : '시종고재종형제',
        '남동생' : '시종고재종형제',
        '언니' : '종고재종시누이',
        '여동생' : '종고재종시누이',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시대고모',
    connection : {
        '배우자' : '시대고모부',
        '아버지' : '시증조부',
        '어머니' : '시증조모',
        '오빠' : '시종조부',
        '남동생' : '시종조부',
        '언니' : '시대고모',
        '여동생' : '시대고모',
        '아들' : '시내종숙부',
        '딸' : '시내종고모'
    }
}, {
    gender : 'M',
    title : '시내종숙부',
    connection : {
        '배우자' : '시내종숙모',
        '아버지' : '시대고모부',
        '어머니' : '시대고모',
        '형' : '시내종숙부',
        '남동생' : '시내종숙부',
        '누나' : '시내종고모',
        '여동생' : '시내종고모',
        '아들' : '시내종형제',
        '딸' : '내재종시누이'
    }
}, {
    gender : 'M',
    title : '시내종형제',
    connection : {
        '배우자' : '시내종형님',
        '아버지' : '시내종숙부',
        '어머니' : '시내종숙모',
        '형' : '시내종형제',
        '남동생' : '시내종형제',
        '누나' : '내재종시누이',
        '여동생' : '내재종시누이',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '내재종시누이',
    connection : {
        '배우자' : '내재종시자부',
        '아버지' : '시내종숙부',
        '어머니' : '시내종숙모',
        '오빠' : '시내종형제',
        '남동생' : '시내종형제',
        '언니' : '내재종시누이',
        '여동생' : '내재종시누이',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시내종고모',
    connection : {
        '배우자' : '시내종고모부',
        '아버지' : '시대고모부',
        '어머니' : '시대고모',
        '오빠' : '시내종숙부',
        '남동생' : '시내종숙부',
        '언니' : '시내종고모',
        '여동생' : '시내종고모',
        '아들' : '시내종고모아들',
        '딸' : '시내종고모딸'
    }
}, {
    gender : 'M',
    title : '시내종고모아들',
    connection : {
        '배우자' : '시내종고모자부',
        '아버지' : '시내종고모부',
        '어머니' : '시내종고모',
        '형' : '시내종고모아들',
        '남동생' : '시내종고모아들',
        '누나' : '시내종고모딸',
        '여동생' : '시내종고모딸',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시내종고모딸',
    connection : {
        '배우자' : '시내종고모사위',
        '아버지' : '시내종고모부',
        '어머니' : '시내종고모',
        '오빠' : '시내종고모아들',
        '남동생' : '시내종고모아들',
        '언니' : '시내종고모딸',
        '여동생' : '시내종고모딸',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '시증조부',
    connection : {
        '배우자' : '시증조모',
        '아버지' : '시고조부',
        '어머니' : '시고조모',
        '아들' : '시종조부',
        '딸' : '시대고모'
    }
}, {
    gender : 'M',
    title : '시고조부',
    connection : {
        '배우자' : '시고조모',
        '아버지' : '시현조부',
        '어머니' : '시현조모'
    }
}, {
    gender : 'M',
    title : '시현조부',
    connection : {
        '배우자' : '시현조모',
        '아버지' : '시6대조부',
        '어머니' : '시6대조모'
    }
}, {
    gender : 'M',
    title : '시6대조부',
    connection : {
        '배우자' : '시6대조모',
        '아버지' : '시7대조부',
        '어머니' : '시7대조모'
    }
}, {
    gender : 'M',
    title : '시7대조부',
    connection : {
        '배우자' : '시7대조모',
        '아버지' : '시8대조부',
        '어머니' : '시8대조모'
    }
}, {
    gender : 'M',
    title : '시8대조부',
    connection : {
        '배우자' : '시8대조모',
        '아버지' : '시9대조부',
        '어머니' : '시9대조모'
    }
}, {
    gender : 'M',
    title : '시9대조부',
    connection : {
        '배우자' : '시9대조모',
        '아버지' : '시10대조부',
        '어머니' : '시10대조모'
    }
}, {
    gender : 'M',
    title : '나',
    connection : {
        '배우자' : '아내',
        '아버지' : '시아버님',
        '어머니' : '시어머니',
        '언니' : '시누이',
        '형' : '시숙',
        '남동생' : '시동생',
        '여동생' : '시누이',
        '아들' : '아들',
        '딸' : '딸'
    }
}, {
    gender : 'F',
    title : '아내',
    connection : {
        '배우자' : '남편',
        '아버지' : '시아버님',
        '어머니' : '시어머니',
        '언니' : '시누이',
        '오빠' : '시숙',
        '남동생' : '시동생',
        '여동생' : '시누이',
        '아들' : '아들',
        '딸' : '딸'
    }
}, {
    gender : 'M',
    title : '아들',
    connection : {
        '배우자' : '며느리',
        '아버지' : '나',
        '어머니' : '아내',
        '누나' : '딸',
        '형' : '아들',
        '남동생' : '아들',
        '여동생' : '딸',
        '아들' : '손자',
        '딸' : '손녀'
    }
}, {
    gender : 'M',
    title : '손자',
    connection : {
        '배우자' : '손부',
        '아버지' : '아들',
        '어머니' : '며느리',
        '누나' : '손녀',
        '형' : '손자',
        '남동생' : '손자',
        '여동생' : '손녀',
        '아들' : '증손자',
        '딸' : '증손녀'
    }
}, {
    gender : 'F',
    title : '손녀',
    connection : {
        '배우자' : '손서',
        '아버지' : '아들',
        '어머니' : '며느리',
        '언니' : '손녀',
        '오빠' : '손자',
        '남동생' : '손자',
        '여동생' : '손녀',
        '아들' : '외증손자',
        '딸' : '외증손녀'
    }
}, {
    gender : 'M',
    title : '증손자',
    connection : {
        '배우자' : '증손부',
        '아버지' : '손자',
        '어머니' : '손부',
        '누나' : '증손녀',
        '형' : '증손자',
        '남동생' : '증손자',
        '여동생' : '증손녀',
        '아들' : '고손자',
        '딸' : '고손녀'
    }
}, {
    gender : 'F',
    title : '증손녀',
    connection : {
        '배우자' : '증손서',
        '아버지' : '손자',
        '어머니' : '손부',
        '언니' : '증손녀',
        '오빠' : '증손자',
        '남동생' : '증손자',
        '여동생' : '증손녀',
        '아들' : '외고손자',
        '딸' : '외고손녀'
    }
}, {
    gender : 'M',
    title : '고손자',
    connection : {
        '배우자' : '고손부',
        '아버지' : '증손자',
        '어머니' : '증손부',
        '누나' : '고손녀',
        '형' : '고손자',
        '남동생' : '고손자',
        '여동생' : '고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '고손녀',
    connection : {
        '배우자' : '고손서',
        '아버지' : '증손자',
        '어머니' : '증손부',
        '언니' : '고손녀',
        '오빠' : '고손자',
        '남동생' : '고손자',
        '여동생' : '고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '딸',
    connection : {
        '배우자' : '사위',
        '아버지' : '나',
        '어머니' : '아내',
        '언니' : '딸',
        '오빠' : '아들',
        '남동생' : '아들',
        '여동생' : '딸',
        '아들' : '외손자',
        '딸' : '외손녀'
    }
}, {
    gender : 'M',
    title : '외손자',
    connection : {
        '배우자' : '외손자부',
        '아버지' : '사위',
        '어머니' : '딸',
        '누나' : '외손녀',
        '형' : '외손자',
        '남동생' : '외손자',
        '여동생' : '외손녀',
        '아들' : '외증손자',
        '딸' : '외증손녀'
    }
}, {
    gender : 'F',
    title : '외손녀',
    connection : {
        '배우자' : '외손서',
        '아버지' : '사위',
        '어머니' : '딸',
        '언니' : '외손녀',
        '오빠' : '외손자',
        '남동생' : '외손자',
        '여동생' : '외손녀',
        '아들' : '외증손자',
        '딸' : '외증손녀'
    }
}, {
    gender : 'M',
    title : '외고손자',
    connection : {
        '배우자' : '외고손부',
        '아버지' : '증손서',
        '어머니' : '증손녀',
        '누나' : '외고손녀',
        '형' : '외고손자',
        '남동생' : '외고손자',
        '여동생' : '외고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '외고손녀',
    connection : {
        '배우자' : '외고손서',
        '아버지' : '증손서',
        '어머니' : '증손녀',
        '언니' : '외고손녀',
        '오빠' : '외고손자',
        '남동생' : '외고손자',
        '여동생' : '외고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '외증손자',
    connection : {
        '배우자' : '외증손부',
        '아버지' : '손서',
        '어머니' : '손녀',
        '누나' : '외증손녀',
        '형' : '외증손자',
        '남동생' : '외증손자',
        '여동생' : '외증손녀',
        '아들' : '외고손자',
        '딸' : '외고손녀'
    }
}, {
    gender : 'F',
    title : '외증손녀',
    connection : {
        '배우자' : '외증손서',
        '아버지' : '손서',
        '어머니' : '손녀',
        '언니' : '외증손녀',
        '오빠' : '외증손자',
        '남동생' : '외증손자',
        '여동생' : '외증손녀',
        '아들' : '외고손자',
        '딸' : '외고손녀'
    }
},
// { gender: 'M', title:'외고손자', connection:
// {'배우자':'외고손부','아버지':'외증손서','어머니':'외증손녀','누나':'외고손녀','형':'외고손자','남동생':'외고손자','여동생':'외고손녀','아들':'호칭없음','딸':'호칭없음'}},
// { gender: 'F', title:'외고손녀', connection:
// {'배우자':'외고손서','아버지':'외증손서','어머니':'외증손녀','언니':'외고손녀','오빠':'외고손자','남동생':'외고손자','여동생':'외고손녀','아들':'호칭없음','딸':'호칭없음'}},
    {
        gender : 'M',
        title : '시동생',
        connection : {
            '배우자' : '동서',
            '아버지' : '시아버님',
            '어머니' : '시어머니',
            '형' : '시동생',
            '남동생' : '시동생',
            '누나' : '시누이',
            '여동생' : '시누이',
            '아들' : '시질',
            '딸' : '시질녀'
        }
    }, {
        gender : 'M',
        title : '시질',
        connection : {
            '배우자' : '시질부',
            '아버지' : '시동생',
            '어머니' : '동서',
            '형' : '시질',
            '남동생' : '시질',
            '누나' : '시질녀',
            '여동생' : '시질녀',
            '아들' : '시종손자',
            '딸' : '시종손녀'
        }
    }, {
        gender : 'M',
        title : '시종손자',
        connection : {
            '배우자' : '시종손부',
            '아버지' : '시질',
            '어머니' : '시질부',
            '형' : '시종손자',
            '남동생' : '시종손자',
            '누나' : '시종손녀',
            '여동생' : '시종손녀',
            '아들' : '시종증손자',
            '딸' : '시종증손녀'
        }
    }, {
        gender : 'M',
        title : '시종증손자',
        connection : {
            '배우자' : '시종증손부',
            '아버지' : '시종손자',
            '어머니' : '시종손부',
            '형' : '시종증손자',
            '남동생' : '시종증손자',
            '누나' : '시종증손녀',
            '여동생' : '시종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '시종증손녀',
        connection : {
            '배우자' : '시종증손서',
            '아버지' : '시종손자',
            '어머니' : '시종손부',
            '오빠' : '시종증손자',
            '남동생' : '시종증손자',
            '언니' : '시종증손녀',
            '여동생' : '시종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '시종손녀',
        connection : {
            '배우자' : '시종손서',
            '아버지' : '시질',
            '어머니' : '시질부',
            '오빠' : '시종손자',
            '남동생' : '시종손자',
            '언니' : '시종손녀',
            '여동생' : '시종손녀',
            '아들' : '시종외증손자',
            '딸' : '시종외증손녀'
        }
    }, {
        gender : 'M',
        title : '시종외증손자',
        connection : {
            '배우자' : '시종외증손부',
            '아버지' : '시종손서',
            '어머니' : '시종손녀',
            '형' : '시종외증손자',
            '남동생' : '시종외증손자',
            '누나' : '시종외증손녀',
            '여동생' : '시종외증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '시종외증손녀',
        connection : {
            '배우자' : '시종외증손서',
            '아버지' : '시종손서',
            '어머니' : '시종손녀',
            '오빠' : '시종외증손자',
            '남동생' : '시종외증손자',
            '언니' : '시종외증손녀',
            '여동생' : '시종외증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '시질녀',
        connection : {
            '배우자' : '시질서',
            '아버지' : '시동생',
            '어머니' : '동서',
            '오빠' : '시질',
            '남동생' : '시질',
            '언니' : '시질녀',
            '여동생' : '시질녀',
            '아들' : '시외종손자',
            '딸' : '시외종손녀'
        }
    }, {
        gender : 'M',
        title : '시외종손자',
        connection : {
            '배우자' : '시외종손부',
            '아버지' : '시질서',
            '어머니' : '시질녀',
            '형' : '시외종손자',
            '남동생' : '시외종손자',
            '누나' : '시외종손녀',
            '여동생' : '시외종손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '시외종손녀',
        connection : {
            '배우자' : '시외종손서',
            '아버지' : '시질서',
            '어머니' : '시질녀',
            '오빠' : '시외종손자',
            '남동생' : '시외종손자',
            '언니' : '시외종손녀',
            '여동생' : '시외종손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'M',
        title : '시숙',
        connection : {
            '배우자' : '동서',
            '아버지' : '시아버님',
            '어머니' : '시어머니',
            '누나' : '시누이',
            '형' : '시숙',
            '남동생' : '시숙',
            '여동생' : '시누이',
            '아들' : '시질',
            '딸' : '시질녀'
        }
    }, {
        gender : 'F',
        title : '시누이',
        connection : {
            '배우자' : '시매부',
            '아버지' : '시아버님',
            '어머니' : '장모',
            '오빠' : '시동생',
            '남동생' : '시동생',
            '언니' : '시누이',
            '여동생' : '시누이',
            '아들' : '시생질',
            '딸' : '시생질녀'
        }
    }, {
        gender : 'M',
        title : '시생질',
        connection : {
            '배우자' : '시생질부',
            '아버지' : '시매부',
            '어머니' : '시누이',
            '형' : '시생질',
            '남동생' : '시생질',
            '누나' : '시생질녀',
            '여동생' : '시생질녀',
            '아들' : '시생질손자',
            '딸' : '시생질손녀'
        }
    }, {
        gender : 'M',
        title : '시생질손자',
        connection : {
            '배우자' : '시생질손부',
            '아버지' : '시생질',
            '어머니' : '시생질부',
            '형' : '시생질손자',
            '남동생' : '시생실손자',
            '누나' : '시생실손녀',
            '여동생' : '시생질손녀',
            '아들' : '시생질증손자',
            '딸' : '시생질증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'M',
        title : '시생질증손자',
        connection : {
            '배우자' : '시생질증손부',
            '아버지' : '시생질손자',
            '어머니' : '시생질손부',
            '형' : '시생질증손자',
            '남동생' : '시생질증손자',
            '누나' : '시생질증손녀',
            '여동생' : '시생질증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '시생질증손녀',
        connection : {
            '배우자' : '시생질증손서',
            '아버지' : '시생질손자',
            '어머니' : '시생질손부',
            '오빠' : '시생질증손자',
            '남동생' : '시생질증손자',
            '언니' : '시생질증손녀',
            '여동생' : '시생질증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '시생질손녀',
        connection : {
            '배우자' : '시생질손서',
            '아버지' : '시생질',
            '어머니' : '시생질부',
            '오빠' : '시생질손자',
            '남동생' : '시생질손자',
            '언니' : '시생질손녀',
            '여동생' : '시생질손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '시생질녀',
        connection : {
            '배우자' : '시생질서',
            '아버지' : '시매부',
            '어머니' : '시누이',
            '오빠' : '시생질',
            '남동생' : '시생질',
            '언니' : '시생질녀',
            '여동생' : '시생질녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, ];

// 여자 시외가
var FTIH2 = [ {
    gender : 'M',
    title : '부',
    connection : {
        '배우자' : '시어머니',
        '아버지' : '시외조부',
        '어머니' : '시외조모',
        '형' : '시외백부',
        '남동생' : '시외숙부',
        '누나' : '시이모',
        '여동생' : '시이모',
        '아들' : '시동생',
        '딸' : '시누이'
    }
}, {
    gender : 'F',
    title : '모',
    connection : {
        '배우자' : '시아버님',
        '아버지' : '시외조부',
        '어머니' : '시외조모',
        '오빠' : '시외백부',
        '남동생' : '시외숙부',
        '언니' : '시이모',
        '여동생' : '시이모',
        '아들' : '시동생',
        '딸' : '시누이'
    }
}, {
    gender : 'M',
    title : '아버지',
    connection : {
        '배우자' : '시어머니',
        '아버지' : '시외조부',
        '어머니' : '시외조모',
        '형' : '시외백부',
        '남동생' : '시외숙부',
        '누나' : '시이모',
        '여동생' : '시이모',
        '아들' : '시동생',
        '딸' : '시누이'
    }
}, {
    gender : 'F',
    title : '어머니',
    connection : {
        '배우자' : '시아버님',
        '아버지' : '시외조부',
        '어머니' : '시외조모',
        '오빠' : '시외백부',
        '남동생' : '시외숙부',
        '언니' : '시이모',
        '여동생' : '시이모',
        '아들' : '시동생',
        '딸' : '시누이'
    }
}, {
    gender : 'M',
    title : '시외백부',
    connection : {
        '배우자' : '시외백모',
        '아버지' : '시외조부',
        '어머니' : '시외조모',
        '형' : '시외백부',
        '남동생' : '시외백부',
        '누나' : '시이모',
        '여동생' : '시이모',
        '아들' : '시외종형제',
        '딸' : '시외종누이'
    }
}, {
    gender : 'M',
    title : '시외숙부',
    connection : {
        '배우자' : '시외숙모',
        '아버지' : '시외조부',
        '어머니' : '시외조모',
        '누나' : '시이모',
        '형' : '시외백부',
        '남동생' : '시외숙부',
        '여동생' : '시이모',
        '아들' : '시외종형제',
        '딸' : '시외종누이'
    }
}, {
    gender : 'M',
    title : '시외종형제',
    connection : {
        '배우자' : '시외종동서',
        '아버지' : '시외숙부',
        '어머니' : '시외숙모',
        '형' : '시외종형제',
        '남동생' : '시외종형제',
        '누나' : '시외종누이',
        '여동생' : '시외종누이',
        '아들' : '시외종질',
        '딸' : '시외종질녀'
    }
}, {
    gender : 'M',
    title : '시외종질',
    connection : {
        '배우자' : '시외종질부',
        '아버지' : '시외종형제',
        '어머니' : '시외종동서',
        '형' : '시외종질',
        '남동생' : '시외종질',
        '누나' : '시외종질녀',
        '여동생' : '시외종질녀',
        '아들' : '시외재종손자',
        '딸' : '시외재종손녀'
    }
}, {
    gender : 'F',
    title : '시외종질녀',
    connection : {
        '배우자' : '시외종질서',
        '아버지' : '시외종형제',
        '어머니' : '시외종동서',
        '오빠' : '시외종질',
        '남동생' : '시외종질',
        '언니' : '시외종질녀',
        '여동생' : '시외종질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '시외재종손자',
    connection : {
        '배우자' : '시외재종손부',
        '아버지' : '시외종질',
        '어머니' : '시외종질부',
        '형' : '시외재종손자',
        '남동생' : '시외재종손자',
        '누나' : '시외재종손녀',
        '여동생' : '시외재종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시외재종손녀',
    connection : {
        '배우자' : '시외재종손서',
        '아버지' : '시외종질',
        '어머니' : '시외종질부',
        '오빠' : '시외재종손자',
        '남동생' : '시외재종손자',
        '언니' : '시외재종손녀',
        '여동생' : '시외재종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시외종누이',
    connection : {
        '배우자' : '시외종매부',
        '아버지' : '시외숙부',
        '어머니' : '시외숙모',
        '오빠' : '시외종형제',
        '남동생' : '시외종형제',
        '언니' : '시외종누이',
        '여동생' : '시외종누이',
        '아들' : '시외종생질',
        '딸' : '시외종생질녀'
    }
}, {
    gender : 'M',
    title : '시외종생질',
    connection : {
        '배우자' : '시외종생질부',
        '아버지' : '시외종매부',
        '어머니' : '시외종누이',
        '형' : '시외종생질',
        '남동생' : '시외종생질',
        '누나' : '시외종생질녀',
        '여동생' : '시외종생질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시외종생질녀',
    connection : {
        '배우자' : '시외종생질서',
        '아버지' : '시외종매부',
        '어머니' : '시외종누이',
        '오빠' : '시외종생질',
        '남동생' : '시외종생질',
        '언니' : '시외종생질녀',
        '여동생' : '시외종생질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시이모',
    connection : {
        '배우자' : '시이모부',
        '아버지' : '시외조부',
        '어머니' : '시외조모',
        '오빠' : '시외숙부',
        '남동생' : '시외숙부',
        '언니' : '시이모',
        '여동생' : '시이모',
        '아들' : '시이종형제',
        '딸' : '시이종누이'
    }
}, {
    gender : 'M',
    title : '시이종형제',
    connection : {
        '배우자' : '시이종동서',
        '아버지' : '시이모부',
        '어머니' : '시이모',
        '형' : '시이종형제',
        '남동생' : '시이종형제',
        '누나' : '시이종누이',
        '여동생' : '시이종누이',
        '아들' : '시이종질',
        '딸' : '시이종질녀'
    }
}, {
    gender : 'M',
    title : '시이종질',
    connection : {
        '배우자' : '시이종질부',
        '아버지' : '시이종형제',
        '어머니' : '시이종동서',
        '형' : '시이종질',
        '남동생' : '시이종질',
        '누나' : '시이종질녀',
        '여동생' : '시이종질녀',
        '아들' : '시이재종손자',
        '딸' : '시이재종손녀'
    }
}, {
    gender : 'M',
    title : '시이재종손자',
    connection : {
        '배우자' : '시이재종손부',
        '아버지' : '시이종질',
        '어머니' : '시이종질부',
        '형' : '시이재종손자',
        '남동생' : '시이재종손자',
        '누나' : '시이재종손녀',
        '여동생' : '시이재종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시이재종손녀',
    connection : {
        '배우자' : '시이재종손서',
        '아버지' : '시이종질',
        '어머니' : '시이종질부',
        '오빠' : '시이재종손자',
        '남동생' : '시이재종손자',
        '언니' : '시이재종손녀',
        '여동생' : '시이재종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시이종질녀',
    connection : {
        '배우자' : '시이종질서',
        '아버지' : '시이종형제',
        '어머니' : '시이종동서',
        '오빠' : '시이종질',
        '남동생' : '시이종질',
        '언니' : '시이종질녀',
        '여동생' : '시이종질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시이종누이',
    connection : {
        '배우자' : '시이종매부',
        '아버지' : '시이모부',
        '어머니' : '시이모',
        '오빠' : '시이종형제',
        '남동생' : '시이종형제',
        '언니' : '시이종누이',
        '여동생' : '시이종누이',
        '아들' : '시이종생질',
        '딸' : '시이종생질녀'
    }
}, {
    gender : 'M',
    title : '시이종생질',
    connection : {
        '배우자' : '시이종생질부',
        '아버지' : '시이종매부',
        '어머니' : '시이종누이',
        '형' : '시이종생질',
        '남동생' : '시이종생질',
        '누나' : '시이종생질녀',
        '여동생' : '시이종생질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시이종생질녀',
    connection : {
        '배우자' : '시이종생질서',
        '아버지' : '시이종매부',
        '어머니' : '시이종누이',
        '오빠' : '시이종생질',
        '남동생' : '시이종생질',
        '언니' : '시이종생질녀',
        '여동생' : '시이종생질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '시외조부',
    connection : {
        '배우자' : '시외조모',
        '아버지' : '시외증조부',
        '어머니' : '시외증조모',
        '형' : '시외종조부',
        '남동생' : '시외종조부',
        '누나' : '시외대고모',
        '여동생' : '시외대고모',
        '아들' : '시외숙부',
        '딸' : '시이모'
    }
}, {
    gender : 'M',
    title : '시외종조부',
    connection : {
        '배우자' : '시외종조모',
        '아버지' : '시외증조부',
        '어머니' : '시외증조모',
        '형' : '시외종조부',
        '남동생' : '시외종조부',
        '누나' : '시외대고모',
        '여동생' : '시외대고모',
        '아들' : '시외종숙부',
        '딸' : '시외종이모'
    }
}, {
    gender : 'M',
    title : '시외종숙부',
    connection : {
        '배우자' : '시외종숙모',
        '아버지' : '시외종조부',
        '어머니' : '시외종조모',
        '형' : '시외종숙부',
        '남동생' : '시외종숙부',
        '누나' : '시외종이모',
        '여동생' : '시외종이모',
        '아들' : '시외재종형제',
        '딸' : '외재종시누이'
    }
}, {
    gender : 'M',
    title : '시외재종형제',
    connection : {
        '배우자' : '시외재종형님',
        '아버지' : '시외종숙부',
        '어머니' : '시외종숙모',
        '형' : '시외재종형제',
        '남동생' : '시외재종형제',
        '누나' : '외재종시누이',
        '여동생' : '외재종시누이',
        '아들' : '시외재종질',
        '딸' : '시외재종질녀'
    }
}, {
    gender : 'M',
    title : '시외재종질',
    connection : {
        '배우자' : '시외재종질부',
        '아버지' : '시외재종형제',
        '어머니' : '시외재종형님',
        '형' : '시외재종질',
        '남동생' : '시외재종질',
        '누나' : '시외재종질녀',
        '여동생' : '시외재종질녀',
        '아들' : '시외삼종손자',
        '딸' : '시외삼종손녀'
    }
}, {
    gender : 'M',
    title : '시외삼종손자',
    connection : {
        '배우자' : '시외삼종손부',
        '아버지' : '시외재종질',
        '어머니' : '시외재종질부',
        '형' : '시외삼종손자',
        '남동생' : '시외삼종손자',
        '누나' : '시외삼종손녀',
        '여동생' : '시외삼종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시외삼종손녀',
    connection : {
        '배우자' : '시외삼종손서',
        '아버지' : '시외재종질',
        '어머니' : '시외재종질부',
        '오빠' : '시외삼종손자',
        '남동생' : '시외삼종손자',
        '언니' : '시외삼종손녀',
        '여동생' : '시외삼종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시외재종질녀',
    connection : {
        '배우자' : '시외재종질서',
        '아버지' : '시외재종형제',
        '어머니' : '시외재종형님',
        '오빠' : '시외재종질',
        '남동생' : '시외재종질',
        '언니' : '시외재종질녀',
        '여동생' : '시외재종질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '외재종시누이',
    connection : {
        '배우자' : '외재종시자부',
        '아버지' : '시외종숙부',
        '어머니' : '시외종숙모',
        '오빠' : '시외재종형제',
        '남동생' : '시외재종형제',
        '언니' : '외재종시누이',
        '여동생' : '외재종시누이',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시외종이모',
    connection : {
        '배우자' : '시외종이모부',
        '아버지' : '시외종조부',
        '어머니' : '시외종조모',
        '오빠' : '시외종숙부',
        '남동생' : '시외종숙부',
        '언니' : '시외종고모',
        '여동생' : '시외종고모',
        '아들' : '시종이재종형제',
        '딸' : '종이재종시누이'
    }
}, {
    gender : 'M',
    title : '시종이재종형제',
    connection : {
        '배우자' : '시종이재종형님',
        '아버지' : '시종이모부',
        '어머니' : '시종이모',
        '형' : '시종이재종형제',
        '남동생' : '시종이재종형제',
        '누나' : '종이재종시누이',
        '여동생' : '종이재종시누이',
        '아들' : '시이재종질',
        '딸' : '시이재종질녀'
    }
}, {
    gender : 'M',
    title : '시이재종질',
    connection : {
        '배우자' : '시이재종질부',
        '아버지' : '시종이재종형제',
        '어머니' : '시종이재종형님',
        '형' : '시이재종질',
        '남동생' : '시이재종질',
        '누나' : '시이재종질녀',
        '여동생' : '시이재종질녀',
        '아들' : '시이삼종손자',
        '딸' : '시이삼종손녀'
    }
}, {
    gender : 'M',
    title : '시이삼종손자',
    connection : {
        '배우자' : '시이삼종손부',
        '아버지' : '시이재종질',
        '어머니' : '시이재종질부',
        '형' : '시이삼종손자',
        '남동생' : '시이삼종손자',
        '누나' : '시이삼종손녀',
        '여동생' : '시이삼종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시이삼종손녀',
    connection : {
        '배우자' : '시이삼종손서',
        '아버지' : '시이재종질',
        '어머니' : '시이재종질부',
        '오빠' : '시이삼종손자',
        '남동생' : '시이삼종손자',
        '언니' : '시이삼종손녀',
        '여동생' : '시이삼종손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시이재종질녀',
    connection : {
        '배우자' : '시이재종질서',
        '아버지' : '시종이재종형제',
        '어머니' : '시종이재종형님',
        '오빠' : '시이재종질',
        '남동생' : '시이재종질',
        '언니' : '시이재종질녀',
        '여동생' : '시이재종질녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '종이재종시누이',
    connection : {
        '배우자' : '종이재종시자부',
        '아버지' : '시종이모부',
        '어머니' : '시종이모',
        '오빠' : '시종이재종형제',
        '남동생' : '시종이재종형제',
        '언니' : '종이재종시누이',
        '여동생' : '종이재종시누이',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시외대고모',
    connection : {
        '배우자' : '시외대고모부',
        '아버지' : '시외증조부',
        '어머니' : '시외증조모',
        '오빠' : '시외종조부',
        '남동생' : '시외종조부',
        '언니' : '시외대고모',
        '여동생' : '시외대고모',
        '아들' : '시이종숙부',
        '딸' : '시이종이모'
    }
}, {
    gender : 'M',
    title : '시이종숙부',
    connection : {
        '배우자' : '시이종숙모',
        '아버지' : '시외대고모부',
        '어머니' : '시외대고모',
        '형' : '시이종숙부',
        '남동생' : '시이종숙부',
        '누나' : '시이종이모',
        '여동생' : '시이종이모',
        '아들' : '시이재종형제',
        '딸' : '이재종시누이'
    }
}, {
    gender : 'M',
    title : '시이재종형제',
    connection : {
        '배우자' : '시이재종형님',
        '아버지' : '시이종숙부',
        '어머니' : '시이종숙모',
        '형' : '시이재종형제',
        '남동생' : '시이재종형제',
        '누나' : '이재종시누이',
        '여동생' : '이재종시누이',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '이재종시누이',
    connection : {
        '배우자' : '이재종시자부',
        '아버지' : '시이종숙부',
        '어머니' : '시이종숙모',
        '오빠' : '시이재종형제',
        '남동생' : '시이재종형제',
        '언니' : '이재종시누이',
        '여동생' : '이재종시누이',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시이종이모',
    connection : {
        '배우자' : '시이종이모부',
        '아버지' : '시외대고모부',
        '어머니' : '시외대고모',
        '오빠' : '시이종숙부',
        '남동생' : '시이종숙부',
        '언니' : '시이종이모',
        '여동생' : '시이종이모',
        '아들' : '시외이종이모아들',
        '딸' : '시내종고모딸'
    }
}, {
    gender : 'M',
    title : '시외이종이모아들',
    connection : {
        '배우자' : '시외이종이모자부',
        '아버지' : '시이종이모부',
        '어머니' : '시이종이모',
        '형' : '시외이종이모아들',
        '남동생' : '시외이종이모아들',
        '누나' : '시외이종이모딸',
        '여동생' : '시외이종이모딸',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '시외이종이모딸',
    connection : {
        '배우자' : '시외이종이모사위',
        '아버지' : '시이종이모부',
        '어머니' : '시이종이모',
        '오빠' : '시외이종이모아들',
        '남동생' : '시외이종이모아들',
        '언니' : '시외이종이모딸',
        '여동생' : '시외이종이모딸',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '시외증조부',
    connection : {
        '배우자' : '시외증조모',
        '아버지' : '시외고조부',
        '어머니' : '시외고조모',
        '아들' : '시외종조부',
        '딸' : '시외대고모'
    }
}, {
    gender : 'M',
    title : '시외고조부',
    connection : {
        '배우자' : '시외고조모',
        '아버지' : '시외현조부',
        '어머니' : '시외현조모'
    }
}, {
    gender : 'M',
    title : '시외현조부',
    connection : {
        '배우자' : '시외현조모',
        '아버지' : '시외6대조부',
        '어머니' : '시외6대조모'
    }
}, {
    gender : 'M',
    title : '시외6대조부',
    connection : {
        '배우자' : '시외6대조모',
        '아버지' : '시외7대조부',
        '어머니' : '시외7대조모'
    }
}, {
    gender : 'M',
    title : '시외7대조부',
    connection : {
        '배우자' : '시외7대조모',
        '아버지' : '시외8대조부',
        '어머니' : '시외8대조모'
    }
}, {
    gender : 'M',
    title : '시외8대조부',
    connection : {
        '배우자' : '시외8대조모',
        '아버지' : '시외9대조부',
        '어머니' : '시외9대조모'
    }
}, {
    gender : 'M',
    title : '시외9대조부',
    connection : {
        '배우자' : '시외9대조모',
        '아버지' : '시외10대조부',
        '어머니' : '시외10대조모'
    }
}, {
    gender : 'M',
    title : '나',
    connection : {
        '배우자' : '아내',
        '아버지' : '시아버님',
        '어머니' : '시어머니',
        '언니' : '시누이',
        '형' : '시숙',
        '남동생' : '시동생',
        '여동생' : '시누이',
        '아들' : '아들',
        '딸' : '딸'
    }
}, {
    gender : 'F',
    title : '아내',
    connection : {
        '배우자' : '남편',
        '아버지' : '시아버님',
        '어머니' : '시어머니',
        '언니' : '시누이',
        '오빠' : '시숙',
        '남동생' : '시동생',
        '여동생' : '시누이',
        '아들' : '아들',
        '딸' : '딸'
    }
}, {
    gender : 'M',
    title : '아들',
    connection : {
        '배우자' : '며느리',
        '아버지' : '나',
        '어머니' : '아내',
        '누나' : '딸',
        '형' : '아들',
        '남동생' : '아들',
        '여동생' : '딸',
        '아들' : '손자',
        '딸' : '손녀'
    }
}, {
    gender : 'M',
    title : '손자',
    connection : {
        '배우자' : '손부',
        '아버지' : '아들',
        '어머니' : '며느리',
        '누나' : '손녀',
        '형' : '손자',
        '남동생' : '손자',
        '여동생' : '손녀',
        '아들' : '증손자',
        '딸' : '증손녀'
    }
}, {
    gender : 'F',
    title : '손녀',
    connection : {
        '배우자' : '손서',
        '아버지' : '아들',
        '어머니' : '며느리',
        '언니' : '손녀',
        '오빠' : '손자',
        '남동생' : '손자',
        '여동생' : '손녀',
        '아들' : '외증손자',
        '딸' : '외증손녀'
    }
}, {
    gender : 'M',
    title : '증손자',
    connection : {
        '배우자' : '증손부',
        '아버지' : '손자',
        '어머니' : '손부',
        '누나' : '증손녀',
        '형' : '증손자',
        '남동생' : '증손자',
        '여동생' : '증손녀',
        '아들' : '고손자',
        '딸' : '고손녀'
    }
}, {
    gender : 'F',
    title : '증손녀',
    connection : {
        '배우자' : '증손서',
        '아버지' : '손자',
        '어머니' : '손부',
        '언니' : '증손녀',
        '오빠' : '증손자',
        '남동생' : '증손자',
        '여동생' : '증손녀',
        '아들' : '외고손자',
        '딸' : '외고손녀'
    }
}, {
    gender : 'M',
    title : '고손자',
    connection : {
        '배우자' : '고손부',
        '아버지' : '증손자',
        '어머니' : '증손부',
        '누나' : '고손녀',
        '형' : '고손자',
        '남동생' : '고손자',
        '여동생' : '고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '고손녀',
    connection : {
        '배우자' : '고손서',
        '아버지' : '증손자',
        '어머니' : '증손부',
        '언니' : '고손녀',
        '오빠' : '고손자',
        '남동생' : '고손자',
        '여동생' : '고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '딸',
    connection : {
        '배우자' : '사위',
        '아버지' : '나',
        '어머니' : '아내',
        '언니' : '딸',
        '오빠' : '아들',
        '남동생' : '아들',
        '여동생' : '딸',
        '아들' : '외손자',
        '딸' : '외손녀'
    }
}, {
    gender : 'M',
    title : '외손자',
    connection : {
        '배우자' : '외손자부',
        '아버지' : '사위',
        '어머니' : '딸',
        '누나' : '외손녀',
        '형' : '외손자',
        '남동생' : '외손자',
        '여동생' : '외손녀',
        '아들' : '외증손자',
        '딸' : '외증손녀'
    }
}, {
    gender : 'F',
    title : '외손녀',
    connection : {
        '배우자' : '외손서',
        '아버지' : '사위',
        '어머니' : '딸',
        '언니' : '외손녀',
        '오빠' : '외손자',
        '남동생' : '외손자',
        '여동생' : '외손녀',
        '아들' : '외증손자',
        '딸' : '외증손녀'
    }
}, {
    gender : 'M',
    title : '외고손자',
    connection : {
        '배우자' : '외고손부',
        '아버지' : '증손서',
        '어머니' : '증손녀',
        '누나' : '외고손녀',
        '형' : '외고손자',
        '남동생' : '외고손자',
        '여동생' : '외고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'F',
    title : '외고손녀',
    connection : {
        '배우자' : '외고손서',
        '아버지' : '증손서',
        '어머니' : '증손녀',
        '언니' : '외고손녀',
        '오빠' : '외고손자',
        '남동생' : '외고손자',
        '여동생' : '외고손녀',
        '아들' : '호칭없음',
        '딸' : '호칭없음'
    }
}, {
    gender : 'M',
    title : '외증손자',
    connection : {
        '배우자' : '외증손부',
        '아버지' : '손서',
        '어머니' : '손녀',
        '누나' : '외증손녀',
        '형' : '외증손자',
        '남동생' : '외증손자',
        '여동생' : '외증손녀',
        '아들' : '외고손자',
        '딸' : '외고손녀'
    }
}, {
    gender : 'F',
    title : '외증손녀',
    connection : {
        '배우자' : '외증손서',
        '아버지' : '손서',
        '어머니' : '손녀',
        '언니' : '외증손녀',
        '오빠' : '외증손자',
        '남동생' : '외증손자',
        '여동생' : '외증손녀',
        '아들' : '외고손자',
        '딸' : '외고손녀'
    }
},
// { gender: 'M', title:'외고손자', connection:
// {'배우자':'외고손부','아버지':'외증손서','어머니':'외증손녀','누나':'외고손녀','형':'외고손자','남동생':'외고손자','여동생':'외고손녀','아들':'호칭없음','딸':'호칭없음'}},
// { gender: 'F', title:'외고손녀', connection:
// {'배우자':'외고손서','아버지':'외증손서','어머니':'외증손녀','언니':'외고손녀','오빠':'외고손자','남동생':'외고손자','여동생':'외고손녀','아들':'호칭없음','딸':'호칭없음'}},
    {
        gender : 'M',
        title : '시동생',
        connection : {
            '배우자' : '동서',
            '아버지' : '시아버님',
            '어머니' : '시어머니',
            '형' : '시동생',
            '남동생' : '시동생',
            '누나' : '시누이',
            '여동생' : '시누이',
            '아들' : '시질',
            '딸' : '시질녀'
        }
    }, {
        gender : 'M',
        title : '시질',
        connection : {
            '배우자' : '시질부',
            '아버지' : '시동생',
            '어머니' : '동서',
            '형' : '시질',
            '남동생' : '시질',
            '누나' : '시질녀',
            '여동생' : '시질녀',
            '아들' : '시종손자',
            '딸' : '시종손녀'
        }
    }, {
        gender : 'M',
        title : '시종손자',
        connection : {
            '배우자' : '시종손부',
            '아버지' : '시질',
            '어머니' : '시질부',
            '형' : '시종손자',
            '남동생' : '시종손자',
            '누나' : '시종손녀',
            '여동생' : '시종손녀',
            '아들' : '시종증손자',
            '딸' : '시종증손녀'
        }
    }, {
        gender : 'M',
        title : '시종증손자',
        connection : {
            '배우자' : '시종증손부',
            '아버지' : '시종손자',
            '어머니' : '시종손부',
            '형' : '시종증손자',
            '남동생' : '시종증손자',
            '누나' : '시종증손녀',
            '여동생' : '시종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '시종증손녀',
        connection : {
            '배우자' : '시종증손서',
            '아버지' : '시종손자',
            '어머니' : '시종손부',
            '오빠' : '시종증손자',
            '남동생' : '시종증손자',
            '언니' : '시종증손녀',
            '여동생' : '시종증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '시종손녀',
        connection : {
            '배우자' : '시종손서',
            '아버지' : '시질',
            '어머니' : '시질부',
            '오빠' : '시종손자',
            '남동생' : '시종손자',
            '언니' : '시종손녀',
            '여동생' : '시종손녀',
            '아들' : '시종외증손자',
            '딸' : '시종외증손녀'
        }
    }, {
        gender : 'M',
        title : '시종외증손자',
        connection : {
            '배우자' : '시종외증손부',
            '아버지' : '시종손서',
            '어머니' : '시종손녀',
            '형' : '시종외증손자',
            '남동생' : '시종외증손자',
            '누나' : '시종외증손녀',
            '여동생' : '시종외증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '시종외증손녀',
        connection : {
            '배우자' : '시종외증손서',
            '아버지' : '시종손서',
            '어머니' : '시종손녀',
            '오빠' : '시종외증손자',
            '남동생' : '시종외증손자',
            '언니' : '시종외증손녀',
            '여동생' : '시종외증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '시질녀',
        connection : {
            '배우자' : '시질서',
            '아버지' : '시동생',
            '어머니' : '동서',
            '오빠' : '시질',
            '남동생' : '시질',
            '언니' : '시질녀',
            '여동생' : '시질녀',
            '아들' : '시외종손자',
            '딸' : '시외종손녀'
        }
    }, {
        gender : 'M',
        title : '시외종손자',
        connection : {
            '배우자' : '시외종손부',
            '아버지' : '시질서',
            '어머니' : '시질녀',
            '형' : '시외종손자',
            '남동생' : '시외종손자',
            '누나' : '시외종손녀',
            '여동생' : '시외종손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '시외종손녀',
        connection : {
            '배우자' : '시외종손서',
            '아버지' : '시질서',
            '어머니' : '시질녀',
            '오빠' : '시외종손자',
            '남동생' : '시외종손자',
            '언니' : '시외종손녀',
            '여동생' : '시외종손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'M',
        title : '시숙',
        connection : {
            '배우자' : '동서',
            '아버지' : '시아버님',
            '어머니' : '시어머니',
            '누나' : '시누이',
            '형' : '시숙',
            '남동생' : '시숙',
            '여동생' : '시누이',
            '아들' : '시질',
            '딸' : '시질녀'
        }
    }, {
        gender : 'F',
        title : '시누이',
        connection : {
            '배우자' : '시매부',
            '아버지' : '시아버님',
            '어머니' : '장모',
            '오빠' : '시동생',
            '남동생' : '시동생',
            '언니' : '시누이',
            '여동생' : '시누이',
            '아들' : '시생질',
            '딸' : '시생질녀'
        }
    }, {
        gender : 'M',
        title : '시생질',
        connection : {
            '배우자' : '시생질부',
            '아버지' : '시매부',
            '어머니' : '시누이',
            '형' : '시생질',
            '남동생' : '시생질',
            '누나' : '시생질녀',
            '여동생' : '시생질녀',
            '아들' : '시생질손자',
            '딸' : '시생질손녀'
        }
    }, {
        gender : 'M',
        title : '시생질손자',
        connection : {
            '배우자' : '시생질손부',
            '아버지' : '시생질',
            '어머니' : '시생질부',
            '형' : '시생질손자',
            '남동생' : '시생실손자',
            '누나' : '시생실손녀',
            '여동생' : '시생질손녀',
            '아들' : '시생질증손자',
            '딸' : '시생질증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'M',
        title : '시생질증손자',
        connection : {
            '배우자' : '시생질증손부',
            '아버지' : '시생질손자',
            '어머니' : '시생질손부',
            '형' : '시생질증손자',
            '남동생' : '시생질증손자',
            '누나' : '시생질증손녀',
            '여동생' : '시생질증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '시생질증손녀',
        connection : {
            '배우자' : '시생질증손서',
            '아버지' : '시생질손자',
            '어머니' : '시생질손부',
            '오빠' : '시생질증손자',
            '남동생' : '시생질증손자',
            '언니' : '시생질증손녀',
            '여동생' : '시생질증손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '시생질손녀',
        connection : {
            '배우자' : '시생질손서',
            '아버지' : '시생질',
            '어머니' : '시생질부',
            '오빠' : '시생질손자',
            '남동생' : '시생질손자',
            '언니' : '시생질손녀',
            '여동생' : '시생질손녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, {
        gender : 'F',
        title : '시생질녀',
        connection : {
            '배우자' : '시생질서',
            '아버지' : '시매부',
            '어머니' : '시누이',
            '오빠' : '시생질',
            '남동생' : '시생질',
            '언니' : '시생질녀',
            '여동생' : '시생질녀',
            '아들' : '호칭없음',
            '딸' : '호칭없음'
        }
    }, ];
